&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.РегистрСведений) Тогда
		ЭтаФорма.Объект.РегистрСведений = ЭтаФорма.Параметры.РегистрСведений;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Измерение) Тогда
		ЭтаФорма.Объект.Измерение = ЭтаФорма.Параметры.Измерение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Ресурс) Тогда
		ЭтаФорма.Объект.Ресурс = ЭтаФорма.Параметры.Ресурс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеИзмерения) Тогда
		ЭтаФорма.Объект.ЗначениеИзмерения = ЭтаФорма.Параметры.ЗначениеИзмерения;
		
		//Если при вызове формы параметры заполнены, значит она вызвана не напрямую,
		// т.е. не предполагает изменение этих настроек, поэтому скроем все закладки, кроме "СтрДанные"
		
		ЭтаФорма.Элементы.СтрПараметрыТаблицы.Видимость = Ложь;
		ЭтаФорма.Элементы.СтрОтладкаСкрыть.Видимость	=Ложь;
	КонецЕсли;
	
	//Установи настройки по умолчанию
	//------------------------------------
	Об = РеквизитФормыВЗначение("Объект");                        
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформируйСписокВыбора(ИмяОбъектаМетаданных)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ Т.Ссылка КАК Ссылка, ПРЕДСТАВЛЕНИЕ(Т.Ссылка) КАК Представление ИЗ Справочник.ТочкиЦелевые КАК Т ГДЕ Т.ПометкаУдаления = ЛОЖЬ";	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ТочкиЦелевые", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.ТЗКолонка2.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Команда2_НаСервере(); 
КонецПроцедуры

&НаСервере
Процедура Команда1_НаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Сериализовать();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1_НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2_НаСервере()  
	Об = РеквизитФормыВЗначение("Объект");
	Об.Десериализовать();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2_НаСервере()
КонецПроцедуры
