
Функция УстановитьНастройки(ОтборПоТочкам = Истина) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиПодразделения.Подразделение.Код КАК Код,
	|	ПользователиПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ01
	|ИЗ
	|	Справочник.Пользователи.Подразделения КАК ПользователиПодразделения
	|ГДЕ
	|	ПользователиПодразделения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Предприятие.Код КАК Код
	|ИЗ
	|	Справочник.Предприятие КАК Предприятие
	|ГДЕ
	|	Предприятие.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ01.Подразделение
	|			ИЗ
	|				ВТ01)";
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	ДоступныеПодразделенияКоды = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	МассивДоступныхТочекПродаж = Новый Массив();
	
	Если ДоступныеПодразделенияКоды.Количество()>0 Тогда
		Обр = Обработки.НастроечныеТаблицыXMLвУчетнойПолитике.Создать();
		Обр.УстановитьНастройки();
		Обр.Прочитать();
		
		Для Каждого Эл Из ДоступныеПодразделенияКоды Цикл
			Отб = Новый Структура();
			Отб.Вставить("Колонка2", Эл);
			Найденные = Обр.ТЗ.НайтиСтроки(Отб);
			Для Каждого Найденная Из Найденные Цикл
				МассивДоступныхТочекПродаж.Добавить(Найденная.Колонка1);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//Получи перечень точек оформления, фигуировавших в течении последнего месяца
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Точка КАК ТочкаОформления
	|ИЗ
	|	РегистрСведений.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Вид = &Вид
	|	И Продажи.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продажи.Точка";
	
	//Если не администратор и не сотрудник контакт-центра, тогда ограничение по точкам
	//---------------------------------------------------------------------------------
	Доступно = Не ПараметрыСеанса.РольДоступнаАдминистратор;
	Доступно = Доступно И МассивДоступныхТочекПродаж.Количество()>0;
	Доступно = Доступно И Не ЗначениеЗаполнено(ЗначенияСервера.ПолучитьКонтактЦентр(ПараметрыСеанса.ТекущийПользователь));
	Доступно = Доступно И ОтборПоТочкам = Истина;
	Если Доступно Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Продажи.Точка В (&ДоступныеТочкиПродажи)");
		Запрос.УстановитьПараметр("ДоступныеТочкиПродажи", МассивДоступныхТочекПродаж);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", "Ремонт авто") ;
	Запрос.УстановитьПараметр("ДатаДок", ТекущаяДата());
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование); 
	Если Рез.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.ТочкиОформления.Добавить();
		Новая.ТочкаОформления	= Выб.ТочкаОформления;
		Новая.Отбор				= Истина;
	КонецЦикла;
	//Выбери вопрос 1
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 1");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса1=Рез.Выгрузить()[0][0];
	
	//Выбери вопрос 1_1
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 1");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса1=Рез.Выгрузить()[0][0];

	
	//Выбери вопрос 2
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Достоин ли наш Сервис Вашей рекомендации друзьям и знакомым? Оцените по 5-бальной шкале, где 5 - обязательно порекомендуете, 1 - нет.");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 2");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса2=Рез.Выгрузить()[0][0];

	//Выбери ответ "нет"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"нет");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""нет "" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_Нет=Рез.Выгрузить()[0][0];

	//Выбери ответ "1"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"1");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""1"" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_1=Рез.Выгрузить()[0][0];

	//Выбери ответ "2"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"2");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""2"" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_2=Рез.Выгрузить()[0][0];
	
	//Выбери ответ "3"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"3");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""3"" ");
		Возврат "";
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_3=Рез.Выгрузить()[0][0];
	
	//Выбери ответ "4"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"4");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""3"" ");
		Возврат "";
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_4=Рез.Выгрузить()[0][0];

КонецФункции

Функция СформироватьОтчет(ТаблДок, СигнатураПродажи = "") Экспорт
	//Параметр СигнатураПродажи заполнен когда отчет строится из консоли негативных отзывов
	
	ТаблДок.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ЗадачиЗвонокЛояльности.СигнатураПродажи КАК СигнатураЗадачи,
	|	ЗадачиЗвонокЛояльности.Телефон КАК Телефон,
	|	Продажи.Точка КАК Точка,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.Объект КАК Автомобиль
	|ПОМЕСТИТЬ ВТ01_Задачи
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачиЗвонокЛояльности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ЗадачиЗвонокЛояльности.СигнатураПродажи = Продажи.Сигнатура
	|ГДЕ
	|	ЗадачиЗвонокЛояльности.ДатаЗакрытия МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаЗакрытияЗадач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|	И ЗадачиЗвонокЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьРемонтаАвто)
	|	И Продажи.Точка В(&ТочкиОформления)
	|	И ЗадачиЗвонокЛояльности.ПричинаЗакрытия = """"
	|	И 2 = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Анкеты.Период) КАК Период,
	|	Анкеты.Телефон КАК Телефон,
	|	Анкеты.Вопрос КАК Вопрос,
	|	Анкеты.Номер КАК Номер,
	|	ВТ01.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ001_СрезПоследнихПоСигнатуре
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО Анкеты.СигнатураЗадачи = ВТ01.СигнатураЗадачи
	|ГДЕ
	|	Анкеты.Период <= КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкеты.Телефон,
	|	Анкеты.Вопрос,
	|	Анкеты.Номер,
	|	ВТ01.СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасширенные.СигнатураЗадачи КАК СигнатураЗадачи,
	|	АнкетыРасширенные.Вопрос КАК Вопрос,
	|	АнкетыРасширенные.Ответ КАК Ответ,
	|	АнкетыРасширенные.ОтветКомментарий.ПолнаяСтрока КАК ОтветКомментарий,
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Точка КАК Точка,
	|	ВТ01.Номер КАК Номер,
	|	ВТ01.Дата КАК Дата,
	|	ВТ01.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ01.Сотрудник КАК Сотрудник,
	|	ВТ01.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК АнкетыРасширенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ001_СрезПоследнихПоСигнатуре КАК ВТ001
	|		ПО АнкетыРасширенные.Период = ВТ001.Период
	|			И АнкетыРасширенные.Телефон = ВТ001.Телефон
	|			И АнкетыРасширенные.Вопрос = ВТ001.Вопрос
	|			И АнкетыРасширенные.Номер = ВТ001.Номер
	|			И АнкетыРасширенные.СигнатураЗадачи = ВТ001.СигнатураЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО (ВТ01.СигнатураЗадачи = АнкетыРасширенные.СигнатураЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ03_ОтборПоВопросам
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ГДЕ
	|	(ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос В (&Вопрос1, &Вопрос1_1)
	|				И ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ = &Ответ_Нет
	|			ИЛИ ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос = &Вопрос2
	|				И ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ В (&Ответ1, &Ответ2, &Ответ3, &Ответ4))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Точка КАК Точка,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Номер КАК Номер,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Дата КАК Дата,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Сотрудник КАК Сотрудник,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Автомобиль КАК Автомобиль,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Телефон КАК Телефон,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос КАК Вопрос,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ КАК Ответ,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.ОтветКомментарий КАК ОтветКомментарий
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_ОтборПоВопросам КАК ВТ03_Отбор
	|		ПО ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи = ВТ03_Отбор.СигнатураЗадачи
	|ИТОГИ ПО
	|	Точка,
	|	Номер,
	|	Дата,
	|	Сотрудник,
	|	Автомобиль,
	|	Телефон,
	|	КонтактноеЛицо,
	|	СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пакеты.Сигнатура КАК СигнатураМастерПродажи,
	|	Пакеты.Продажа КАК СигнатураПодчиненнойПродажи,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_ОтборПоВопросам КАК ВТ03_Отбор
	|		ПО Пакеты.Сигнатура = ВТ03_Отбор.СигнатураЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО Пакеты.Продажа = Продажи.Сигнатура";
	
	
	СписокВыбранныхТочекОформления = Новый Массив(); 
	Для Каждого Стр из ЭтотОбъект.ТочкиОформления Цикл
		Если Стр.Отбор = Истина Тогда
			СписокВыбранныхТочекОформления.Добавить(Стр.ТочкаОформления);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТочкиОформления", СписокВыбранныхТочекОформления);
	
	Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ЭтотОбъект.ДатаНачалаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ЭтотОбъект.ДатаКонцаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("Вопрос1", 							ЭтотОбъект.ИдВопроса1);
	Запрос.УстановитьПараметр("Вопрос1_1", 							Анкета.ДовольныЛиВыПоследнимПосещениемСтанции());
	Запрос.УстановитьПараметр("Вопрос2",							ЭтотОбъект.ИдВопроса2);
	Запрос.УстановитьПараметр("Ответ_Нет", 							ЭтотОбъект.ИдОтвет_Нет);
	Запрос.УстановитьПараметр("Ответ1", 							ЭтотОбъект.ИдОтвет_1);
	Запрос.УстановитьПараметр("Ответ2", 							ЭтотОбъект.ИдОтвет_2);
	Запрос.УстановитьПараметр("Ответ3", 							ЭтотОбъект.ИдОтвет_3);
	Запрос.УстановитьПараметр("Ответ4",								ЭтотОбъект.ИдОтвет_4);
	
	
	//Если отчет вызван из консоли негативных отзывов
	//------------------------------------------------
	Если ЗначениеЗаполнено(СигнатураПродажи) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Продажи.Сигнатура = &СигнатураПродажи");
		
		ТекДата = ТекущаяДата();
		Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ДобавитьМесяц(ТекДата, -3));
		Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ТекДата);
		Запрос.УстановитьПараметр("СигнатураПродажи",					СигнатураПродажи);
	КонецЕсли;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Рез = ПакетРезультатов[4];
	Если Рез.Пустой() Тогда
		Возврат ""; 
	КонецЕсли;
	
	ЗаказНарядыВПакетах = ПакетРезультатов[5].Выгрузить();
	
	
	Макет = ЭтотОбъект.ПолучитьМакет("МакетОтчета");
	
	ВыбТочка = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбТочка.Следующий() Цикл
		ВыбНомер = ВыбТочка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыбНомер.Следующий() Цикл
			ВыбДата = ВыбНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыбДата.Следующий() Цикл
				ВыбСотрудник = ВыбДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыбСотрудник.Следующий() Цикл
					ВыбАвтомобиль = ВыбСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыбАвтомобиль.Следующий() Цикл
						ВыбТелефон = ВыбАвтомобиль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыбТелефон.Следующий() Цикл
							ВыбКонтакт = ВыбТелефон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыбКонтакт.Следующий() Цикл
								
								ВыбСигнатура = ВыбКонтакт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыбСигнатура.Следующий() Цикл
									ОблШапка = Макет.ПолучитьОбласть("Шапка|Кол1");
									ОблШапка.Вывести(ОблШапка);

									ОблШапка = Макет.ПолучитьОбласть("Шапка|ОсновныеКолонки");
									ОблШапка.Параметры.ПечТочкаОформления = ВыбКонтакт.Точка;
									
									ЗаказНаряды = ВыбКонтакт.Номер+" от "+Формат(ВыбКонтакт.Дата, "ДФ=dd.MM.yyyy");
									Сотрудники  = ВыбКонтакт.Сотрудник;
									
									// Вывод списка заказ-нарядов и сотрудников
									//------------------------------------------
									Отб = Новый Структура();
									Отб.Вставить("СигнатураМастерПродажи", ВыбСигнатура.СигнатураЗадачи);
									Найденные = ЗаказНарядыВПакетах.НайтиСтроки(Отб);
									Для Каждого Стр Из Найденные Цикл
										ЗаказНаряды = ЗаказНаряды+";"+Стр.Номер+" от "+	Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
										
										Если СтрНайти(Сотрудники, Стр.Сотрудник)= 0 Тогда
											Сотрудники = Сотрудники + "; "+Стр.Сотрудник;
										КонецЕсли;
									КонецЦикла;
									ОблШапка.Параметры.ПечНомераДатыЗаказНарядов 	= ЗаказНаряды;
									ОблШапка.Параметры.ПечФИОСотрудников 			= Сотрудники;
									
									
									ОблШапка.Параметры.ПечАвтомобиль				= ВыбКонтакт.Автомобиль;
									ОблШапка.Параметры.ПечТелНомерКонтактногоЛица	= ВыбКонтакт.Телефон;
									ОблШапка.Параметры.ПечФИОКонтактногоЛица		= ВыбКонтакт.КонтактноеЛицо;
									
									ТаблДок.Вывести(ОблШапка);
									
									ВыбДетальные = ВыбСигнатура.Выбрать();
									Пока ВыбДетальные.Следующий() Цикл
										ОблСтр = Макет.ПолучитьОбласть("Строка|Кол1");
										ОблСтр.Вывести(ОблСтр);

										ОблСтр = Макет.ПолучитьОбласть("Строка|ОсновныеКолонки");
										ОблСтр.Параметры.ПечВопрос 				= ВыбДетальные.Вопрос;
										ОблСтр.Параметры.ПечОтвет				= ВыбДетальные.Ответ;
										ОблСтр.Параметры.ПечОтветКомментарий 	= ВыбДетальные.ОтветКомментарий;  
										
										ОблЯчеек = ТаблДок.Вывести(ОблСтр);
										
										// Условное форматирование
										//------------------------
										Доступно = ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_Нет;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_1;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_2;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_3;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_4;
										Если Доступно Тогда
												ОблЯчеек.ЦветФона = webцвета.БледноБирюзовый;	
										КонецЕсли;

									КонецЦикла;
								КонецЦикла;
								
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
КонецФункции