&НаКлиенте
Процедура ПриОткрытии(Отказ)

// Подключим обработчик ожидания для обновления информации о текущем времени пользователя
//-------------------------------------------------------------------------------------------------
	ПодключитьОбработчикОжидания("СмещениеВремениОбновить",60,Ложь);
	СмещениеВремениОбновить();
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СмещениеВремениПриИзменении(Элемент)
	СмещениеВремениОбновить();
КонецПроцедуры

&НаКлиенте
Процедура СмещениеВремениОбновить()

// Обновим текст элемента "НадписьСмещениеВремени". Создадим базовый текст
//-------------------------------------------------------------------------------------------------
	Если (Объект.СмещениеВремени = 0) Тогда
		Темп = "Время региона совпадает с Московским и составляет: ";
		Элементы.НадписьСмещениеВремени.ЦветТекста = Новый Цвет(0,128,0);
	Иначе
		Темп = "Время региона отличается от Московского и составляет: ";
		Элементы.НадписьСмещениеВремени.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;

// Сформируем текущее локальное время в регионе
//-------------------------------------------------------------------------------------------------
	ДатаВремя = ЗначенияСервера.ТекущаяДатаСервер() + (Объект.СмещениеВремени * 3600);
	ДатаВремя = СокрЛП(Формат(ДатаВремя,"ДФ=""ЧЧ 'час.' мм 'мин.'"""));
	Элементы.НадписьСмещениеВремени.Заголовок = Темп + ДатаВремя;
КонецПроцедуры
