
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	//Текущая дата
	//-------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ТекущаяДата());

	//Период
	//--------
	Пер = Новый СтандартныйПериод();
	Пер.Вариант=ВариантСтандартногоПериода.ПрошлыйМесяц;
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период1", Пер);
			
	//Вопрос "Довольны ли Вы качеством обслуживания при последнем посещении станции?"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	КонецЕсли;
	ИдВопроса1 = Рез.Выгрузить()[0][0];
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВопросДовольныЛиВыКачествомОбслуживанияПриПоследнемПосещенииСтанции", ИдВопроса1);
	
	
	//Вопрос "Достоин ли наш Сервис Вашей рекомендации друзьям и знакомым? Оцените по 5-бальной шкале, где 5 - обязательно порекомендуете, 1 - нет." 
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Достоин ли наш Сервис Вашей рекомендации друзьям и знакомым? Оцените по 5-бальной шкале, где 5 - обязательно порекомендуете, 1 - нет.");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Достоин ли наш Сервис Вашей рекомендации друзьям и знакомым? Оцените по 5-бальной шкале, где 5 - обязательно порекомендуете, 1 - нет.");
	КонецЕсли;
	ИдВопроса2=Рез.Выгрузить()[0][0];	
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДостоинЛиНашСервисВашейРекомендации", ИдВопроса2);

	//Ответ "да"
	//-----------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"да");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""да"" ");
	КонецЕсли;
	ИдОтвет_Да = Рез.Выгрузить()[0][0];
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтветДа", ИдОтвет_Да);

	
	//Ответ "4"
	//-----------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";	
	Запрос.УстановитьПараметр("Наименование", 			"4");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""1"" ");
	КонецЕсли;
	ИдОтвет_4 = Рез.Выгрузить()[0][0];
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ответ4", ИдОтвет_4);

	// Статус "Ожидает обработки"
	//---------------------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОжидаетОбработки", "Ожидает обработки");
	
	// Статус "Возвращено в работу"
	//---------------------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВозвращеноВРаботу", "Возвращено в работу");
	
	// Статус "Закрыт"
	//-----------------------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Закрыто", "Закрыто");
	
	//Свойство Статус
	//--------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СвойствоСтатус", Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000001"));
	
	//Свойство Оценка выполнения предыдущей задачи
	//-----------------------------------------------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СвойствоОценкаВыполненияПредыдущейЗадачи", Справочники.БизнесПроцессыСвойства.НайтиПоКоду("000000004"));
	
	//НормативныйСрокЗакрытия
	//------------------------
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НормативныйСрокЗакрытия", 6);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.РольДоступнаАдминистратор Тогда
		//ЭтаФорма.Элементы.КомпоновщикНастроекНастройкиОтбор.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
