Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	
	Обр = Обработки.НастроечныеТаблицыXMLвУчетнойПолитике.Создать();
	Обр.РегистрСведений 	= "УчетнаяПолитика";
	Обр.Измерение 			= "Параметр";
	Обр.Ресурс 				= "Значение";
	Обр.ЗначениеИзмерения	= "Лояльность_ПрефиксыКатегорий";
	Обр.Прочитать();
	РасшифровкаПрефиксов	= Обр.ТЗ.Выгрузить(, "Колонка1, Колонка2");

	Парам = Новый Структура();
	Парам.Вставить("Начало",	 										  Период.ДатаНачала);
	Парам.Вставить("Окончание",											  Период.ДатаОкончания);
	Парам.Вставить("ДовольныЛиВыПоследнимПосещениемСтанции", 			  Анкета._1йБазовыйВопросЛояльности());
	Парам.Вставить("ДостоинЛиНашСервисВашейРекомендацииДрузьямИЗнакомым", Анкета._2йБазовыйВопросЛояльности());
	Парам.Вставить("БазовыеВопросыЛояльности",						  	  Анкета.БазовыеВопросыЛояльностиРемонтов());
	Парам.Вставить("_4йБазовыйВопросЛояльности",						  Анкета._4йБазовыйВопросЛояльности());
	Парам.Вставить("_1",												  Анкета._1());
	Парам.Вставить("_2",												  Анкета._2());
	Парам.Вставить("_3",												  Анкета._3());
	Парам.Вставить("СфераНегатива",										  Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Сфера негатива"));
	Парам.Вставить("РасшифровкаПрефиксов",								  РасшифровкаПрефиксов);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА МастерЗадачи.СигнатураПродажи ЕСТЬ NULL
	|			ТОГДА ЗадачаЛояльности.СигнатураПродажи
	|		ИНАЧЕ МастерЗадачи.СигнатураПродажи
	|	КОНЕЦ КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ00_ЗадачиСигнатураЗамененаНаМастер
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачаЛояльности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ПО ЗадачаЛояльности.СигнатураПродажи = Пакеты.Продажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК МастерЗадачи
	|		ПО (Пакеты.Сигнатура = МастерЗадачи.СигнатураПродажи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (ВЫБОР
	|				КОГДА МастерЗадачи.СигнатураПродажи ЕСТЬ NULL
	|					ТОГДА ЗадачаЛояльности.СигнатураПродажи
	|				ИНАЧЕ ЗадачаЛояльности.СигнатураПродажи
	|			КОНЕЦ = Продажи.Сигнатура)
	|ГДЕ
	|	ЗадачаЛояльности.ДатаЗакрытия МЕЖДУ &Начало И &Окончание
	|	И ЗадачаЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьРемонтаАвто)
	|	И ЗадачаЛояльности.ПричинаЗакрытия = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ01_АнкетыРасш.СигнатураЗадачQ КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ001_АнкетыРасшСодержатСферу
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ00.СигнатураПродажи
	|					ИЗ
	|						ВТ00_ЗадачиСигнатураЗамененаНаМастер КАК ВТ00)
	|				И Вопрос = &СфераНегатива) КАК ВТ01_АнкетыРасш
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ01_АнкетыРасш.СигнатураЗадачQ КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ01_НегативныеАнкетыРасш
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ001.СигнатураПродажи
	|					ИЗ
	|						ВТ001_АнкетыРасшСодержатСферу КАК ВТ001)
	|				И Вопрос В (&БазовыеВопросыЛояльности)
	|				И Ответ В (&_1, &_2, &_3)) КАК ВТ01_АнкетыРасш
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасш.СигнатураЗадачQ КАК СигнатураПродажи,
	|	АнкетыРасш.Ответ КАК Ответ,
	|	ПОДСТРОКА(АнкетыРасш.Ответ.Наименование, 1, 10) КАК Префикс
	|ПОМЕСТИТЬ ВТ01_АнкетыРасш
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ01.СигнатураПродажи
	|					ИЗ
	|						ВТ01_НегативныеАнкетыРасш КАК ВТ01)
	|				И Вопрос = &СфераНегатива) КАК АнкетыРасш
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкОбр.СигнтраЗадачи КАК СигнтраЗадачи,
	|	АнкОбр.Вопрос КАК Вопрос,
	|	МАКСИМУМ(АнкОбр.Период) КАК Период
	|ПОМЕСТИТЬ ВТ001_АнкетаОбрСвязи
	|ИЗ
	|	РегистрСведений.АнкетыОбратнойСвязи КАК АнкОбр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбратнаяСвязьЛояльности КАК ОбратнаяСвязьЛояльности
	|		ПО (ОбратнаяСвязьЛояльности.СигнатураПродажи = АнкОбр.СигнтраЗадачи)
	|			И (ОбратнаяСвязьЛояльности.Завершен = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	АнкОбр.СигнтраЗадачи,
	|	АнкОбр.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкОбр.СигнтраЗадачи КАК СигнатураПродажи,
	|	АнкОбр.Вопрос КАК Вопрос,
	|	АнкОбр.Ответ КАК Ответ,
	|	Продажи.Точка КАК Точка,
	|	Продажи.ХарактеристикаОбъекта КАК ВидРемонта,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ02_АнкОбр
	|ИЗ
	|	РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(
	|			,
	|			(СигнтраЗадачи, Вопрос, Период) В
	|				(ВЫБРАТЬ
	|					ВТ001_АнкетаОбрСвязи.СигнтраЗадачи,
	|					ВТ001_АнкетаОбрСвязи.Вопрос,
	|					ВТ001_АнкетаОбрСвязи.Период
	|				ИЗ
	|					ВТ001_АнкетаОбрСвязи)) КАК АнкОбр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_АнкетыРасш КАК ВТ01
	|		ПО АнкОбр.СигнтраЗадачи = ВТ01.СигнатураПродажи
	|			И АнкОбр.Вопрос = ВТ01.Ответ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (ВТ01.СигнатураПродажи = Продажи.Сигнатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.СигнатураПродажи КАК СигнатураПродажи,
	|	ВТ01.Ответ КАК Вопрос,
	|	ВТ01.Префикс КАК Префикс,
	|	ЕСТЬNULL(ВТ02.Ответ, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК Ответ,
	|	Продажи.Точка КАК Точка,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.ХарактеристикаОбъекта КАК ВидРемонта,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ03_Отчет
	|ИЗ
	|	ВТ01_АнкетыРасш КАК ВТ01
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ВТ01.СигнатураПродажи = Продажи.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ02_АнкОбр КАК ВТ02
	|		ПО (ВТ02.СигнатураПродажи = ВТ01.СигнатураПродажи)
	|			И ВТ01.Ответ = ВТ02.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Т.Колонка1 КАК СТРОКА(10)) КАК Префикс,
	|	ВЫРАЗИТЬ(Т.Колонка2 КАК СТРОКА) КАК РасшифровкаПрефикса
	|ПОМЕСТИТЬ ВТ04_РасшифровкаПрефиксов
	|ИЗ
	|	&РасшифровкаПрефиксов КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.СигнатураПродажи КАК СигнатураПродажи,
	|	ВТ03.Вопрос КАК Вопрос,
	|	ЕСТЬNULL(ВТ04.РасшифровкаПрефикса, ВТ03.Префикс) КАК Префикс,
	|	ВТ03.Ответ КАК Ответ,
	|	ВТ03.Точка КАК Точка,
	|	ВТ03.Сотрудник КАК Сотрудник,
	|	ВТ03.ВидРемонта КАК ВидРемонта,
	|	ВТ03.Количество КАК Количество
	|ИЗ
	|	ВТ03_Отчет КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_РасшифровкаПрефиксов КАК ВТ04
	|		ПО ВТ03.Префикс = ВТ04.Префикс
	|			И (ВТ04.Префикс <> """")";
	
	Для Каждого i Из Парам Цикл
		Запрос.УстановитьПараметр(i.key, i.value);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();

	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);

	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);	
КонецПроцедуры