Процедура ОбработкаЗаполнения(ДанныеЗаполнения,ТекстЗаполнения,СтандартнаяОбработка)

// Если в параметре "ДанныеЗаполнения" содержится структура, то обработаем ее
//-------------------------------------------------------------------------------------------------
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура")) Тогда
		Если (ДанныеЗаполнения.Свойство("Родитель") = Истина) Тогда
			ЭтотОбъект.Родитель = ДанныеЗаполнения.Родитель;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Линейный элемент обязательно должен принадлежать группе
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Ложь) Тогда
		Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.Родитель)) Тогда
			Сообщить("Линейный элемент справочника должен обязательно принадлежать группе");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

// Нормализация реквизитов
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);

// Если текущий объект является группой
// Проверим на дублирование по Наименованию
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Истина) Тогда
		ТекстЗапроса = "
		|SELECT	COUNT(*) AS Всего
		|FROM	Справочник.КонтактЦентры
		|WHERE	(Ссылка <> &ЭтотОбъект) И (ЭтоГруппа = Истина) И (Наименование = &Наименование)";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ЭтотОбъект",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
		Результат = Запрос.Выполнить().Выбрать();

		Если (Результат.Следующий()) И (Результат.Всего > 0) Тогда
			Сообщить("Контакт-центр """ + СокрЛП(ЭтотОбъект.Наименование) + """ уже присутствует в справочнике");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//<24.04.2018_11-14, //, исключим запись справочника Предприятия>
	
	// Включим у подразделения контакт-центра признак записи исходящих звонков
	//-------------------------------------------------------------------------------------------------
	//Если (ЗначениеЗаполнено(ЭтотОбъект.Подразделение)) Тогда
	//	СпрОбъект = ЭтотОбъект.Подразделение.ПолучитьОбъект();
	//	СпрОбъект.ИсхЗапись = Истина;
	//	СпрОбъект.Записать();
	//КонецЕсли;
	
	//</24.04.2018_11-14>
КонецПроцедуры
