 Функция Получи(ПараметрыКакСтруктура)Экспорт
	//На вход функции передаются ключи, на выходе функция возвращает пары ключ-значение
	
	КодВозвратаПоУмолчанию = Ложь;
	
	Если ТипЗнч(ПараметрыКакСтруктура) <> Тип("Структура") Тогда
		Возврат КодВозвратаПоУмолчанию;
	КонецЕсли; 
	
	ПараметрыКакСтрока="";
	Для Каждого Параметр Из ПараметрыКакСтруктура Цикл
		ПараметрыКакСтрока = ПараметрыКакСтрока + """"+Параметр.Ключ+""",";	
	КонецЦикла;
	ПараметрыКакСтрока = ПараметрыКакСтрока+"#";
	ПараметрыКакСтрока = СтрЗаменить(ПараметрыКакСтрока, ",#", "" );
	
	Запрос = Новый Запрос("ВЫБРАТЬ Параметр, Значение, ТипЗначения ИЗ РегистрСведений.УчетнаяПолитика.СрезПоследних ГДЕ Параметр В(&Параметры)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Параметры",ПараметрыКакСтрока); 	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат КодВозвратаПоУмолчанию;
	КонецЕсли;
	
	Табл =  РезультатЗапроса.Выгрузить();
	
	Для Каждого Параметр Из ПараметрыКакСтруктура Цикл
		
		НайденнаяСтрока = Табл.Найти(Параметр.Ключ, "Параметр");
		Если НайденнаяСтрока = Неопределено Тогда
			//Параметр.Значение = Неопределено;
		Иначе
			
			ТипЗначенияПараметраСтрокой = НайденнаяСтрока.ТипЗначения;
			ЗначениеПараметра = НайденнаяСтрока.Значение;
			Если Тип(ТипЗначенияПараметраСтрокой) = Тип("Число") Тогда
				ЗначениеПараметра = Число(ЗначениеПараметра);
			ИначеЕсли Тип(ТипЗначенияПараметраСтрокой) = Тип("Булево") Тогда
				Если ЗначениеПараметра="ИСТИНА" Или  ЗначениеПараметра="Истина" Тогда
					ЗначениеПараметра = Истина;
				Иначе
					ЗначениеПараметра = Ложь;
				КонецЕсли;
			ИначеЕсли СтрНайти(ТипЗначенияПараметраСтрокой, "Ссылка")>0 И СтрНайти(ТипЗначенияПараметраСтрокой, "Справочник")>0 Тогда
				
				ЗначениеПараметра  = XMLЗначение(Тип(ТипЗначенияПараметраСтрокой), ЗначениеПараметра);
				
			КонецЕсли;	
			ПараметрыКакСтруктура.Удалить(Параметр.Ключ);
			ПараметрыКакСтруктура.Вставить(НайденнаяСтрока.Параметр, ЗначениеПараметра);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина
КонецФункции
