Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СКД = ПолучитьМакет("РеестрОшибок");	
	
	РеестрОшибок(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);
КонецПроцедуры

Процедура РеестрОшибок (ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Текст = 
	"ВЫБРАТЬ
	|	Звонки.Дата КАК Период,
	|	Звонки.АбонентВнешний КАК Телефон,
	|	Звонки.Сигнатура КАК Сигнатура,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦОжидание, 0) КАК КЦОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦРазговор, 0) КАК КЦРазговор,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПОжидание, 0) КАК ОПОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПРазговор, 0) КАК ОПРазговор,
	|	ЕСТЬNULL(ЗвонкиДоп.ЦелеваяТочка, ЗНАЧЕНИЕ(Справочник.ТочкиЦелевые.ПустаяСсылка)) КАК ЦелеваяТочка
	|ПОМЕСТИТЬ ВТ01_База
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтатОбщая
	|		ПО Звонки.Сигнатура = ЗвонкиСтатОбщая.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиДоп КАК ЗвонкиДоп
	|		ПО Звонки.Сигнатура = ЗвонкиДоп.Сигнатура
	|ГДЕ
	|	Звонки.Дата МЕЖДУ &Начало И &Окончание
	|	И ЗвонкиСтатОбщая.КЦСсылка = &КЦСсылка
	|	И Звонки.ЭтоВходящий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Период КАК Период,
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ01.ЦелеваяТочка КАК ЦелеваяТочка
	|ПОМЕСТИТЬ ВТ04
	|ИЗ
	|	ВТ01_База КАК ВТ01
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Анкета.Ответ КАК Ответ_ТипОбращенияПоНаправлениюДеятельности,
	|	Анкета.Телефон КАК Телефон,
	|	Анкета.Сигнатура КАК Сигнатура,
	|	МАКСИМУМ(Анкета.Период) КАК Период
	|ПОМЕСТИТЬ ВТ05_Ответ_ТипОбращенияПоНаправлениюДеятельности
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ04 КАК ВТ04
	|		ПО Анкета.Телефон = ВТ04.Телефон
	|			И Анкета.Сигнатура = ВТ04.Сигнатура
	|			И (Анкета.Вопрос = &Вопрос_ТипОбращенияПоНаправлениюДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкета.Ответ,
	|	Анкета.Телефон,
	|	Анкета.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ04.Период КАК Период,
	|	ВТ04.Телефон КАК Телефон,
	|	ВТ04.Сигнатура КАК Сигнатура,
	|	ВТ04.ЦелеваяТочка.Наименование КАК ЦелеваяТочка,
	|	ЕСТЬNULL(ВТ05.Ответ_ТипОбращенияПоНаправлениюДеятельности.Наименование, ""<пусто>"") КАК Ответ
	|ПОМЕСТИТЬ ВТ05
	|ИЗ
	|	ВТ04 КАК ВТ04
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ05_Ответ_ТипОбращенияПоНаправлениюДеятельности КАК ВТ05
	|		ПО ВТ04.Телефон = ВТ05.Телефон
	|			И ВТ04.Сигнатура = ВТ05.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ05.Период КАК Период,
	|	ВТ05.Телефон КАК Телефон,
	|	ВТ05.Сигнатура КАК Сигнатура,
	|	ВТ05.ЦелеваяТочка КАК Точка,
	|	ВТ05.Ответ КАК Ответ
	|ИЗ
	|	ВТ05 КАК ВТ05";
	
	Парам = Новый Структура("Начало, Окончание", Период.ДатаНачала,  Период.ДатаОкончания);
	Парам.Вставить("КЦСсылка",	Справочники.Предприятие.НайтиПоКоду("000000265"));
	Парам.Вставить("Вопрос_ТипОбращенияПоНаправлениюДеятельности", Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Тип обращения по направлению деятельности"));
	
	РезультатЗапроса = ОбщегоНазначения.ЗапросВыполнить(Текст, Парам);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры

