&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Линейный элемент справочника не может находиться вне группы
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(Объект.Родитель)) Тогда
		ТекстСообщения = "Регион должен обязательно принадлежать группе (стране)";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;

// Если элемент не принадлежит группе "Россия", то скроем группу "ГруппаПравила"
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.Родитель);
	Доступно = Доступно И (Объект.Родитель = Справочники.Страны.Россия);
	Элементы.ГруппаПравила.Видимость = Доступно;
	НомернойПланСформировать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Заголовок формы
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Объект.Наименование)) Тогда
		ЭтаФорма.Заголовок = "Регион: " + СокрЛП(Объект.Наименование);
	Иначе
		ЭтаФорма.Заголовок = "Новый регион";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
	НомернойПланСформировать();
	ОбновлениеОтображения();
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаСервере
Процедура НомернойПланСформировать()

// Настроим фильтрацию для списка "НомернойПлан"
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.НомернойПлан.Параметры.УстановитьЗначениеПараметра("ЭтотОбъект",Объект.Ссылка);
	Элементы.НомернойПлан.Обновить();
КонецПроцедуры
