&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если текущий пользователь не является Администратором, то отобразим в Списке только те звонки,
// которые поступили на целевые точки доступные текущему пользователю
//-------------------------------------------------------------------------------------------------
	Если ( ПараметрыСеанса.РольДоступнаАдминистратор = Ложь) Тогда
		ТекстЗапроса = СокрЛП(ЭтаФорма.Список.ТекстЗапроса) + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + "WHERE (Рег.ТочкаЦелевая IN (&ДоступныеТочки))";
		ЭтаФорма.Список.ТекстЗапроса = ТекстЗапроса;

		ДоступныеТочки = ЗначенияСервера.ДоступныеЦелевыеТочки();
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ДоступныеТочки",ДоступныеТочки);
	КонецЕсли;
	
	//Установка отборов
	//-----------------
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	
	НачалоПериода = "";
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.НачалоПериода) Тогда
		НачалоПериода = ЭтаФорма.Параметры.НачалоПериода
	Иначе
		НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлОтбора.ПравоеЗначение	=	НачалоПериода;
	ЭлОтбора.Использование	=	Истина;
	
	КонецПериода = "";
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.КонецПериода) Тогда
		КонецПериода = ЭтаФорма.Параметры.КонецПериода; 
	Иначе
		КонецПериода = КонецДня(ТекущаяДата());	
	КонецЕсли;	
	ЭлОтбора =ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлОтбора.ПравоеЗначение	=	КонецПериода;
	ЭлОтбора.Использование	=	Истина;

КонецПроцедуры
