&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаНачала) Тогда
		Сообщить("Не указана дата начала");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаОкончания) Тогда
		Сообщить("Не указана дата окончания");
		Возврат;
	КонецЕсли;
 		
	Команда2НаСервере(ЭтаФорма.Объект.ДатаНачала, ЭтаФорма.Объект.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере(ДатаНачала, ДатаОкончания)
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗагрузитьДанныеПоВсемУчетнымЗаписям(Об.ДатаНачала, Об.ДатаОкончания);
	//Об.ЗначениеВРеквизитФормы(Об, "Объект");
	
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура Команда3НаСервере()
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаНачала) Тогда
		Сообщить("Не указана дата начала");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаОкончания) Тогда
		Сообщить("Не указана дата окончания");
		Возврат;
	КонецЕсли;
 		
	Команда2НаСервере(ЭтаФорма.Объект.ДатаНачала, ЭтаФорма.Объект.ДатаОкончания);

КонецПроцедуры

&НаСервере
Процедура Команда4НаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗагрузитьДанныеПоОднойУчетнойЗаписи(Об.ДатаНачала, Об.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаНачала) Тогда
		Сообщить("Не указана дата начала");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ДатаОкончания) Тогда
		Сообщить("Не указана дата окончания");
		Возврат;
	КонецЕсли;
 		
	Команда4НаСервере();

КонецПроцедуры

