&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ОргЮнит = ОргЮнит(Объект.Код);
КонецПроцедуры

&НаСервере
Функция ОргЮнит(Тел)
	Результат = Справочники.Предприятие.ПустаяСсылка();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыПривязка.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.ОбъектыПривязка КАК ОбъектыПривязка
	|ГДЕ
	|	ОбъектыПривязка.Объект ССЫЛКА Справочник.ТелВнутренние
	|	И ОбъектыПривязка.Объект.Код = &Код";
	Запрос.УстановитьПараметр("Код", Тел);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить()[0][0];
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	ВыполнитьЗадачуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуНаСервере()
	Объект.ДатаЗакрытия 	= ТекущаяДата();
	Объект.Исполнитель		= ПараметрыСеанса.ТекущийПользователь;	
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Код;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыйОргЮнит(Команда)
	Парам = Новый Структура();
	Парам.Вставить("Должность", 	Объект.Должность);
	Парам.Вставить("Наименование",	Объект.Сотрудник);
	Парам.Вставить("СНИЛС",			Объект.СНИЛС);
	ОткрытьФорму("Справочник.Предприятие.Форма.ФормаЭлемента", Парам, ЭтаФорма, Объект.СНИЛС);
КонецПроцедуры

&НаСервере
Процедура НовыйОргЮнитНаСервере()
КонецПроцедуры



