Функция УстановиИдентификаторСтроки(ИсходнаяСтрока, ОписываемыйОбъект="", ПолнаяСтрока = "", Характеристика= "") Экспорт     
	
	Если ТипЗнч(ИсходнаяСтрока) <> Тип("Строка") Тогда
		Возврат Справочники.ИдентификаторыСтрок.ПустаяСсылка();
	КонецЕсли;
	
	МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ИсходнаяСтрока);
	
	Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
		Возврат Справочники.ИдентификаторыСтрок.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка, Характеристика ИЗ Справочник.ИдентификаторыСтрок ГДЕ МодифицированнаяСтрока ПОДОБНО &Наименование");
	Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		//Запиши новую характеристику
		//-----------------------------
		Если ЗначениеЗаполнено(Характеристика) И Выборка.Характеристика <> Характеристика Тогда	
			Запись =  Выборка.Ссылка.ПолучитьОбъект();
			Запись.Характеристика			=	Характеристика;
			Запись.Записать();
		КонецЕсли;		
		Возврат Выборка.Ссылка;		
	Иначе
		НоваяЗапись = Справочники.ИдентификаторыСтрок.СоздатьЭлемент();
		НоваяЗапись.Наименование			=	ИсходнаяСтрока;
		НоваяЗапись.МодифицированнаяСтрока	=	МодифицированнаяСтрока;
		НоваяЗапись.ОписываемыйОбъект		=	ОписываемыйОбъект;
		НоваяЗапись.Характеристика			=	Характеристика;
		
		//Используй полную строку, если длина исходной строки более 150 строк
		Доступно = СтрДлина(ИсходнаяСтрока)>150 И ПолнаяСтрока <> "";        
		НоваяЗапись.ИспользоватьПолнуюСтроку = ?(Доступно, Истина, НоваяЗапись.ИспользоватьПолнуюСтроку); 
		НоваяЗапись.ПолнаяСтрока = ?(ПолнаяСтрока = "", ИсходнаяСтрока, ПолнаяСтрока);                    
		
		НоваяЗапись.Записать();
		Возврат НоваяЗапись.Ссылка;
	КонецЕсли;
	
КонецФункции
