
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	//Убери вопрос "Вариант отчета был изменен, сохранить?"
	//----------------------------------------------------
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область Расшифровка
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	рез = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);

	Если СтрНайти(Рез, "#", , 2) >1 Тогда
		Парам = Новый Структура();
		Парам.Вставить("Сигнатура", рез);
		Если Лев(Рез,1) = "0" Тогда
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение";
		Иначе
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение";
		КонецЕсли;
		ОткрытьФорму(ИмяОткрываемойФормы, Парам, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
        Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;

КонецФункции
#КонецОбласти

#Область Выбор_периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;    
	
	ПриЗакрытииДиалогаВыбораПериода = Новый ОписаниеОповещения("ПриЗакрытииДиалогаВыбораПериода", ЭтаФорма);
	Диалог.Показать(ПриЗакрытииДиалогаВыбораПериода);
КонецПроцедуры

Процедура ПриЗакрытииДиалогаВыбораПериода(Парам1, Парам2) Экспорт
	// Парам1 - период
	// Парам2 - доп. парам
	
	Если ТипЗнч(Парам1) <> Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВыборПериода.Заголовок = " "+Формат(Парам1.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Парам1.ДатаОкончания, "ДЛФ=Д");
	Отчет.Период = Парам1;
КонецПроцедуры

#КонецОбласти


