Функция Производительность_Очистить()Экспорт
	// Очистка регистра сведений "Производительность" регламентным заданием
	
	РегистрыСведений.Производительность.Очистить();
КонецФункции

Функция ЗарегистрироватьСобытие(ИмяСобытия="", 
								Уровень = Неопределено, 
								ОбъектМетаданных = Неопределено, 
								Данные="", 
								Комментарий="", 
								РежимТранзакции = Неопределено,
								Где="Сервер",
								ИмяКомпьютера="",
								ИмяПользователя = "")Экспорт
	
	//Приведи значения по умолчанию к типам функции ЗаписьЖурналаРегистрации()
	//------------------------------------------------------------------------
	Если ИмяСобытия	= 	"" Тогда
		ИмяСобытия	=	"Ошибка"
	КонецЕсли;
	
	Если Уровень	= Неопределено Тогда
		Уровень 	= УровеньЖурналаРегистрации.Примечание;
	КонецЕсли;
	
	Если ОбъектМетаданных 	= Неопределено Тогда // абсолютно любое значение
		ОбъектМетаданных 	= Метаданные.Константы
	КонецЕсли;
	
	Если РежимТранзакции 	= Неопределено Тогда
		РежимТранзакции 	= РежимТранзакцииЗаписиЖурналаРегистрации.Независимая; 	
	КонецЕсли;
	
	//Запиш в жунал регистрации
	//-------------------------
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
КонецФункции
