
&НаСервере
Функция ЗагрузитьНаСервере(Адрес)
	Об = РеквизитФормыВЗначение("Объект");
	Рез = Об.ЗаполнитьСодержимое(Адрес);	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 					= "Выберите файл";
	Диалог.ПредварительныйПросмотр 		= Истина;
	Диалог.ПроверятьСуществованиеФайла 	= Истина;
	Диалог.Фильтр = "Все картинки (*.bmp;*.dib;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico)|*.bmp;*.dib;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico|Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|Формат TIFF (*.tif)|*.tif|Формат GIF (*.gif)|*.gif|Формат PNG (*.png)|*.png|Формат icon (*.ico)|*.ico|";
	
	Если Диалог.Выбрать() Тогда
				
		//Создай картинку из файла
		//---------------------------------------------------------
   		ВыбранныйФайлКартинки = Новый Картинка(Диалог.ПолноеИмяФайла,Ложь);
		
		// Преобразуй в двоичные данные
		//-----------------------------------------------
		Двоичные = ВыбранныйФайлКартинки.ПолучитьДвоичныеДанные();
		
		//Помести содержимое во временное хранилище
		//---------------------------------------------
		Адрес = ПоместитьВоВременноеХранилище(Двоичные);
		
		//Помести содержимое файла из временного хранилища в реквизит записи
		//------------------------------------------------------------------
		ФайлЗагружен = ЗагрузитьНаСервере(Адрес);
		
		ЭтаФорма.Закрыть();
		ЭтаФорма.ОбновитьОтображениеДанных();
		//Если ФайлЗагружен Тогда
			//Если ЭтаФорма.Объект.Ссылка <> ПредопределенноеЗначение("Справочник.Файлы.ПустаяСсылка") Тогда
				ЭтаФорма.Картинка = ПолучитьНавигационнуюСсылку(ЭтаФорма.Объект.Ссылка, "Содержимое");
			//КонецЕсли;
		//КонецЕсли;
	Иначе
    	Отказ = Истина;
    	Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Объект.Ссылка <> Справочники.Файлы.ПустаяСсылка() Тогда
		ЭтаФорма.Картинка = ПолучитьНавигационнуюСсылку(ЭтаФорма.Объект.Ссылка, "Содержимое");
	КонецЕсли;
КонецПроцедуры
