Функция Добавить(Звонок, ДатаРегистрации, ДатаОбработки = '00010101') Экспорт
	
	Зап = РегистрыСведений.ЗвонкиСбросы.СоздатьМенеджерЗаписи();
	Зап.Сигнатура		= Звонок;
	Зап.ДатаОбработки	= ДатаОбработки;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Возврат "Ошибка: запись уже существует";	
	КонецЕсли;
	
	Зап.Сигнатура		= Звонок;
	Зап.ДатаРегистрации = ДатаРегистрации;
	Попытка
		Зап.Записать();	
	Исключение
		Данные 		= "Звонок = "+Звонок+"; ДатаРегистрации = "+ДатаРегистрации+"; ДатаОбработки = "+ДатаОбработки;
		Комментарий = ОписаниеОшибки(); 
		ЗаписьЖурналаРегистрации("ЗвонкиСбросы.Добавить", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗвонкиСбросы, Данные, Комментарий);
	КонецПопытки;
	
	Возврат "";

КонецФункции