&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если текущий пользователь не является Администратором, то отобразим в Списке только те звонки,
// которые поступили на подразделения и абонентов доступных текущему пользователю
//-------------------------------------------------------------------------------------------------
	Если (НЕ ПараметрыСеанса.РольДоступнаАдминистратор) Тогда
		ТекстЗапроса = СокрЛП(Список.ТекстЗапроса) + " ";
		ТекстЗапроса = ТекстЗапроса + " И ((Стат.Исполнитель В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.Исполнитель = ЗНАЧЕНИЕ(Справочник.Предприятие.ПустаяСсылка)) ИЛИ (Стат.ОПСсылка В ИЕРАРХИИ(&Подразделения)) ИЛИ Стат.ОПСсылка = ЗНАЧЕНИЕ(Справочник.Предприятие.ПустаяСсылка))";
		Список.ТекстЗапроса = СокрЛП(ТекстЗапроса);
		
		ДоступныеПодразделения = ЗначенияСервера.ДоступныеПодразделения();

		Список.Параметры.УстановитьЗначениеПараметра("Подразделения",ДоступныеПодразделения);
	КонецЕсли;
	
	//Установи отборы
	//----------------
	Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	
	НачалоПериода = '00010101';
	Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		НачалоПериода = Параметры.НачалоПериода
	Иначе
		НачалоПериода = ДобавитьМесяц(ТекущаяДата(), -1);
	КонецЕсли;
	Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлОтбора.ПравоеЗначение	=	НачалоПериода;
	ЭлОтбора.Использование	=	Истина;
	
	Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		КонецПериода = Параметры.КонецПериода; 
		ЭлОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлОтбора.ПравоеЗначение	=	КонецПериода;
		ЭлОтбора.Использование	=	Истина;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.КЦСсылка) Тогда
		ЭлОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("КЦСсылка");
		ЭлОтбора.ПравоеЗначение	=	Параметры.КЦСсылка;
		ЭлОтбора.Использование	=	Истина;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Параметры.ОПСсылка) Тогда
		ЭлОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("ОПСсылка");
		ЭлОтбора.ПравоеЗначение	=	Параметры.ОПСсылка;
		ЭлОтбора.Использование	=	Истина;
	КонецЕсли;


КонецПроцедуры
