
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Показать пользователю только процессы доступных подразделений
	//--------------------------------------------------------------
	Если Не ПараметрыСеанса.РольДоступнаАдминистратор Тогда		
		ЭтаФорма.Список.ТекстЗапроса = СтрЗаменить(ЭтаФорма.Список.ТекстЗапроса, "1 = 1", "Процесс.ПодразделениеИсполнитель В ИЕРАРХИИ (&ДоступныеПодразделения)");
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПодразделения",ЗначенияСервера.ДоступныеПодразделения());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартуМаршрута(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПокажиКартуМаршрутаБизнесПроцесса(Команда)
	
	Если ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка  = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Ссылка = ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка;

	Парам = Новый Структура();
	Парам.Вставить("БизнесПроцесс", Ссылка);
	ОткрытьФорму("ОбщаяФорма.КартаМаршрутаБизнесПроцесса", Парам);
КонецПроцедуры
