&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

	//Установка отборов
	//-----------------
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	
	НачалоПериода = "";
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.НачалоПериода) Тогда
		НачалоПериода = ЭтаФорма.Параметры.НачалоПериода
	Иначе
		НачалоПериода = ДобавитьМесяц(ТекущаяДата(),-1);
	КонецЕсли;
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлОтбора.ПравоеЗначение	=	НачалоПериода;
	ЭлОтбора.Использование	=	Истина;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.КонецПериода) Тогда
		КонецПериода = ЭтаФорма.Параметры.КонецПериода; 
		ЭлОтбора =ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлОтбора.ПравоеЗначение	=	КонецПериода;
		ЭлОтбора.Использование	=	Истина;
	КонецЕсли;	

КонецПроцедуры
