Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	СКД = ПолучитьМакет("ОсновнаяСКД");	
	
	СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);
КонецПроцедуры

Процедура СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.ПисьмоИнициатор КАК ПисьмоИнициатор,
	|	Т.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	Т.Комментарий КАК Комментарий,
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.ЗадачиОбратныйЗвонок КАК Т
	|ГДЕ
	|	Т.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ПрочаяПочта)
	|	И Т.ДатаЗакрытия МЕЖДУ &Начало И &Окончание
	|	И Т.ПричинаЗакрытия <> """"";   
	
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
   	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры

