
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика
	
	//Каналы = Новый Массив();
	//Для Каждого i Из Строки Цикл
	//	Каналы.Добавить(i.Ключ.Код);
	//КонецЦикла;  
	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ 	full_number, def_endpoint_num 
	|ИЗ			ВнешнийИсточникДанных.AsteriskEdge.Таблица.incoming_routes";
//	|ГДЕ		line_number В(&line_number)"; 
	//Запрос.УстановитьПараметр("line_number", Каналы); 
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	тзк = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	t.full_number КАК full_number,
	|	t.def_endpoint_num КАК ОчередьExtention
	|ПОМЕСТИТЬ ВТ01
	|ИЗ
	|	&t КАК t
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРАВ(ВТ01.full_number, 10) КАК full_number,
	|	ВТ01.ОчередьExtention КАК ОчередьExtention,
	|	ЕСТЬNULL(Оч.Ссылка, ЗНАЧЕНИЕ(Справочник.ТелОчереди.ПустаяСсылка)) КАК Очередь,
	|	ЕСТЬNULL(КЦ.Ссылка, ЗНАЧЕНИЕ(Справочник.КонтактЦентры.ПустаяСсылка)) КАК КонтактЦентр
	|ИЗ
	|	ВТ01 КАК ВТ01
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТелОчереди КАК Оч
	|		ПО ВТ01.ОчередьExtention = Оч.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактЦентры КАК КЦ
	|		ПО (КЦ.Очередь = Оч.Ссылка)";

	Запрос.УстановитьПараметр("t", тзк);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;   
	
	тз = РезультатЗапроса.Выгрузить();
	
	Парам = Новый Структура();
	Для Каждого i Из Строки Цикл 
		Парам.Вставить("full_number", Прав(i.Ключ.Код, 10));
		рез = тз.НайтиСтроки(Парам);
		Если рез.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		i.Значение.Данные.Очередь 		= рез[0].Очередь;
		i.Значение.Данные.КонтактЦентр 	= рез[0].КонтактЦентр; 
	КонецЦикла
КонецПроцедуры
