
Функция ШаблонURL1Метод1(Запрос)
	Парам1 = "";
	Парам2 = "";
	
	Парам1 = Запрос.ПараметрыURL["PhoneNum"];
	Парам2 = Запрос.ПараметрыURL["Site"];
	
	НеобязатПарам = "";
	НеобязатПарам = Запрос.ПараметрыЗапроса.Получить("extra");
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8"); 
	СтрокаОтвета = "Вызов веб-сервера, метод GET.Парам1="+Парам1+" ;Парам2="+Парам2+" ;НеобязатПарам="+НеобязатПарам;
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	ЗаписьЖурналаРегистрации("ШаблонURL1Метод1", УровеньЖурналаРегистрации.Информация, Метаданные.HTTPСервисы.HTTPСервис1,,"Вызов http-сервиса, метод GET");
	Возврат Ответ;
КонецФункции

Функция GetCall(Запрос)
	
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	Ответ.УстановитьТелоИзСтроки("[]");  //значение по умолчанию
	
	//В полученой сигнатуре заменяли символ "#" на "q", восстановим
	//--------------------------------------------------------------
	Сигнатура = Запрос.ПараметрыURL["id"];
	Сигнатура = СтрЗаменить(Сигнатура, "q", "#");
	
	Запр = Новый Запрос();
	Запр.Текст = 
	"ВЫБРАТЬ
	|	ЗвонкиМаршруты.НомерСобытия КАК Номер,
	|	ЗвонкиМаршруты.Дата КАК Дата,
	|	ЗвонкиМаршруты.Оператор.Код КАК Оператор,
	|	ЗвонкиМаршруты.КодСобытия КАК КодСобытия
	|ИЗ
	|	РегистрСведений.ЗвонкиМаршруты КАК ЗвонкиМаршруты
	|ГДЕ
	|	ЗвонкиМаршруты.Сигнатура = &Сигнатура";
	Запр.УстановитьПараметр("Сигнатура", Сигнатура);
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Табл = РезультатЗапроса.Выгрузить();
	
	Зап = Новый ЗаписьJSON();
	Зап.УстановитьСтроку();
	
	Зап.ЗаписатьНачалоМассива();
	
	//Запиши первую запись - заголовки таблицы
	//----------------------------------------
	Зап.ЗаписатьНачалоОбъекта();	
	Сч = 0;
	Для Каждого Колонка Из Табл.Колонки Цикл
		Зап.ЗаписатьИмяСвойства("col_"+Строка(Сч));
		Зап.ЗаписатьЗначение(Колонка.Имя);
		Сч = Сч + 1;
	КонецЦикла;
	Зап.ЗаписатьКонецОбъекта();
	
	//Запиши данные
	//-------------
	Для Каждого Стр Из Табл Цикл
		Зап.ЗаписатьНачалоОбъекта();
		Сч = 0;
		Для Каждого Колонка Из Табл.Колонки Цикл
			Зап.ЗаписатьИмяСвойства("col_"+Строка(Сч));
			Попытка
				Зап.ЗаписатьЗначение(Строка(Стр.Получить(Сч)));
			Исключение
				Зап.ЗаписатьЗначение("");
			КонецПопытки;
			Сч = Сч + 1;
		КонецЦикла;
		Зап.ЗаписатьКонецОбъекта();
	КонецЦикла;
	Зап.ЗаписатьКонецМассива();
	Рез = Зап.Закрыть();
	
	//Сформированный json содержится в Рез
	//------------------------------------
	Ответ.УстановитьТелоИзСтроки(Рез);
	
	Возврат Ответ;
КонецФункции

Функция SalesDocs(Запрос)
	// Возвращает таблицу документов продажи, отвечающих условиям отбора
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	
	Запр = Новый Запрос();
	Запр.Текст = 	
	//Вариант 1. Базовый. Пустая сигнатура звонка
	//------------------
	
	//"ВЫБРАТЬ
	//|	ПОДСТРОКА(Продажи.Сигнатура, 4, 36) КАК sale,
	//|	Анкеты.Сигнатура КАК call,
	//|	ПРЕДСТАВЛЕНИЕ(Анкеты.Ответ) КАК answer
	//|ИЗ
	//|	РегистрСведений.АнкетыРасширенные.СрезПоследних КАК Анкеты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	//|		ПО Анкеты.СигнатураЗадачи = Продажи.Сигнатура
	//|ГДЕ
	//|	Продажи.Дата МЕЖДУ &Начало И &Окончание
	//|	И Продажи.Документ = ""Реализация""
	//|	И Анкеты.Вопрос = &ПаркАвтомобилей
	//|	И (Продажи.Точка ПОДОБНО ""Москва%""
	//|				И Анкеты.Ответ В (&от_10_до_20, &от_30_до_40, &от_40_до_50, &более_50)
	//|			ИЛИ НЕ Продажи.Точка ПОДОБНО ""Москва%""
	//|				И Анкеты.Ответ В (&от_5_до_10, &от_10_до_20, &от_30_до_40, &от_40_до_50, &более_50))";
	
	
	//Вариант 2. Попытка опеределить сигнатуру звонка
	//------------------------------------------------
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Анкеты.Ответ) КАК answer,
	|	Продажи.Сигнатура КАК Продажа,
	|	Задачи.ЗвонокЗакрытия КАК Оператор,
	|	Задачи.Телефон КАК АбонентВнешний
	|ПОМЕСТИТЬ ВТ01
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних КАК Анкеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО Анкеты.СигнатураЗадачи = Продажи.Сигнатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК Задачи
	|		ПО (Задачи.СигнатураПродажи = Продажи.Сигнатура)
	|ГДЕ
	|	Продажи.Дата МЕЖДУ &Начало И &Окончание
	|	И Продажи.Документ = ""Реализация""
	|	И Анкеты.Вопрос = &ПаркАвтомобилей
	|	И (Продажи.Точка ПОДОБНО ""Москва%""
	|				И Анкеты.Ответ В (&от_10_до_20, &от_20_до_30, &от_30_до_40, &от_40_до_50, &более_50)
	|			ИЛИ НЕ Продажи.Точка ПОДОБНО ""Москва%""
	|				И Анкеты.Ответ В (&от_5_до_10, &от_10_до_20, &от_20_до_30, &от_30_до_40, &от_40_до_50, &более_50))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Звонки.Сигнатура КАК Звонок,
	|	Звонки.Дата КАК Дата,
	|	Звонки.АбонентВнешний КАК АбонентВнешний,
	|	ВТ01.Продажа КАК Продажа,
	|	Стат.Основание КАК Основание
	|ПОМЕСТИТЬ ВТ02_ВсеЗвонки
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
	|		ПО (Стат.Сигнатура = Звонки.Сигнатура)
	|			И (Стат.Основание <> """")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01 КАК ВТ01
	|		ПО Звонки.АбонентВнешний = ВТ01.АбонентВнешний
	|			И Звонки.АбонентВнутренний.Код = ВТ01.Оператор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Продажа КАК Продажа,
	|	МАКСИМУМ(ВТ02.Дата) КАК МаксДата
	|ПОМЕСТИТЬ ВТ03_КлючиСрезаПоследних
	|ИЗ
	|	ВТ02_ВсеЗвонки КАК ВТ02
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ02.Продажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Звонок КАК Звонок,
	|	ВТ02.АбонентВнешний КАК АбонентВнешний,
	|	ВТ02.Продажа КАК Продажа
	|ПОМЕСТИТЬ ВТ04_ЗвонкиСрезПоследних
	|ИЗ
	|	ВТ02_ВсеЗвонки КАК ВТ02
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_КлючиСрезаПоследних КАК ВТ03
	|		ПО ВТ02.Дата = ВТ03.МаксДата
	|			И ВТ02.Продажа = ВТ03.Продажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПОДСТРОКА(ВТ01.Продажа, 4, 36) КАК sale,
	|	ЕСТЬNULL(ВТ04.Звонок, """") КАК call,
	|	ЕСТЬNULL(ВТ04.АбонентВнешний, """") КАК phone,
	|	ВТ01.answer КАК answer
	|ИЗ
	|	ВТ01 КАК ВТ01
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_ЗвонкиСрезПоследних КАК ВТ04
	|		ПО ВТ01.Продажа = ВТ04.Продажа";
	
	Начало 		= НачалоДня(Дата(Запрос.URLParameters["start"]));
	Окончание 	= КонецДня(Дата(Запрос.URLParameters["end"]));
	
	Запр.УстановитьПараметр("Начало", 				Начало);
	Запр.УстановитьПараметр("Окончание", 			Окончание);
	Запр.УстановитьПараметр("ПаркАвтомобилей", 		Анкета.ПаркАвтомобилей());
	
	Запр.УстановитьПараметр("от_5_до_10",	  		Анкета.от_5_до_10()		);
	Запр.УстановитьПараметр("от_10_до_20",	  		Анкета.от_10_до_20()	);
	Запр.УстановитьПараметр("от_20_до_30",	  		Анкета.от_10_до_20()	);
	Запр.УстановитьПараметр("от_30_до_40",	  		Анкета.от_30_до_40()	);
	Запр.УстановитьПараметр("от_40_до_50",	  		Анкета.от_40_до_50()	);
	Запр.УстановитьПараметр("более_50",	  			Анкета.более_50()		);

	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Табл = РезультатЗапроса.Выгрузить();
	Рез = ОбщегоНазначения.ТаблицаЗначений_2_json(Табл);

	Ответ.УстановитьТелоИзСтроки(Рез);
	
	Возврат Ответ;

КонецФункции

Функция ПланПоЦелевомуТрафикуGet(Запрос)
	
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8");
	//
	//Ткст = "<?xml ?><Array></Array>";
	//Обр = Обработки.ТаблицаXML_ПланПоЦелевомуТрафикуСОктября2020.Создать();
	//Обр.УстановитьНастройки();
	//ткст = Обр.ПолучиТекстИзРегистра();
	//
	//ЧтXML = Новый ЧтениеXML();
	//ЧтXML.УстановитьСтроку(Ткст);
	//Ф = ПрочитатьXML(ЧтXML);
	//
	//ткст1 = "";
	//ЗапJson = Новый ЗаписьJSON();
	//ЗапJson.УстановитьСтроку(ткст1);
	//
	//ткст1 = ЗаписатьJSON(ЗапJson, Ф);
	//ЗапJson.Закрыть();

	//
	//Табл = РезультатЗапроса.Выгрузить();
	//Рез = ОбщегоНазначения.ТаблицаЗначений_2_json(Табл);
	//Ответ.УстановитьТелоИзСтроки(Рез);
	//Возврат Ответ;
КонецФункции
