&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьФормуНаСервере()
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуНаСервере()	
	Отчет.ВыбранныйВариантОтчета="СтруктураЗвонковЕКЦ";
	Элементы.ВыбранныйВариантОтчета.СписокВыбора.Очистить();
	Элементы.ВыбранныйВариантОтчета.СписокВыбора.Добавить("СтруктураЗвонковЕКЦ", 				"Структура звонков ЕКЦ");
	Элементы.ВыбранныйВариантОтчета.СписокВыбора.Добавить("СтруктураНепринятыхЗвонковЕКЦ", 		"Структура непринятых звонков ЕКЦ");
	Элементы.ВыбранныйВариантОтчета.СписокВыбора.Добавить("СтруктураПереведенныхЗвонковЕКЦ", 	"Структура переведенных звонков");
	Элементы.ВыбранныйВариантОтчета.СписокВыбора.Добавить("ЗвонкиОставшиесяНаОператорахЕКЦ", 	"Звонки, оставщиеся на операторах");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	//Убери вопрос "Вариант отчета был изменен, сохранить?"
	//----------------------------------------------------
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;

КонецФункции

#Область Выбор_периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;    
	
	ПриЗакрытииДиалогаВыбораПериода = Новый ОписаниеОповещения("ПриЗакрытииДиалогаВыбораПериода", ЭтаФорма);
	Диалог.Показать(ПриЗакрытииДиалогаВыбораПериода);
КонецПроцедуры

Процедура ПриЗакрытииДиалогаВыбораПериода(Парам1, Парам2) Экспорт
	// Парам1 - период
	// Парам2 - доп. парам
	
	Если ТипЗнч(Парам1) <> Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВыборПериода.Заголовок = " "+Формат(Парам1.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Парам1.ДатаОкончания, "ДЛФ=Д");
	Отчет.Период = Парам1;
КонецПроцедуры
#КонецОбласти


