Функция ПисьмоНайти(MessageID, ИмяПользователяПочтовогоЯщика, Отправитель, ДатаОтправления) Экспорт
	
	АдресСервера 	= "";
	Порт 			= "";
	ИспользоватьSSL = Ложь;
	Пользователь	= "";
	Пароль 			= "" ;
	ЭлПочта.ПочтовыйПрофильПоИмениПользователя(АдресСервера, Порт, ИспользоватьSSL, Пользователь, Пароль, ИмяПользователяПочтовогоЯщика);
	
	Доступно = 		ЗначениеЗаполнено(АдресСервера)
				И   ЗначениеЗаполнено(Порт)
				И	ЗначениеЗаполнено(ИспользоватьSSL)
				И	ЗначениеЗаполнено(Пароль);
				
	Если Не Доступно Тогда
		Сообщить("ошибка: не найден почтовый профиль");				
	КонецЕсли;			

	Профиль = Новый ИнтернетПочтовыйПрофиль;			
	Профиль.АдресСервераIMAP		=	АдресСервера;
	Профиль.ПортIMAP				=	Число(Порт);
	Профиль.ИспользоватьSSLIMAP		=	ИспользоватьSSL;
	Профиль.ПользовательIMAP		=	Пользователь;
	Профиль.ПарольIMAP				=	Пароль;
	
	ПротоколПолученияПочты			=   ПротоколИнтернетПочты.IMAP;		

	Почта = Новый ИнтернетПочта;
	Попытка 
		Почта.Подключиться(Профиль, ПротоколПолученияПочты);	
	Исключение
		Сообщить(СтрШаблон("ошибка: %1", ОписаниеОшибки()));
	КонецПопытки;
	

	ИдСообщений = Новый Массив();
	Парам = Новый Структура("ДатаОтправления, Отправитель", ДатаОтправления, Отправитель);
	Попытка
		ИдСообщений1 = Почта.ПолучитьИдентификаторы(ИдСообщений, Парам);    
		
		Если ИдСообщений1.Количество()=0 Тогда
			//Если оказались здесь, значит письма по критериям ДатаОтправления и Отправитель не найдены,
			//это может быть по причине того, что ДатаОтправления на клиенте отправителя выставлена не верно,
			//поэтому поищи только по критерию Отправитель
			//------------------------------------------------------------------------------------------------
			Парам = Новый Структура("Отправитель", Отправитель);
			ИдСообщений1 = Почта.ПолучитьИдентификаторы(ИдСообщений, Парам);    
		КонецЕсли; 
		
		Если ИдСообщений1.Количество()=0 Тогда
			//Если оказались здесь, значит письма по критерию Отправитель не найдены,поищи только по ДатаОтправления 
			//------------------------------------------------------------------------------------------------------
			Парам = Новый Структура("ДатаОтправления", ДатаОтправления);
			ИдСообщений1 = Почта.ПолучитьИдентификаторы(ИдСообщений, Парам);    
		КонецЕсли; 
	Исключение
		ИдСообщений = Новый Массив();
	    ИдСообщений1 = Почта.ПолучитьИдентификаторы(ИдСообщений);
	КонецПопытки;
	Письма = Почта.Выбрать(Ложь,ИдСообщений1,Ложь);
	
	НайденоПисьмо = Ложь;
	Для Каждого Письмо Из Письма Цикл
		Если Письмо.ИдентификаторСообщения <> MessageID Тогда
			Продолжить
		КонецЕсли;
		Возврат Письмо
	КонецЦикла;  
	
	//Если оказались здесь, значит письма по критерию Дата отправления не найдены,поищи среди полученных за неделю
	//-----------------------------------------------------------------------------------------------------------
	Парам = Новый Структура("ПослеДатыОтправления, ДоДатыОтправления", (ДатаОтправления - 24*60*60*7), (ДатаОтправления + 24*60*60*7));
	ИдСообщений1 = Почта.ПолучитьИдентификаторы(ИдСообщений, Парам);   
	Письма = Почта.Выбрать(Ложь,ИдСообщений1,Ложь);
    НайденоПисьмо = Ложь;
	Для Каждого Письмо Из Письма Цикл
		Если Письмо.ИдентификаторСообщения <> MessageID Тогда
			Продолжить
		КонецЕсли;
		Возврат Письмо
	КонецЦикла;    
		
	//Если оказались здесь, значит - глобальный поиск, без фильтров
	//-------------------------------------------------------------
	Если Не НайденоПисьмо Тогда 
		Письма = Почта.Выбрать(Ложь, ,Ложь);	  
		Для Каждого Письмо Из Письма Цикл
			Если Письмо.ИдентификаторСообщения <> MessageID Тогда
				Продолжить
			КонецЕсли;
			Возврат Письмо
		КонецЦикла;   
	КонецЕсли; 

	Возврат Новый ИнтернетПочтовоеСообщение();
КонецФункции
