&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Сформируем заголовок и доступность формы
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.Заголовок = "Задача по обратному звонку от ";
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + СокрЛП(Формат(Запись.ДатаПостановки,"ДЛФ=DD"));
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ", " + Конвертация.ДеньНеделиПрописью(Запись.ДатаПостановки);
	ЭтаФорма.ТолькоПросмотр = Истина;

// Скроем группы отвечающие за состояние исполнения задачи
//-------------------------------------------------------------------------------------------------
	Элементы.ГруппаЗакрытаПользователь.Видимость = Ложь;
	Элементы.ГруппаЗакрытаЗвонок.Видимость = Ложь;
	Элементы.ГруппаОткрыта.Видимость = Ложь;

// Если задача открыта (неисполнена)
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(Запись.ДатаЗакрытия)) Тогда
		Темп = "Ответственный за исполнение " + СокрЛП(Запись.Исполнитель);
		Элементы.НадписьОткрыта.Заголовок = СокрЛП(Темп);
		Элементы.ГруппаОткрыта.Видимость = Истина;

// Если задача закрыта (исполнена)
//-------------------------------------------------------------------------------------------------
	Иначе
		Если (ТипЗнч(Запись.Исполнитель) = Тип("СправочникСсылка.Пользователи")) Тогда
			Темп = "Закрыта вручную пользователем: " + СокрЛП(Запись.Исполнитель);
			Темп = Темп + ", " + СокрЛП(Формат(Запись.ДатаЗакрытия,"ДЛФ=DDT"));
			Элементы.НадписьЗакрытаПользователь.Заголовок = СокрЛП(Темп);
			Элементы.ГруппаЗакрытаПользователь.Видимость = Истина;
		ИначеЕсли (ТипЗнч(Запись.Исполнитель) = Тип("СправочникСсылка.ТелВнутренние")) Тогда
			Темп = "Закрыта автоматически звонком: " + СокрЛП(Запись.Исполнитель);
			Темп = Темп + ", " + СокрЛП(Формат(Запись.ДатаЗакрытия,"ДЛФ=DDT"));
			Элементы.НадписьЗакрытаЗвонок.Заголовок = СокрЛП(Темп);
			Элементы.ГруппаЗакрытаЗвонок.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьЗакрытаЗвонокНажатие(Элемент)

// Откроем форму звонка, которым исполнена задача
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Запись.ЗвонокЗакрытия)) Тогда
		Попытка
			СтрКлюча = Новый Структура("Сигнатура",СокрЛП(Запись.ЗвонокЗакрытия));
			КлючЗаписи = ЗначенияСервера.ПолучитьКлючЗаписи("Звонки",СтрКлюча);
			ОткрытьЗначение(КлючЗаписи);
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
