
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПараметрыСеанса.РольДоступнаАдминистратор Тогда
		ДоступныеЦелевыеОчереди = ДоступСервер.ДоступныеЦелевыеИОбщиеОчереди(ПараметрыСеанса.ТекущийПользователь);
		
		ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлОтбора.ЛевоеЗначение 	=	Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлОтбора.ПравоеЗначение =	ДоступныеЦелевыеОчереди;
		ЭлОтбора.Использование 	= 	Истина;
	КонецЕсли;


КонецПроцедуры
