Процедура ПриКомпоновкеРезультата(ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка)
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 
	ДокументРезультат.Очистить();
	СтандартнаяОбработка = Ложь;

// Сформируем и выведем шапку отчета
//-------------------------------------------------------------------------------------------------
	Макет = ПолучитьМакет("ШапкаОтчета");
	Обл = Макет.ПолучитьОбласть("Шапка");

// Начало периода
//-------------------------------------------------------------------------------------------------
	ПараметрТип = Новый ПараметрКомпоновкиДанных("НачПериода");
	ПараметрСсылка = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТип);
	Обл.Параметры.НачПериода = СокрЛП(Формат(ПараметрСсылка.Значение,"ДЛФ=DD"));

// Окончание периода
//-------------------------------------------------------------------------------------------------
	ПараметрТип = Новый ПараметрКомпоновкиДанных("КонПериода");
	ПараметрСсылка = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТип);
	Обл.Параметры.КонПериода = СокрЛП(Формат(ПараметрСсылка.Значение,"ДЛФ=DD"));
	ДокументРезультат.Вывести(Обл);

// Построим отчет
//-------------------------------------------------------------------------------------------------
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

// Построим отчет
//-------------------------------------------------------------------------------------------------











КонецПроцедуры
