
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздайСписокОчередей();
КонецПроцедуры

Функция СоздайСписокОчередей()
	Запрос = Новый Запрос("ВЫБРАТЬ Т.name КАК name ИЗ ВнешнийИсточникДанных.AsteriskNnov.Таблица.Очереди КАК Т УПОРЯДОЧИТЬ ПО name");
	РезультатЗапроса = Запрос.Выполнить();
	ЭтаФорма.Элементы.Очередь.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));
КонецФункции

&НаКлиенте
Процедура ДобавитьВОчередь(Команда)
	Доступно = СтрДлина(Абонент)=4;
	Доступно = Доступно И ЗначениеЗаполнено(Очередь);
	Если Не Доступно Тогда
		Возврат;
	КонецЕсли;
	Результат = ДобавитьВОчередьНаСервере(Абонент, Очередь);
	ЭтаФорма.Закрыть(Результат );
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьВОчередьНаСервере(Абонент, Очередь)
	
	Результат = "ошибка";
	
	Доступно = ТипЗнч(Абонент) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Очередь) = Тип("Строка");
	Доступно = Доступно И СтрДлина(Абонент)=4;
	Доступно = Доступно И ЗначениеЗаполнено(Очередь);
	
	Если Не Доступно Тогда
		Возврат "ошибка: неверные типы или значения параметров";
	КонецЕсли;
	
	Попытка	
		ОпределениеСервиса = Новый WSОпределения("http://astws.main.luidorauto.ru:8081/asterisk_ws/soap/description");
		ВебСервис = Новый WSПрокси(ОпределениеСервиса, "http://tempuri.org/", "asterisk_ws", "asterisk_ws"); 
		Результат = ВебСервис.add_agent(СокрЛП(Абонент),ВРег(СокрЛП(Очередь)));
		
		Если (ТипЗнч(Результат) = Тип("Строка")) И (ЗначениеЗаполнено(Результат)) Тогда
			Ответ = "ошибка: " + СокрЛП(Результат);
			Возврат (Ответ);
		КонецЕсли;
	Исключение
		Данные = "Абонент = "+Абонент+"; Очередь = "+Очередь;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ДобавитьАгентаВОчередь", УровеньЖурналаРегистрации.Ошибка, ,Данные, Комментарий);
		Результат = Комментарий;
	КонецПопытки;
	
	Возврат Результат 
КонецФункции
