Процедура ПриЗаписи(Отказ, Замещение)
	
	ТЗ = ЭтотОбъект.Выгрузить();

//Т.к. набор записывается дважды (удаление существующего, запись нового), исключи случай удаления существующего
//--------------------------------------------------------------------------------------------------------------
	Если ТЗ.Количество()= 0 Тогда
		Возврат
	КонецЕсли;
	
	Запись = ТЗ[0];
	
	ТекДата = ТекущаяДата();
	
//Найти открытый период и закрой его, если изменилась целевая точка
//-----------------------------------------------------------------
	Запрос = Новый Запрос("ВЫБРАТЬ Т.Период КАК Период, Т.Телефон КАК Телефон, Т.ТочкаЦелевая КАК ТочкаЦелевая  ИЗ РегистрСведений.АгентыЦелевыеИст.СрезПоследних(, Телефон = &Телефон) КАК Т");
	Запрос.УстановитьПараметр("Телефон",  Запись.Телефон);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Доступно = Выборка.ТочкаЦелевая <> Запись.ТочкаЦелевая;
	Если Доступно = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Зап = РегистрыСведений.АгентыЦелевыеИст.СоздатьМенеджерЗаписи();
	Зап.Период 	= Выборка.Период;
	Зап.Телефон = Выборка.Телефон;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Зап.Период 			= Выборка.Период;
		Зап.Телефон 		= Выборка.Телефон;
		Зап.ТочкаЦелевая 	= Выборка.ТочкаЦелевая;
		Зап.Окончание 		= ТекДата-1;
		Попытка
			Зап.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации("ПриЗаписи", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Телефон=%1, Период=%2, ТочкаЦелевая=%3, Окончание=%4", Зап.Телефон, Зап.Период, Зап.ТочкаЦелевая, Зап.Окончание), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
//Открой новый период, если изменилась точка целевая
//----------------------------------------------------	
	НЗ = РегистрыСведений.АгентыЦелевыеИст.СоздатьМенеджерЗаписи();
	НЗ.Телефон				= 	Запись.Телефон;
	НЗ.Период				= 	ТекДата;		
	НЗ.ТочкаЦелевая			=	Запись.ТочкаЦелевая;
	НЗ.Окончание	 		=	'00010101';
	
	Попытка 
		НЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("ПриЗаписи", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Телефон = %1, Период = %2, ТочкаЦелевая = %3", НЗ.Телефон, НЗ.Период, НЗ.ТочкаЦелевая), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры
