
&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере()
	ВыбОбщНаст = ХранилищеОбщихНастроек.Выбрать();
	Пока ВыбОбщНаст.Следующий() Цикл
		ф = ВыбОбщНаст.Настройки;
		КлючОбъекта  		= ВыбОбщНаст.КлючОбъекта;
		КлючНастроек		= ВыбОбщНаст.КлючНастроек;
		ЗначениеНастройки 	= Строка(ВыбОбщНаст.Настройки);
		Пользователь		= ВыбОбщНаст.Пользователь;
		Сообщить(СтрШаблон("КлючОбъект = %1; КлючНастроек = %2; Значение = %3; Пользователь = %4", КлючОбъекта, КлючНастроек, ЗначениеНастройки, Пользователь));
	КонецЦикла;
КонецПроцедуры
