
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформируйТаблицуОткрытыхДокументов();
КонецПроцедуры

&НаСервере
Процедура СформируйТаблицуОткрытыхДокументов()
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗвонкиОжидаемые.ТипДокумента = 0
	|			ТОГДА ""Сервис""
	|		ИНАЧЕ ""Продажа""
	|	КОНЕЦ КАК ТипДокумента,
	|	ЗвонкиОжидаемые.ТочкаОформления КАК ТочкаОформления,
	|	ЗвонкиОжидаемые.Автомобиль КАК Автомобиль,
	|	ЗвонкиОжидаемые.ОператорТелефон КАК ОператорТелефон,
	|	ЕСТЬNULL(ОбъектыПривязка.Владелец.Наименование, """") КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЗвонкиОжидаемые КАК ЗвонкиОжидаемые
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТелВнутренние КАК ТелВнутренние
	|		ПО (ТелВнутренние.Код = ЗвонкиОжидаемые.ОператорТелефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыПривязка КАК ОбъектыПривязка
	|		ПО (ТелВнутренние.Ссылка = ОбъектыПривязка.Объект)";
	РезультатЗапроса  = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Новая = ЭтаФорма.ТаблицаОткрытыхДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Выборка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОткрытыхДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя <> "ТаблицаОткрытыхДокументовОператорТелефон" Тогда
		Возврат;
	КонецЕсли;
	ТелНомер = ВРег(СокрЛП(Элементы.ТаблицаОткрытыхДокументов.ТекущиеДанные.ОператорТелефон));
	Результат = КонтактЦентр.КомандаAtxfer(Параметры.КаналСистемный, ТелНомер);
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьЗадачуСотрудникуНачало(Команда)
	Перем ОператорТелефон;
	ОператорТелефон = "";
	
	Доступно = Истина;
	Доступно = Доступно и ЗначениеЗаполнено(Параметры.Телефон);
	Доступно = Доступно И Элементы.ТаблицаОткрытыхДокументов.ТекущиеДанные <> Неопределено;
	Если Не Доступно Тогда
		Комментарий = "Ошибка при постановке задачи сотруднику";
		Сообщ = Новый СообщениеПользователю();
		Сообщ.Текст = Комментарий;
		Сообщ.Сообщить();
		Возврат;
	КонецЕсли;
	ОператорТелефон	= Элементы.ТаблицаОткрытыхДокументов.ТекущиеДанные.ОператорТелефон;
	Доступно = Доступно И СтрДлина(ОператорТелефон) = 4;
	Если Не Доступно Тогда
		Комментарий = "Ошибка при постановке задачи сотруднику";
		Сообщ = Новый СообщениеПользователю();
		Сообщ.Текст = Комментарий;
		Сообщ.Сообщить();
		Возврат
	КонецЕсли;

	Автомобиль = Элементы.ТаблицаОткрытыхДокументов.ТекущиеДанные.Автомобиль;
	
	Парам2 = Новый Структура();
	Парам2.Вставить("Сигнатура", 		Параметры.Сигнатура);
	Парам2.Вставить("АбонентВнешний", 	Параметры.Телефон);
	Парам2.Вставить("ОператорТелефон", 	Элементы.ТаблицаОткрытыхДокументов.ТекущиеДанные.ОператорТелефон);
	Оп = Новый ОписаниеОповещения("ПоставитьЗадачуСотрудникуОкончание", ЭтаФорма, Парам2);
	ПоказатьВводСтроки(Оп, Автомобиль, "Введите сообщение");
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьЗадачуСотрудникуОкончание(Парам1, Парам2) Экспорт
	Парам1 = ?(Парам1 = Неопределено, "", Парам1);
    ПоставитьЗадачуСотрудникуНаСервере(Парам2.Сигнатура, Парам2.ОператорТелефон, Парам2.АбонентВнешний, Парам1);
КонецПроцедуры

&НаСервере
Процедура ПоставитьЗадачуСотрудникуНаСервере(linkedid, agent_num, abonent_num, comment)
	Звонки.УведомитьОПропущенном(linkedid, ТекущаяДата(),agent_num, abonent_num, comment);
КонецПроцедуры

