
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьИерархию();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗаписатьИерархию()
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИерархию()
	Об = РеквизитФормыВЗначение("Отчет");
	Об.ЗаписатьИерархию(Параметры.ИмяИерархии);
	ЗначениеВРеквизитФормы(Об, "Отчет");
	
	ЗагрузитьИерархию ();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИерархию ()
	Парам = Новый Структура();
	Парам.Вставить(Параметры.ИмяИерархии);
	РегистрыСведений.УчетнаяПолитика.Получи(Парам);
	
	Если Не ЗначениеЗаполнено(Парам[Параметры.ИмяИерархии]) Тогда
		Возврат
	Иначе
		ПрочитатьИерархию(Парам[Параметры.ИмяИерархии]);
		ЭтаФорма.отчет.ИерархияСтрокой = Парам[Параметры.ИмяИерархии];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИерархию(Стр)
	ЭтаФорма.Отчет.Иерархия.Очистить();
	
	Чт = Новый ЧтениеXML();
	Чт.УстановитьСтроку(Стр);
	Постр = Новый ПостроительDOM();
	Док = Постр.Прочитать(Чт);
	
	Корень = Док.ДочерниеУзлы[0];
	Для Каждого Ряд Из Корень.ДочерниеУзлы Цикл
			Новая = ЭтаФорма.Отчет.Иерархия.Добавить();
			Новая.Группа 		= Ряд.ДочерниеУзлы[0].ДочерниеУзлы[0].ТекстовоеСодержимое;
			Новая.Сайт 			= Ряд.ДочерниеУзлы[1].ДочерниеУзлы[0].ТекстовоеСодержимое;
			Новая.Супергруппа 	= Ряд.ДочерниеУзлы[2].ДочерниеУзлы[0].ТекстовоеСодержимое;

	КонецЦикла;
	
КонецФункции
