Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 														 Период.ДатаНачала);
	ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 													 Период.ДатаОкончания);
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура();
	Парам.Вставить("Начало",						Период.ДатаНачала);
	Парам.Вставить("Окончание",						Период.ДатаОкончания);
	Парам.Вставить("_1йБазовыйВопросЛояльности", 	Анкета._1йБазовыйВопросЛояльности());
	Парам.Вставить("_2йБазовыйВопросЛояльности",	Анкета._2йБазовыйВопросЛояльности());
	Парам.Вставить("_3йБазовыйВопросЛояльности",	Анкета._3йБазовыйВопросЛояльности());
	Парам.Вставить("_4йБазовыйВопросЛояльности",	Анкета._4йБазовыйВопросЛояльности());
	Парам.Вставить("Да",							Анкета.Да());
	Парам.Вставить("_1",							Анкета._1());
	Парам.Вставить("_2",							Анкета._2());
	Парам.Вставить("_3",							Анкета._3());
	Парам.Вставить("_4",							Анкета._4());
	Парам.Вставить("_5",							Анкета._5());
	Парам.Вставить("СферыНегатива",					Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Сфера негатива"));
	Парам.Вставить("КатегорииНегатива",				Анкета.КатегорияНегатива());  
	
	ИсключаемыеСферы = Новый Массив();
	ИсключаемыеСферы.Добавить(Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("ПМЗ: Стоимость ремонта/зап.частей"));
	ИсключаемыеСферы.Добавить(Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("ПМЗ: Сроки записи"));  
	ИсключаемыеСферы.Добавить(Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("ПМЗ: Переход на предоплату")); 	
	Парам.Вставить("ИсключаемыеСферы",ИсключаемыеСферы);    
	
	Парам.Вставить("НеУчитыватьИсключаемыеСферыВРасчетеКоличестваНегативныхОтзывов", ЭтотОбъект.НеУчитыватьИсключаемыеСферыВРасчетеКоличестваНегативныхОтзывов);

	Если ТекВариант = "Сводный" Тогда
		ТекстЗапроса 			= Сводный();
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(ТекВариант, "C:\Users\Public\Documents\"+ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;  
	
	Если ТекВариант = "СводныйВладимир" Тогда
		ТекстЗапроса 			= СводныйВладимир();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;

	Если ТекВариант = "СводныйГАЗ" Тогда
		ТекстЗапроса 			= СводныйГАЗ();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;
	
	Если ТекВариант = "СводныйКАМАЗ" Тогда
		ТекстЗапроса 			= СводныйКАМАЗ();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных		= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;

	Если ТекВариант = "СводныйУАЗ" Тогда
		ТекстЗапроса 			= СводныйУАЗ();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;
	
	Если ТекВариант = "СводныйChery" Тогда
		ТекстЗапроса 			= СводныйChery();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;

	Если ТекВариант = "СводныйFord" Тогда
		ТекстЗапроса 			= СводныйFord();
		_ТекВариант 			= "Сводный";
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+_ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(_ТекВариант, "C:\Users\Public\Documents\"+_ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;
	
	Если ТекВариант = "Детальный" Тогда
		ТекстЗапроса 			= Детальный();
		РезультатЗапроса 		= ЗапросВыполнить(ТекстЗапроса, Парам, "C:\Users\Public\Documents\"+ТекВариант+".sql"); 
		СхемаКомпоновкиДанных 	= ПолучитьСКД(ТекВариант, "C:\Users\Public\Documents\"+ТекВариант+".xml");
		ВнешниеНаборыДанных 	= Новый Структура();
		ВнешниеНаборыДанных.Вставить("ТЗ", РезультатЗапроса);
	КонецЕсли;

	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);	
КонецПроцедуры

Функция СводныйГАЗ()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Продажи.ХарактеристикаОбъекта ПОДОБНО ""%ГАЗ%"" ");
	Возврат ТекстЗапроса
КонецФункции

Функция СводныйКАМАЗ()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Продажи.ХарактеристикаОбъекта ПОДОБНО ""%КАМАЗ%"" ");
	Возврат ТекстЗапроса
КонецФункции

Функция СводныйУАЗ()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Продажи.ХарактеристикаОбъекта ПОДОБНО ""%УАЗ%"" ");
	Возврат ТекстЗапроса
КонецФункции

Функция СводныйChery()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Продажи.ХарактеристикаОбъекта ПОДОБНО ""%CHERY%"" ");
	Возврат ТекстЗапроса
КонецФункции

Функция СводныйFord()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "Продажи.ХарактеристикаОбъекта ПОДОБНО ""%Ford%"" ");
	Возврат ТекстЗапроса
КонецФункции

Функция Сводный()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(МастерЗадачи.СигнатураПродажи, ЗадачаЛояльности.СигнатураПродажи) КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ0000_СигнатураЗамененаНаМастер
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачаЛояльности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ПО ЗадачаЛояльности.СигнатураПродажи = Пакеты.Продажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК МастерЗадачи
	|		ПО (Пакеты.Сигнатура = МастерЗадачи.СигнатураПродажи)
	|ГДЕ
	|	ЗадачаЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьРемонтаАвто)
	|	И ЗадачаЛояльности.ДатаЗакрытия МЕЖДУ &Начало И &Окончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ0000.СигнатураПродажи КАК СигнатураПродажи,
	|	Продажи.Точка КАК Точка
	|ПОМЕСТИТЬ ВТ00_СигнатураЗамененаНаМастер
	|ИЗ
	|	ВТ0000_СигнатураЗамененаНаМастер КАК ВТ0000
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ВТ0000.СигнатураПродажи = Продажи.Сигнатура
	|			И (1 = 1) 
	|			И Не Точка = ""Владимир""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.СигнатураЗадачQ КАК СигнатураЗадачи,
	|	Т.Вопрос КАК Вопрос,
	|	Т.Ответ КАК Ответ
	|ПОМЕСТИТЬ ВТ01_АнкетыРасш
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ00.СигнатураПродажи
	|					ИЗ
	|						ВТ00_СигнатураЗамененаНаМастер КАК ВТ00
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК Задачи
	|							ПО
	|								ВТ00.СигнатураПродажи = Задачи.СигнатураПродажи
	|									И Задачи.ПричинаЗакрытия = """")
	|				И Вопрос В (&_1йБазовыйВопросЛояльности, &_2йБазовыйВопросЛояльности, &_3йБазовыйВопросЛояльности, &_4йБазовыйВопросЛояльности)) КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СигнатураЗадачи,
	|	Вопрос,
	|	Ответ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.СигнатураЗадачQ КАК СигнатураЗадач,
	|	1 КАК СодержитТолькоНеисключаемыеСферы
	|ПОМЕСТИТЬ ВТ0202_АнкетыСодержащиеНеисключаемыеСферы
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ01_АнкетыРасш.СигнатураЗадачи
	|				ИЗ
	|					ВТ01_АнкетыРасш)) КАК Т
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &НеУчитыватьИсключаемыеСферыВРасчетеКоличестваНегативныхОтзывов
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Т.Вопрос = &СферыНегатива
	|					И НЕ Т.Ответ В (&ИсключаемыеСферы)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Вопрос КАК Вопрос,
	|	Т1.СигнатураЗадачи КАК СигнатураЗадачи,
	|	Т1.Ответ КАК Ответ
	|ПОМЕСТИТЬ ВТ0203_АнкетыРасш
	|ИЗ
	|	ВТ01_АнкетыРасш КАК Т1
	|ГДЕ
	|	Т1.СигнатураЗадачи В
	|			(ВЫБРАТЬ
	|				Т1.СигнатураЗадачи
	|			ИЗ
	|				ВТ0202_АнкетыСодержащиеНеисключаемыеСферы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ00.Точка КАК Точка,
	|	ВТ00.СигнатураПродажи КАК СигнатураПродажи,
	|	1 КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗакрытыхПричиной,
	|	ЗадачаЛояльности.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗакрытыхАнкетой,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И (_1йБазовыйВопросЛояльности.Ответ В (&_1, &_2, &_3)
	|					ИЛИ _2йБазовыйВопросЛояльности.Ответ В (&_1, &_2, &_3)
	|					ИЛИ _3йБазовыйВопросЛояльности.Ответ В (&_1, &_2, &_3)
	|					ИЛИ _4йБазовыйВопросЛояльности.Ответ В (&_1, &_2, &_3))
	|				И ВТ0202.СодержитТолькоНеисключаемыеСферы = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНегативныхАнкет,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И НЕ ЕСТЬNULL(_1йБазовыйВопросЛояльности.Ответ, ""NULL"") В (&_1, &_2, &_3)
	|				И НЕ ЕСТЬNULL(_2йБазовыйВопросЛояльности.Ответ, ""NULL"") В (&_1, &_2, &_3)
	|				И НЕ ЕСТЬNULL(_3йБазовыйВопросЛояльности.Ответ, ""NULL"") В (&_1, &_2, &_3)
	|				И НЕ ЕСТЬNULL(_4йБазовыйВопросЛояльности.Ответ, ""NULL"" ) В (&_1, &_2, &_3)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоложительныхАнкет
	|ПОМЕСТИТЬ ВТ03
	|ИЗ
	|	ВТ00_СигнатураЗамененаНаМастер КАК ВТ00
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачаЛояльности
	|		ПО ВТ00.СигнатураПродажи = ЗадачаЛояльности.СигнатураПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ0203_АнкетыРасш КАК _1йБазовыйВопросЛояльности
	|		ПО ВТ00.СигнатураПродажи = _1йБазовыйВопросЛояльности.СигнатураЗадачи
	|			И (_1йБазовыйВопросЛояльности.Вопрос В (&_1йБазовыйВопросЛояльности))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ0203_АнкетыРасш КАК _2йБазовыйВопросЛояльности
	|		ПО ВТ00.СигнатураПродажи = _2йБазовыйВопросЛояльности.СигнатураЗадачи
	|			И (_2йБазовыйВопросЛояльности.Вопрос В (&_2йБазовыйВопросЛояльности))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ0203_АнкетыРасш КАК _3йБазовыйВопросЛояльности
	|		ПО ВТ00.СигнатураПродажи = _3йБазовыйВопросЛояльности.СигнатураЗадачи
	|			И (_3йБазовыйВопросЛояльности.Вопрос В (&_3йБазовыйВопросЛояльности))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ0203_АнкетыРасш КАК _4йБазовыйВопросЛояльности
	|		ПО ВТ00.СигнатураПродажи = _4йБазовыйВопросЛояльности.СигнатураЗадачи
	|			И (_4йБазовыйВопросЛояльности.Вопрос В (&_4йБазовыйВопросЛояльности))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ0202_АнкетыСодержащиеНеисключаемыеСферы КАК ВТ0202
	|		ПО ВТ00.СигнатураПродажи = ВТ0202.СигнатураЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (Продажи.Сигнатура = ВТ00.СигнатураПродажи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Точка КАК Точка,
	|	СУММА(1) КАК КоличествоЗадачЗакрытыхАнкетой
	|ПОМЕСТИТЬ ВТ04_КоличествоЗадачЗакрытыхАнкетой
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхАнкетой = 1
	|	И ВТ03.КоличествоЗакрытыхПричиной = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ03.Точка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Точка КАК Точка,
	|	ВТ03.СигнатураПродажи КАК СигнатураПродажи,
	|	5 КАК ПорядокПараметра,
	|	""Количество закрытых задач"" КАК ИмяГруппы,
	|	""Количество закрытыз задач"" КАК ИмяПараметра,
	|	1 КАК ЗначениеПараметра,
	|	0 КАК ЗначениеДопПараметра
	|ИЗ
	|	ВТ03 КАК ВТ03
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	10,
	|	""Количество задач, закрытых причиной"",
	|	ВТ03.ПричинаЗакрытия,
	|	1,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхПричиной = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	15,
	|	""Количество заполненных анкет"",
	|	""Количество заполненных анкет"",
	|	ВТ03.КоличествоЗакрытыхАнкетой,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхАнкетой = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	20,
	|	""Количество положительных анкет"",
	|	""Количество положительных анкет"",
	|	ВТ03.КоличествоПоложительныхАнкет,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоПоложительныхАнкет = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	25,
	|	""Количество негативных анкет"",
	|	""Количество негативных анкет"",
	|	ВТ03.КоличествоНегативныхАнкет,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоНегативныхАнкет = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	40,
	|	""Доля негативных отзывов, %"",
	|	""Доля негативных отзывов, %"",
	|	ВТ03.КоличествоНегативныхАнкет,
	|	ЕСТЬNULL(ВТ04.КоличествоЗадачЗакрытыхАнкетой, 0)
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_КоличествоЗадачЗакрытыхАнкетой КАК ВТ04
	|		ПО ВТ03.Точка = ВТ04.Точка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	55,
	|	""Количество обработанных негативных анкет"",
	|	""Количество обработанных негативных анкет"",
	|	1,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбратнаяСвязьЛояльности КАК БП
	|		ПО ВТ03.СигнатураПродажи = БП.СигнатураПродажи
	|			И (БП.Завершен = ИСТИНА)
	|			И (ВТ03.ПричинаЗакрытия = """")";
	Возврат ТекстЗапроса
КонецФункции

Функция СводныйВладимир()
	ТекстЗапроса = Сводный();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Не Точка = ""Владимир""", "Точка = ""Владимир""");
	Возврат ТекстЗапроса
КонецФункции

Функция Детальный()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(МастерЗадачи.СигнатураПродажи, ЗадачаЛояльности.СигнатураПродажи) КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ0000_СигнатураЗамененаНаМастер
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачаЛояльности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ПО ЗадачаЛояльности.СигнатураПродажи = Пакеты.Продажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК МастерЗадачи
	|		ПО (Пакеты.Сигнатура = МастерЗадачи.СигнатураПродажи)
	|ГДЕ
	|	ЗадачаЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьРемонтаАвто)
	|	И ЗадачаЛояльности.ДатаЗакрытия МЕЖДУ &Начало И &Окончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ0000.СигнатураПродажи КАК СигнатураПродажи,
	|	Продажи.Точка КАК Точка
	|ПОМЕСТИТЬ ВТ00_СигнатураЗамененаНаМастер
	|ИЗ
	|	ВТ0000_СигнатураЗамененаНаМастер КАК ВТ0000
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ВТ0000.СигнатураПродажи = Продажи.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01_АнкетыРасш.Вопрос КАК Вопрос,
	|	ВТ01_АнкетыРасш.СигнатураЗадачQ КАК СигнатураЗадачи,
	|	ВТ01_АнкетыРасш.Ответ КАК Ответ
	|ПОМЕСТИТЬ ВТ01_АнкетыРасш
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			СигнатураЗадачQ В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТ00.СигнатураПродажи
	|					ИЗ
	|						ВТ00_СигнатураЗамененаНаМастер КАК ВТ00
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК Задачи
	|							ПО
	|								ВТ00.СигнатураПродажи = Задачи.СигнатураПродажи
	|									И Задачи.ПричинаЗакрытия = """")
	|				И Вопрос В (&ДовольныЛиВыПоследнимПосещениемСтанции, &ДостоинЛиНашСервисВашейРекомендацииДрузьямИЗнакомым)) КАК ВТ01_АнкетыРасш
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СигнатураЗадачи,
	|	Вопрос,
	|	Ответ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ00.Точка КАК Точка,
	|	ВТ00.СигнатураПродажи КАК СигнатураПродажи,
	|	1 КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗакрытыхПричиной,
	|	ЗадачаЛояльности.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗакрытыхАнкетой,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И (ДовольныЛиВыКачеством.Ответ В (&_4, &_5)
	|					И ДостоинЛиНашСервис.Ответ В (&_4, &_5))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоложительныхАнкет,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И (ДовольныЛиВыКачеством.Ответ В (&_1, &_2, &_3)
	|					ИЛИ ДостоинЛиНашСервис.Ответ В (&_1, &_2, &_3))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНегативныхАнкет,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И ДовольныЛиВыКачеством.Ответ В (&_1, &_2, &_3)
	|				И ДостоинЛиНашСервис.Ответ В (&_1, &_2, &_3)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНеДоволенНеРекомендует,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И ДовольныЛиВыКачеством.Ответ В (&_1, &_2, &_3)
	|				И ДостоинЛиНашСервис.Ответ В (&_4, &_5)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНедоволенРекомендует,
	|	ВЫБОР
	|		КОГДА ЗадачаЛояльности.ПричинаЗакрытия = """"
	|				И ДовольныЛиВыКачеством.Ответ В (&_4, &_5)
	|				И ДостоинЛиНашСервис.Ответ В (&_1, &_2, &_3)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоДоволенНерекомендует
	|ПОМЕСТИТЬ ВТ03
	|ИЗ
	|	ВТ00_СигнатураЗамененаНаМастер КАК ВТ00
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачаЛояльности
	|		ПО ВТ00.СигнатураПродажи = ЗадачаЛояльности.СигнатураПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ01_АнкетыРасш КАК ДовольныЛиВыКачеством
	|		ПО ВТ00.СигнатураПродажи = ДовольныЛиВыКачеством.СигнатураЗадачи
	|			И (ДовольныЛиВыКачеством.Вопрос В (&ДовольныЛиВыПоследнимПосещениемСтанции))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ01_АнкетыРасш КАК ДостоинЛиНашСервис
	|		ПО ВТ00.СигнатураПродажи = ДостоинЛиНашСервис.СигнатураЗадачи
	|			И (ДостоинЛиНашСервис.Вопрос В (&ДостоинЛиНашСервисВашейРекомендацииДрузьямИЗнакомым))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Точка КАК Точка,
	|	ВТ03.СигнатураПродажи КАК СигнатураПродажи
	|ПОМЕСТИТЬ ВТ031
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбратнаяСвязьЛояльности КАК ОбратнаяСвязьЛояльности
	|		ПО (ОбратнаяСвязьЛояльности.СигнатураПродажи = ВТ03.СигнатураПродажи)
	|			И (ОбратнаяСвязьЛояльности.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (ВТ03.КоличествоЗакрытыхПричиной = 0)
	|			И (ВТ03.КоличествоНеДоволенНеРекомендует = 1 ИЛИ ВТ03.КоличествоНедоволенРекомендует = 1 ИЛИ ВТ03.КоличествоДоволенНерекомендует = 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Точка КАК Точка,
	|	СУММА(1) КАК ЗначениеДопПараметраКоличествоЗадачЗакрытыхАнкетой
	|ПОМЕСТИТЬ ВТ04_КоличествоЗадачЗакрытыхАнкетой
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхАнкетой = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ03.Точка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ04.ЗначениеДопПараметраКоличествоЗадачЗакрытыхАнкетой) КАК КоличествоЗадачЗакрытыхАнкетой
	|ПОМЕСТИТЬ ВТ041_КоличествоЗадачЗакрытыхАнкетойДляОбщегоИтога
	|ИЗ
	|	ВТ04_КоличествоЗадачЗакрытыхАнкетой КАК ВТ04
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Точка КАК Точка,
	|	ВТ03.СигнатураПродажи КАК СигнатураПродажи,
	|	5 КАК ПорядокПараметра,
	|	""Количество закрытых задач"" КАК ИмяГруппы,
	|	""Количество закрытыз задач"" КАК ИмяПараметра,
	|	1 КАК ЗначениеПараметра,
	|	0 КАК ЗначениеДопПараметра
	|ПОМЕСТИТЬ ВТ05
	|ИЗ
	|	ВТ03 КАК ВТ03
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	10,
	|	""Количество задач, закрытых причиной"",
	|	ВТ03.ПричинаЗакрытия,
	|	1,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхПричиной = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	15,
	|	""Количество заполненных анкет"",
	|	""Количество заполненных анкет"",
	|	ВТ03.КоличествоЗакрытыхАнкетой,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоЗакрытыхАнкетой = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	20,
	|	""Количество положительных анкет"",
	|	""Количество положительных анкет"",
	|	ВТ03.КоличествоПоложительныхАнкет,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоПоложительныхАнкет = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	25,
	|	""Количество отрицательных анкет"",
	|	""количество анкет, по которым клиент не доволен последним посещением станции и не готов рекомендовать сервис"",
	|	ВТ03.КоличествоНеДоволенНеРекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоНеДоволенНеРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	30,
	|	""Количество отрицательных анкет"",
	|	""количество анкет, по которым клиент не доволен последним посещем станции, но сервис рекомендовать готов"",
	|	ВТ03.КоличествоНедоволенРекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоНедоволенРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	35,
	|	""Количество отрицательных анкет"",
	|	""количество анкет, по которым клиент доволен последним посещением станции, но рекомендовать сервис не готов"",
	|	ВТ03.КоличествоДоволенНерекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|ГДЕ
	|	ВТ03.КоличествоДоволенНерекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	40,
	|	""Доля негативных отзывов"",
	|	""доля анкет, по которым клиент не доволен последним посещением станции и не готов рекомендовать сервис"",
	|	ВТ03.КоличествоНеДоволенНеРекомендует,
	|	ВТ04.ЗначениеДопПараметраКоличествоЗадачЗакрытыхАнкетой
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_КоличествоЗадачЗакрытыхАнкетой КАК ВТ04
	|		ПО ВТ03.Точка = ВТ04.Точка
	|ГДЕ
	|	ВТ03.КоличествоНеДоволенНеРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	45,
	|	""Доля негативных отзывов"",
	|	""доля анкет, по которым клиент не доволен последним посещем станции, но сервис рекомендовать готов"",
	|	ВТ03.КоличествоНедоволенРекомендует,
	|	ВТ04.ЗначениеДопПараметраКоличествоЗадачЗакрытыхАнкетой
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_КоличествоЗадачЗакрытыхАнкетой КАК ВТ04
	|		ПО ВТ03.Точка = ВТ04.Точка
	|ГДЕ
	|	ВТ03.КоличествоНедоволенРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	50,
	|	""Доля негативных отзывов"",
	|	""доля анкет, по которым клиент доволен последним посещением станции, но рекомендовать сервис не готов"",
	|	ВТ03.КоличествоДоволенНерекомендует,
	|	ВТ04.ЗначениеДопПараметраКоличествоЗадачЗакрытыхАнкетой
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_КоличествоЗадачЗакрытыхАнкетой КАК ВТ04
	|		ПО ВТ03.Точка = ВТ04.Точка
	|ГДЕ
	|	ВТ03.КоличествоДоволенНерекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ031.Точка,
	|	ВТ031.СигнатураПродажи,
	|	55,
	|	""Количество обработанных негативных анкет"",
	|	""Количество обработанных негативных анкет"",
	|	1,
	|	0
	|ИЗ
	|	ВТ031 КАК ВТ031
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	70,
	|	""Количество положительных анкет по повторным машинозаездам"",
	|	""Количество положительных анкет по повторным машинозаездам"",
	|	ВТ03.КоличествоПоложительныхАнкет,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (Продажи.Сигнатура = ВТ03.СигнатураПродажи)
	|			И (Продажи.ХарактеристикаОбъекта = ""Внутренняя гарантия""
	|				ИЛИ Продажи.ХарактеристикаОбъекта = ""Внутренние работы"")
	|ГДЕ
	|	ВТ03.КоличествоПоложительныхАнкет = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	75,
	|	""Количество отрицательных анкет по повторным машинозаездам"",
	|	""количество анкет, по которым клиент не доволен последним посещением станции и не готов рекомендовать сервис"",
	|	ВТ03.КоличествоНеДоволенНеРекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (Продажи.Сигнатура = ВТ03.СигнатураПродажи)
	|			И (Продажи.ХарактеристикаОбъекта = ""Внутренняя гарантия""
	|				ИЛИ Продажи.ХарактеристикаОбъекта = ""Внутренние работы"")
	|ГДЕ
	|	ВТ03.КоличествоНеДоволенНеРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	80,
	|	""Количество отрицательных анкет по повторным машинозаездам"",
	|	""количество анкет, по которым клиент не доволен последним посещем станции, но сервис рекомендовать готов"",
	|	ВТ03.КоличествоНедоволенРекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (Продажи.Сигнатура = ВТ03.СигнатураПродажи)
	|			И (Продажи.ХарактеристикаОбъекта = ""Внутренняя гарантия""
	|				ИЛИ Продажи.ХарактеристикаОбъекта = ""Внутренние работы"")
	|ГДЕ
	|	ВТ03.КоличествоНедоволенРекомендует = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ03.Точка,
	|	ВТ03.СигнатураПродажи,
	|	85,
	|	""Количество отрицательных анкет по повторным машинозаездам"",
	|	""количество анкет, по которым клиент доволен последним посещением станции, но рекомендовать сервис не готов"",
	|	ВТ03.КоличествоДоволенНерекомендует,
	|	0
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО (Продажи.Сигнатура = ВТ03.СигнатураПродажи)
	|			И (Продажи.ХарактеристикаОбъекта = ""Внутренняя гарантия""
	|				ИЛИ Продажи.ХарактеристикаОбъекта = ""Внутренние работы"")
	|ГДЕ
	|	ВТ03.КоличествоДоволенНерекомендует = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ05.Точка КАК Точка,
	|	ВТ05.ИмяГруппы КАК ИмяГруппы,
	|	ВТ05.ИмяПараметра КАК ИмяПараметра,
	|	ВТ05.СигнатураПродажи КАК СигнатураПродажи,
	|	ВТ05.ПорядокПараметра КАК ПорядокПараметра,
	|	ВЫБОР
	|		КОГДА ВТ05.ИмяГруппы = ""Доля негативных отзывов""
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ05.ЗначениеДопПараметра = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВТ05.ЗначениеПараметра / ВТ05.ЗначениеДопПараметра * 100
	|				КОНЕЦ
	|		ИНАЧЕ ВТ05.ЗначениеПараметра
	|	КОНЕЦ КАК ЗначениеПараметра,
	|	ВТ05.ЗначениеДопПараметра КАК ЗначениеДопПараметра,
	|	ВЫБОР
	|		КОГДА ВТ05.ИмяГруппы = ""Доля негативных отзывов""
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ041.КоличествоЗадачЗакрытыхАнкетой, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВТ05.ЗначениеПараметра / ЕСТЬNULL(ВТ041.КоличествоЗадачЗакрытыхАнкетой, 0) * 100
	|				КОНЕЦ
	|		ИНАЧЕ ВТ05.ЗначениеПараметра
	|	КОНЕЦ КАК ОбщийИтогКоличествоЗадачЗакрытыхАнкетой,
	|	Продажи.ХарактеристикаОбъекта КАК ВидРемонта
	|ИЗ
	|	ВТ05 КАК ВТ05
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ВТ05.СигнатураПродажи = Продажи.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ041_КоличествоЗадачЗакрытыхАнкетойДляОбщегоИтога КАК ВТ041
	|		ПО (ИСТИНА)";
	Возврат ТекстЗапроса
КонецФункции

Функция ЗапросВыполнить(Текст, Параметры, ИмяФайла = "");
	
	//Значение по умолчанию - пустой результат запроса
		
	Доступно = 		ТипЗнч(Текст) = Тип("Строка")
				И 	ТипЗнч(Параметры) = Тип("Структура");
	
	Если Не Доступно Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ 1 ГДЕ ИСТИНА = ЛОЖЬ");
		Возврат Запрос.Выполнить();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Для Каждого i Из Параметры Цикл
		Запрос.УстановитьПараметр(i.key, i.value);
	КонецЦикла;

	Запрос.Текст = Текст;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Ф = Новый Файл(ИмяФайла);
		Если Ф.Существует() Тогда
			ТекстДок = Новый ТекстовыйДокумент();
			ТекстДок.Прочитать(ИмяФайла);
			ТекстИзФайла = ТекстДок.ПолучитьТекст();
			Если СтрДлина(ТекстИзФайла)>0 Тогда
				Запрос.Текст = ТекстИзФайла;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

Функция ПолучитьСКД(ИмяМакета, ИмяФайла = "") Экспорт
	
	СхемаКомпоновкиДанных = Неопределено;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Ф = Новый Файл(ИмяФайла);
		Если Ф.Существует() Тогда			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(ИмяФайла);
			СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
			ЧтениеXML.Закрыть();
			Возврат СхемаКомпоновкиДанных;
		КонецЕсли;
	КонецЕсли;

	Доступно = Истина;
	Доступно = ТипЗнч(ИмяМакета) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ИмяМакета);
	Если Не Доступно Тогда
		Возврат СхемаКомпоновкиДанных;
	КонецЕсли;
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	Возврат СхемаКомпоновкиДанных;
КонецФункции
