&НаСервере
Функция ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект) 		
	//Значение по умолчанию = 0 - количество добавленных строк
	//----------------------------------------------------
	
	ИНН = СокрЛП(СпрОбъект.ИНН);
	КПП = СокрЛП(СпрОбъект.КПП);
	
	Доступно = 		СтрДлина(ИНН)=10
				И 	СтрДлина(КПП)=9;   
				
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Информация, , СтрШаблон("ПараметрыСоединения = %1, ИНН = %2, КПП = %3", ИсточникДанных.ПараметрыСоединения, ИНН, КПП), "Ошибка в типе или значении аргументов");
		Возврат 0;
	КонецЕсли;
	
	Если 	
		//Альфы
		//-------
		СтрНайти(ИсточникДанных.ПараметрыСоединения, "sto_oper")>0   		//Казань
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "alc_oper")>0  	//Москва Альянс Пестриков И.
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "luidor_sto")>0 	//НН Пестриков И.
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "rm_rarus")>0   	//Саранск
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "ufa_rarus")>0  	//Уфа
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "cheb_rarus")>0   //Чебоксары
		
		//Оперучет
		//---------
		Или СтрНайти(ИсточникДанных.ПараметрыСоединения, "asc_oper")>0		Тогда
		
		БИ_Запрос 		=  БИ.NewObject("Запрос");
		БИ_Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.Код КАК Код, Т.Наименование КАК Наименование ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.ИНН = &ИНН И Т.КПП = &КПП";
		БИ_Запрос.УстановитьПараметр("ИНН", ИНН);
		БИ_Запрос.УстановитьПараметр("КПП", КПП);			
		БИ_РезультатЗапроса = БИ_Запрос.Выполнить();	
		
		//Все остальные базы
		//-------------------
	Иначе 				
		БИ_Запрос 		=  БИ.NewObject("Запрос");
		БИ_Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.Код КАК Код, Т.Наименование КАК Наименование ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.ИНН = &ИНН И Т.КПП = &КПП";	
		БИ_Запрос.УстановитьПараметр("ИНН", ИНН);
		БИ_Запрос.УстановитьПараметр("КПП", КПП);			
		БИ_РезультатЗапроса = БИ_Запрос.Выполнить();
	КонецЕсли;
	
	Если БИ_РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	БИ_Выборка = БИ_РезультатЗапроса.Выбрать();
	
	ДобавленоСтрок = 0;
	Пока БИ_Выборка.Следующий() Цикл
		
		ДобавленоСтрок = ДобавленоСтрок+1;
		
		НоваяСтрока = СпрОбъект.ИсточникиДанных.Добавить();
		НоваяСтрока.Период 				=	ТекущаяДата();
		НоваяСтрока.ИсточникДанных 		= 	ИсточникДанных.Ссылка;
		
		ТипДанныхXML = БИ.СериализаторXDTO.XMLТипЗнч(БИ_Выборка.Ссылка);
		Если ТипДанныхXML <> Неопределено Тогда
			ТипДанныхXMLСтрокой 		= ТипДанныхXML.URIПространстваИмен+":"+ТипДанныхXML.ИмяТипа;	
			НоваяСтрока.ТипДанныхXML 	= ТипДанныхXMLСтрокой;
		КонецЕсли;
		
		//Поиск элемента справочника ИБ:ТипыДанных
		//----------------------------------------
		Если ЗначениеЗаполнено(НоваяСтрока.ИсточникДанных) И ЗначениеЗаполнено(НоваяСтрока.ТипДанныхXML) Тогда
			Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Т.Ссылка КАК Ссылка ИЗ Справочник.ИБ_ТипыДанных КАК Т ГДЕ Т.ИсточникДанных = &ИсточникДанных И Т.ТипДанныхXML = &ТипДанныхXML";
			Парам = Новый Структура("ИсточникДанных, ТипДанныхXML", ИсточникДанных.Ссылка, ТипДанныхXMLСтрокой);
			РезультатЗапроса = ОбщегоНазначения.ЗапросВыполнить(Текст, Парам);
			Если РезультатЗапроса.Пустой() Тогда
				ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Информация, , СтрШаблон("ПараметрыСоединения = %1, ИНН = %2, КПП = %3", ИсточникДанных.ПараметрыСоединения, ИНН, КПП), "Не найден элемент справочника ИБ:ТипыДанных");
			Иначе
				НоваяСтрока.ТипДанных = РезультатЗапроса.Выгрузить()[0][0];
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Идентификатор	=	БИ.XMLСтрока(БИ_Выборка.Ссылка);
		НоваяСтрока.Представление	= 	БИ_Выборка.Наименование+" ["+БИ_Выборка.Код+"]";		
	КонецЦикла;
	
	Возврат ДобавленоСтрок;
КонецФункции


&НаСервере
Функция ЗагрузиГУИДЫ_ДляЮЛ_ПоИННКПП_НаСервере(СпрСсылка, СпрОбъект = Неопределено) Экспорт
	ЗначениеПоУмолчанию = Ложь;
	
	КоличествоДобавленныхСтрок = 0;
	
	Если  СпрОбъект = Неопределено Тогда        
		СпрОбъектБылоНеопределено = Истина;
	Иначе
		СпрОбъектБылоНеопределено = Ложь;
	КонецЕсли;
	
	ИсточникДанных = Справочники.ИБ_ИсточникиДанных.Выбрать();
	
	Пока ИсточникДанных.Следующий() Цикл
		
		Если СтрНайти(ИсточникДанных.Комментарий, "не загружать") Тогда
			Продолжить;
		КонецЕсли;
		
		БИ = ОбщегоНазначения.ПолучитьПодключениеБД(ИсточникДанных.ПараметрыСоединения);
		Если БИ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//Возможны следуюищие режимы вызова
		//1 Непосредственно, т.е. не из элемента справочника контрагенты. Тогда при исполнении элемент не перезаписывается,
		//1.1. Непосредственно, но не выбран элемент. Не передается ни ссылка, ни объект
		//1.2. Непосредственно, но выбран элемент. Передается ссылка и объект
		//
		//2 Из формы объекта - элемента справочника контрагенты. Возможны два случая
		//2.1. Это новый элемент справочника (у него нет ссылки). Не передается ссылка, но передается объект
		//2.2. Это существующий элемент справочника (есть ссылка). Передается ссылка и объект
		
		Запрос = Новый Запрос();
		
		//Интерактивный вызов, т.е. не из формы элемента справочника
		//-----------------------------------------------------------
		Если СпрОбъект = Неопределено Тогда
			
			Запрос.Текст =  "ВЫБРАТЬ Т.Ссылка КАК Ссылка, Т.ИНН КАК ИНН, Т.КПП КАК КПП ИЗ Справочник.Контрагенты КАК Т ГДЕ Т.Тип = &Тип";
			Запрос.УстановитьПараметр("Тип", "ЮЛ");
			Запрос.УстановитьПараметр("СпрСсылка", СпрСсылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если (СтрДлина(СокрЛП(Выборка.ИНН))=10 И СтрДлина(СокрЛП(Выборка.КПП))=9) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				
				СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
				КоличествоДобавленныхСтрок = ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект);				
			КонецЦикла;
			
			//Не интерактивный вызов, из формы объекта - элемента справочника, всегда обрабатываетс одна запись в приемнике
			//---------------------------------------------------------------
		Иначе 			
			ДобавитьСтроки_ЗаписатьСозданныйОбъект(ИсточникДанных, БИ, СпрОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Доступно = СпрОбъектБылоНеопределено;
	Доступно = Доступно И  КоличествоДобавленныхСтрок >0 ;
	
	Если Доступно Тогда
		Попытка
			СпрОбъект.Записать();
		Исключение
			Данные =  "ИНН = "+Выборка.ИНН+"; КПП="+Выборка.КПП;
			Комментарий=ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ДобавитьСтроки_ЗаписатьСозданныйОбъект", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, Данные, Комментарий);
			Возврат ЗначениеПоУмолчанию;
		КонецПопытки	
	КонецЕсли;
	
	
	Возврат Истина;
	
КонецФункции

