Процедура ЗаполниТЧ_КонтактныеЛица() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.КонтрагентТел КАК КонтрагентТел,
	               |	Т.СотрудникТел КАК СотрудникТел,
	               |	Т.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	Т.Контрагент КАК Контрагент,
	               |	Т.Сотрудник КАК Сотрудник,
	               |	Т.Сотрудник1 КАК Сотрудник1,
	               |	Т.Сотрудник1Тел КАК Сотрудник1Тел,
	               |	Т.Сотрудник2 КАК Сотрудник2,
	               |	Т.Сотрудник2Тел КАК Сотрудник2Тел
	               |ИЗ
	               |	РегистрСведений.КонтрагентыВСотрудники КАК Т";
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.КонтактныеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Выб);
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗаполниТЧ_ОтветственныеЗаКонтрагента(ТелНомерВнешнегоАбонента) Экспорт
		
		Отб = Новый Структура();
		Отб.Вставить("КонтрагентТел", ТелНомерВнешнегоАбонента);
		Найденные = ЭтотОбъект.КонтактныеЛица.НайтиСтроки(Отб);
		
		Если Найденные.Количество() = 0 Тогда
			Возврат
		КонецЕсли;
		
		Для Каждого Стр Из Найденные Цикл
			Новая = ЭтотОбъект.ОтветственныеЗаКонтрагента.Добавить();
			ЗаполнитьЗначенияСвойств(Новая, Стр);
		КонецЦикла;
		
	КонецПроцедуры
		
Процедура ЗаполниТЧ_АнкетыРекурсивно() Экспорт
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Вопрос,
		|	Т.ВариантыОтветов.(
		|		Ответ КАК Ответ,
		|		СледующийВопросИлиТелНомер КАК СледующееДействие,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.Анкеты)
		|				ТОГДА 1
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ТелВнутренние)
		|				ТОГДА 2
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ТелОчереди)
		|				ТОГДА 3
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ВиртуальныеОчереди)
		|				ТОГДА 4
		|		КОНЕЦ КАК СледующееДействиеТип,
		|		СледующийВопросИлиТелНомер.Код КАК СледующееДействиеКод,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК ВариантыОтветов
		|ИЗ
		|	Справочник.Анкеты КАК Т
		|ГДЕ
		|	Т.ЭтоГруппа = ЛОЖЬ
		|	И Т.Родитель.Код = ""000000013""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос,
		|	НомерСтроки";
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ТЗ = Рез.Выгрузить();
		
		Для Каждого Стр1 Из ТЗ Цикл
			НовыйВопрос = ЭтотОбъект.АнкетаВопросы.Добавить();
			НовыйВопрос.Вопрос = Стр1.Вопрос;
			Для Каждого Стр2 из Стр1.ВариантыОтветов Цикл	
				НовыйОтвет 						= ЭтотОбъект.АнкетаОтветы.Добавить();
				НовыйОтвет.Вопрос 				= НовыйВопрос.Вопрос;
				ЗаполнитьЗначенияСвойств(НовыйОтвет, Стр2);
			КонецЦикла;
		КонецЦикла;
		
	КонецПроцедуры
		
Процедура ЗаполниТЧ_ВыбираемыеОтветы() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ Т.Ссылка КАК Вопрос, Т.Ответ КАК Ответ, Т.Картинка КАК Картинка ИЗ Справочник.Анкеты.ВариантыОтветов КАК Т ГДЕ Т.Ссылка.Родитель.Код = ""000000014""");
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.ВыбираемыеОтветы.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Выб);
	КонецЦикла;
  КонецПроцедуры

#Область WebSocket
Функция ПолучиМакетHTML() Экспорт
	мкт = ЭтотОбъект.ПолучитьМакет("МакетHTML");
	Возврат мкт.ПолучитьТекст();
КонецФункции
#КонецОбласти