&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Инициализация переменных
//-------------------------------------------------------------------------------------------------
	НеРаботает = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной");

// Будний день: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.БудРежим);
	Доступно = Доступно И (Объект.БудРежим <> НеРаботает);
	Элементы.ГруппаБуднийЧасы.ТолькоПросмотр = (НЕ Доступно);

// Суббота: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.СубРежим);
	Доступно = Доступно И (Объект.СубРежим <> НеРаботает);
	Элементы.ГруппаСубботаЧасы.ТолькоПросмотр = (НЕ Доступно);

// Воскресенье: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.ВскРежим);
	Доступно = Доступно И (Объект.ВскРежим <> НеРаботает);
	Элементы.ГруппаВоскресеньеЧасы.ТолькоПросмотр = (НЕ Доступно);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура РежимПриИзменении(Элемент)

// Инициализация переменных
//-------------------------------------------------------------------------------------------------
	НеРаботает = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной");
	Префикс = Лев(СокрЛП(Элемент.Имя),3);

// Если установлен нерабочий режим, то очистим значения реквизитов отвечающих за часы работы
//-------------------------------------------------------------------------------------------------
	Если (Объект[Префикс + "Режим"] = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной")) Тогда
		Объект[Префикс + "Нач"] = Неопределено;
		Объект[Префикс + "Кон"] = Неопределено;
	КонецЕсли;

	ОбновлениеОтображения();
КонецПроцедуры
