&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("schedule", Объект.schedule);

	//Если Параметры.Свойство("schedules_names_Ссылка") Тогда
	//	РасписаниеСсылка = Параметры.schedules_names_Ссылка;
	//КонецЕсли;
	//
	//Если Параметры.Свойство("id_name") Тогда
	//	
	//	//Заполни имя и описание расписания
	//	//----------------------------------
	//	Запрос = Новый Запрос();
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	schedules_names.name КАК name,
	//	|	schedules_names.description КАК description
	//	|ИЗ
	//	|	ВнешнийИсточникДанных.AsteriskEdge.Таблица.schedules_names КАК schedules_names
	//	|ГДЕ
	//	|	schedules_names.id = &id_name";
	//	Запрос.УстановитьПараметр("id_name", Параметры.id_name);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Выборка.Следующий();
	//	РасписаниеИмя 		= Выборка.name;
	//	РасписаниеОписание 	= Выборка.description; 
	//	ЭтаФорма.Заголовок 	= "Расписание "+Выборка.description+ ", для канала " + Параметры.КаналТелефон;
	//КонецЕсли;
	//	
	//Если Объект.Ссылка = ВнешниеИсточникиДанных.AsteriskEdge.Таблицы.schedules_custom.ПустаяСсылка() Тогда
	//	//Получи новый макс.id
	//	//---------------------
	//	Запрос = Новый Запрос();
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	МАКСИМУМ(schedules_custom.id) + 1 КАК id_plus_1
	//	|ИЗ
	//	|	ВнешнийИсточникДанных.AsteriskEdge.Таблица.schedules_custom КАК schedules_custom";
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	Объект.id=Выборка.id_plus_1;
	//КонецЕсли;
	//
	////Для заполнения нового объекта
	////---------------------------	
	//Если Параметры.Свойство("id_name") Тогда
	//	Объект.id_name = Параметры.id_name;	
	//КонецЕсли;
	//
	//Если Параметры.Свойство("start_time") Тогда
	//	ЗаполнитьЗначенияСвойств(Объект, Параметры, "start_time, end_time, holiday");
	//	//Объект.from_date 	= Параметры.ВыбраннаяДата;
	//	//Объект.to_date 		= Параметры.ВыбраннаяДата;
	//	Объект.from_date 	= Параметры.from_date;
	//	Объект.to_date		= Параметры.to_date;
	//КонецЕсли;
	//
	//
	////Заполни расписание по умолчанию
	////--------------------------------
	//Запрос = Новый Запрос();
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	schedules_default.dow КАК dow,
	//|	schedules_default.start_time КАК start_time,
	//|	schedules_default.end_time КАК end_time,
	//|	schedules_default.holiday КАК holiday
	//|ИЗ
	//|	ВнешнийИсточникДанных.AsteriskEdge.Таблица.schedules_default КАК schedules_default
	//|ГДЕ
	//|	schedules_default.id_name = &id_name";
	//Запрос.УстановитьПараметр("id_name", 	Объект.id_name);
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Нов = РасписаниеПоУмолчанию.Добавить();
	//	ЗаполнитьЗначенияСвойств(Нов, Выборка);
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаписатьНовоеИмяИОписаниеРасписания();
	ЗаписатьРасписаниеПоУмолчанию()
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРасписаниеПоУмолчанию()
	Для Сч = 0 По 6 Цикл
		СчетчикСтрокой = Строка(Сч+1);
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	schedules_default.Ссылка КАК Ссылка
		|ИЗ
		|	ВнешнийИсточникДанных.AsteriskEdge.Таблица.schedules_default КАК schedules_default
		|ГДЕ
		|	schedules_default.id_name = &id_name
		|	И schedules_default.dow = &dow";
		Запрос.УстановитьПараметр("id_name", 	Объект.id_name);
		Запрос.УстановитьПараметр("dow",		РасписаниеПоУмолчанию[Сч]["dow"]);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Изменен = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДефолтОб = Выборка.Ссылка.ПолучитьОбъект();
		Если ДефолтОб.start_time <> РасписаниеПоУмолчанию[Сч]["start_time"] Тогда
			ДефолтОб.start_time = РасписаниеПоУмолчанию[Сч]["start_time"];
			Изменен = Истина;
		КонецЕсли;
		Если ДефолтОб.end_time <> РасписаниеПоУмолчанию[Сч]["end_time"]  Тогда
			ДефолтОб.end_time = РасписаниеПоУмолчанию[Сч]["end_time"];
			Изменен = Истина;
		КонецЕсли;  	
		Если ДефолтОб.holiday <> РасписаниеПоУмолчанию[Сч]["holiday"] Тогда
			ДефолтОб.holiday = РасписаниеПоУмолчанию[Сч]["holiday"] ;
			Изменен = Истина;
		КонецЕсли;
		Если Не Изменен Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ДефолтОб.Записать();
		Исключение
			Комментарий = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ЗаписатьРасписаниеПоУмолчанию()", УровеньЖурналаРегистрации.Ошибка, Метаданные.ВнешниеИсточникиДанных.AsteriskEdge, "id_name = "+Объект.id_name, Комментарий);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовоеИмяИОписаниеРасписания()
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	schedules_names.Ссылка КАК Ссылка,
	|	schedules_names.name КАК name,
	|	schedules_names.description КАК description
	|ИЗ
	|	ВнешнийИсточникДанных.AsteriskEdge.Таблица.schedules_names КАК schedules_names
	|ГДЕ
	|	schedules_names.id = &id";
	Запрос.УстановитьПараметр("id", Параметры.id_name);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.description = РасписаниеОписание И Выборка.name = РасписаниеИмя Тогда
		Возврат;
	КонецЕсли;
	
	Об = Выборка.Ссылка.ПолучитьОбъект();
	Об.name			= РасписаниеИмя;
	Об.description  = РасписаниеОписание;
	Попытка
		Об.Записать();		
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ЗаписатьНовоеИмяИОписаниеРасписания()", УровеньЖурналаРегистрации.Ошибка,, "id_name = "+Параметры.id_name, Комментарий);	
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура РасписаниеСсылкаПриИзменении(Элемент)
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("schedule", Объект.schedule);
КонецПроцедуры
	 
