
Процедура СтоимостьИзЯндексДирект() Экспорт
	//Вызывается регламентным заданием ЯндексДиректСтоимость_3ч40м
	
	// С 29.08.2022 отключено до момента, когда маркетологи скажут включить
	//=====================================================================
	Возврат;
	
	ТекДата = ТекущаяДата();
	
 	ДатаНачала 		= НачалоДня(ТекДата-31*24*60*60); // Дата начала на 31 раньше текущей
	ДатаОкончания	= ТекДата;
	
	СтоимостьИзЯндексДиректЗаПериод(ДатаНачала, ДатаОкончания); 

КонецПроцедуры

Процедура СтоимостьИзЯндексДиректЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Об = Обработки.ЯндексДирект.Создать();
	Об.ДатаНачала 		= ДатаНачала;
	Об.ДатаОкончания 	= ДатаОкончания;	
	Об.УстановитьНастройки();
	Об.ЗагрузитьДанныеПоВсемУчетнымЗаписям(Об.ДатаНачала, Об.ДатаОкончания);
	
КонецПроцедуры

Процедура GoogleAdwordsCost() Экспорт
	// Стоимость интернет-компаний Google Adwords. Вызывается регламентным заданием GoogleAdwordsCost_3ч50м
	
	Об = Обработки.GoogleAdwords_App.Создать();	
	Об.АвторизацияБезПользователяИЗагрузка();
	
КонецПроцедуры




