
&НаКлиенте
Процедура Настройки(Команда)
		ЭтаФорма.Элементы.ГрНастройки.Видимость = Не ЭтаФорма.Элементы.ГрНастройки.Видимость
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Об = РеквизитФормыВЗначение("Отчет");
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Отчет");
	
	//ЭтаФорма.Элементы.ГрНастройки.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	//Создать табличный документ для передачи на сервер
	//--------------------------------------------------------	
	//ТаблДок = Новый ТабличныйДокумент();
	ТаблДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	//Сформировать отчет
	//----------------------------
	Команда1_НаСервере(ТаблДок );
	
	// Вывести отчет пользователю
	//---------------------------------------------------------------------------------------
	Если ЭтаФорма.Отчет.ПоказатьКакHTML Тогда	
		ИмяФайла = КаталогВременныхФайлов()+xmlСтрока(Новый УникальныйИдентификатор)+".html";
		ТаблДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
		ЗапуститьПриложение(ИмяФайла);
	Иначе
		ТаблДок.ТолькоПросмотр 		= Истина;
		ТаблДок.ОтображатьСетку		= Ложь;
		ТаблДок.ОтображатьЗаголовки = Ложь;
		//ТаблДок.Показать("Анкеты по ремонтам");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Команда1_НаСервере(ТаблДок)	
	Об = РеквизитФормыВЗначение("Отчет");                    
	Об.СформироватьОтчет(ТаблДок);
	
	//Отладка
	ЗначениеВРеквизитФормы(Об, "Отчет");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ГрНастройки.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры






