Функция ПоставьЗадачуСвободномуОператору(НомерОператора) Экспорт
		//На входе номер телефона свободного оператора КЦ
		// На выходе номер телефона абонента, ожидающего автозвонок и сигнатура интернет-заявки
		  
	  Доступно = ТипЗнч(НомерОператора) = Тип("Строка") И СтрДлина(НомерОператора); 
	  
	  Если Не Доступно Тогда
		  ЗаписьЖурналаРегистрации("КонтактЦентрСервер.ПоставьЗадачуСвободномуОператору", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("НомерОператора = %1", НомерОператора), "Ошибка в типе или заполнении аргументов");
		  Результат = Новый Структура("Телефон, Сигнатура", "", "");
		  Возврат Результат;
	  КонецЕсли;
	  
	  ТелефонИСигнатураОткрытойЗадачи = РегистрыСведений.ЗадачиИнтернетЗаявки.НайдиИЗаблокируйПервуюОткрытуюЗадачу_ДляВыполненияЗвонка(НомерОператора);
	  
	  Возврат  ТелефонИСигнатураОткрытойЗадачи;	   
	    
 КонецФункции
    
Функция ПереводЗвонка(Оператор, Направление) Экспорт
	//Добавляет запись в регистр сведений "Переводы звонков"
	// Параметры: Оператор - текущий пользователь, оператор контакт-центра, Направление  - внутренний телефон, телефонная очередь, виртуальная телефонная очередь
	
	ТекДата = ТекущаяДата();
	МЗ = РегистрыСведений.ПереводыЗвонков.СоздатьМенеджерЗаписи();
	МЗ.Период 	   = ТекДата;
	МЗ.Оператор    = Оператор;
	МЗ.Направление = Направление;
	МЗ.Количество  = 1;
	Попытка
		МЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Перевод звонка записать", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Период = %1, Оператор = %2, Направление = %3", ТекДата, Оператор, Направление), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецФункции
 
Функция ВнутренниеТелефоныКроме(ИсключиНомер = "") Экспорт
	//Возвращает массив всех внутренних телефонов, ислючая заданные номер ИсключиНомер    
	
	Доступно = ТипЗнч(ИсключиНомер) = Тип("Строка");
	Если Не Доступно Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Код ИЗ Справочник.ТелВнутренние ГДЕ Код <> &Код");
	Запрос.УстановитьПараметр("Код", ИсключиНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Новый Массив();
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	Возврат Результат;
 КонецФункции
 
#Область Команды_телефонии_через_Rest_API_для_ВэбКлиента
Функция _ВыполнитьКоманду(ТекстКоманды) Экспорт	
	Соединение 	= Новый HTTPСоединение("192.168.0.137", 8084);
	Запрос 		= Новый HTTPЗапрос("/ami/action"+ТекстКоманды);
	Запрос.Заголовки.Вставить("Par1", ТекстКоманды);
	HTTPОтвет = Соединение.Post(Запрос);
КонецФункции
#КонецОбласти

