Функция Добавить(Сигнатура,	Продажа) Экспорт
		
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ТипЗнч(Продажа) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура) И ЗначениеЗаполнено(Продажа);
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+	Сигнатура + "Продажа = " + Продажа, "неверные параметры");
		Возврат  Ложь
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЗадачиЛояльностиПакеты.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура 	= Сигнатура;
	НЗ.Продажа 		= Продажа;
	
	НЗ.Прочитать();
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	НЗ.Сигнатура 	= Сигнатура;
	НЗ.Продажа		= Продажа;
	НЗ.ДатаПакета	= ТекущаяДата();			

	Попытка
		НЗ.Записать();
	Исключение  
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+	Сигнатура + "Продажа = " + Продажа, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат  Ложь;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции
