Процедура ПриЗаписи(Отказ)
		
	//ХранилищеСодержимого = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
	//ЭтотОбъект.Содержимое = ХранилищеСодержимого;

КонецПроцедуры

Функция ЗаполнитьСодержимое(Адрес) Экспорт
	
	Доступно = ТипЗнч(Адрес) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Адрес);
	
	ЗначениеПоУмолчанию = Ложь;
	
	Если Не Доступно Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	СодержимоеИзВремХр =  ПолучитьИзВременногоХранилища(Адрес);
	Если СодержимоеИзВремХр = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ХранилищеСодержимого = Новый ХранилищеЗначения(СодержимоеИзВремХр);
	ЭтотОбъект.Содержимое = ХранилищеСодержимого;
	ЭтотОбъект.Записать();
	Возврат Истина;
	
КонецФункции
