
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Доступно = Истина;
	Доступно = Доступно И ЗначениеЗаполнено(Параметры.СигнатураЗадачи);
	Если Не Доступно Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("СигнтраЗадачи");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение	=	Параметры.СигнатураЗадачи;
	ЭлОтбора.Использование	=	Истина;
КонецПроцедуры
