Функция Загрузить(	Сигнатура,  
					Проект = "",
					Точка = "", 
					Дата = '00010101', 
					Номер = "", 
					ДопДата = '00010101',
					Вид = "", 
					Объект = "", 
					ХарактеристикаОбъекта = "", 
					Контрагент = "", 
					АбонентВнешний = "", 
					Сотрудник = "",
					ДругиеСотрудники = "",
					Заказчик = "",
					КонтактноеЛицо = "",
					СотрудникГУИД ="",
					Количество = 0,
					Магистральный = Ложь,
					Машинозаезд = "",
					ТочкаЗаказНаряда = "") Экспорт
	
	Доступно = 		ТипЗнч(Сигнатура) = Тип("Строка")
				И 	ЗначениеЗаполнено(Сигнатура)
				И 	ТипЗнч(Проект) 	= Тип("Строка")
				И ТипЗнч(Точка)					= Тип("Строка")
				И ТипЗнч(Дата) 					= Тип("Дата")
				И ТипЗнч(Номер)					= Тип("Строка")
				И ТипЗнч(ДопДата) 				= Тип("Дата")
				И ТипЗнч(Вид)					= Тип("Строка")
				И ТипЗнч(Объект)				= Тип("Строка")	
				И ТипЗнч(ХарактеристикаОбъекта) = Тип("Строка")
				И ТипЗнч(Контрагент) 			= Тип("Строка")
				И ТипЗнч(АбонентВнешний)		= Тип("Строка")
				И ТипЗнч(Сотрудник) 			= Тип("Строка");
	Если Не Доступно Тогда
		Возврат Ложь
	КонецЕсли;
	
	НЗ = РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();	
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ.Сигнатура 				= Сигнатура;
	
	НЗ.Количество				= Количество;
	
	НЗ.Проект					= Проект;
	НЗ.Точка					= Точка;
	НЗ.Дата 					= Дата;
	НЗ.Номер 					= Номер;
	НЗ.ДопДата					= ДопДата;
	НЗ.Вид						= Вид;
	НЗ.Объект		 			= Объект;
	НЗ.ХарактеристикаОбъекта 	= ХарактеристикаОбъекта;
	НЗ.Контрагент				= Контрагент;
	НЗ.АбонентВнешний			= АбонентВнешний;
	НЗ.Сотрудник				= Сотрудник;
	НЗ.СотрудникГУИД			= СотрудникГУИД;
	НЗ.ДругиеСотрудники			= ДругиеСотрудники;
	НЗ.Заказчик					= Заказчик;
	НЗ.КонтактноеЛицо			= КонтактноеЛицо;
	НЗ.Магистральный			= Магистральный;
	НЗ.Машинозаезд				= Машинозаезд;
	НЗ.ТочкаЗаказНаряда			= ТочкаЗаказНаряда;
	
	Попытка
		НЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Продажи.Загрузить().Ошибка записи", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+Сигнатура, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
			
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура) И ТипЗнч(ИмяРеквизита)=Тип("Строка") И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено") И ЗначениеЗаполнено(ЗначениеРеквизита);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.Продажи.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, , "Сигнатура="+Сигнатура+"; ИмяРеквизита="+ИмяРеквизита+"; ЗначениеРеквизита="+ЗначениеРеквизита, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции

Функция УстановиДатуЗакрытияИСотрудника(Сигнатура, ДатаЗакрытия, Сотрудник)Экспорт
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Ложь
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;

	Если Не ЗначениеЗаполнено(НЗ.ДопДата) И ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		НЗ.ДопДата = ДатаЗакрытия;
		ИзмененоЗначениеРеквизита = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НЗ.Сотрудник) И ЗначениеЗаполнено(Сотрудник) Тогда
		НЗ.Сотрудник = Сотрудник;
		ИзмененоЗначениеРеквизита = Истина;
	КонецЕсли;
	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиДатуЗакрытияИСотрудника()", УровеньЖурналаРегистрации.Ошибка, , "Сигнатура="+Сигнатура, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
			Возврат Ложь;
	КонецПопытки;
	
КонецФункции

