&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Проверим правильность переданных параметров
//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(ЭтаФорма.Параметры.Телефон)) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Сформируем заголовок формы
// Установим фильтрацию списка звонков по номеру переданного телефона
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.Заголовок = "Состоявшиеся звонки по абоненту " + СокрЛП(ЭтаФорма.Параметры.Телефон);
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("АбонентВнешний",СокрЛП(ЭтаФорма.Параметры.Телефон));

	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Сегодня",НачалоДня(ТекущаяДата()));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Вчера",НачалоДня(ТекущаяДата() - 86400));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Неделя",НачалоНедели(ТекущаяДата()));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Месяц",НачалоМесяца(ТекущаяДата()));
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СписокВыбор(Элемент,ВыбраннаяСтрока,Поле,СтандартнаяОбработка)
		
// Проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Доступно = (Поле.Имя = "СписокAtxfer");
	Доступно = Доступно ИЛИ (Поле.Имя = "СписокRedirect");
	Доступно = Доступно И (Элементы.Список.ТекущиеДанные <> Неопределено);
	СтандартнаяОбработка = Ложь;

	Если (Доступно = Ложь) Тогда
		Возврат;
	КонецЕсли;

// Получим номер телефона для перевода вызова
//-------------------------------------------------------------------------------------------------
	ТелСсылка = Элементы.Список.ТекущиеДанные.AtxFer;
	ТелНомер = ЗначенияСервера.ПолучитьЗначениеРеквизита(ТелСсылка,"Код");
	
	ЭтаФорма.Объект.ТелВнутренний = ТелНомер;
	
// Выполним перевод вызова на выбранного внутреннего абонента
//-------------------------------------------------------------------------------------------------
	Если (Поле.Имя = "СписокAtxfer") Тогда
		КонтактЦентр.КомандаAtxfer(ЭтаФорма.Параметры.Канал,ТелНомер);
	Иначе
		КонтактЦентр.КомандаBlindTransfer(ЭтаФорма.Параметры.Канал,ТелНомер);
	КонецЕсли;

	Оповестить("Перевод",ТелНомер,ЭтаФорма);
	ЭтаФорма.Закрыть();
КонецПроцедуры

