
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Отчет.ПериодОбработки) Тогда
		Предупреждение("Не задан период обработки");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Отчет.ПолноеИмяФайла ) Тогда
		Предупреждение("Не задано имя файла");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Очистить();
	ЭтаФорма.Отчет.ПодготовленныеДанные.Очистить();

	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать(ЭтаФорма.Отчет.ПолноеИмяФайла);
	
	КоличествоСтрок = Текст.КоличествоСтрок();
	Если КоличествоСтрок<5 Тогда
		Предупреждение("Файл не содержит строк для обработки");
		Возврат
	КонецЕсли;
		
	// Загрузи исходные данные
	//------------------------
	Для i=5 По КоличествоСтрок Цикл
		
		Стр = Текст.ПолучитьСтроку(i);
		Мас = СтрРазделить(Стр, ";");
		
		Если Мас.Количество()<3 Тогда
			Продолжить;
		КонецЕсли;
		
		Тел 	= Мас[2];
		Отпр 	= Мас[5];
				
		Новая = ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Добавить();
		Новая.Телефон 		= Тел;
		Новая.Отправлено 	= Отпр;
	КонецЦикла;
	
		
	Если ЭтаФорма.Отчет.ИсходныеДанныеИзФайла.Количество()=0
	Тогда
		Предупреждение("Не найдены телефоны в файле");
		Возврат
	КонецЕсли;
	
	//Подготовь данные
	//----------------
	Отбор = Новый Структура();
	
	Для Каждого Стр Из ЭтаФорма.Отчет.ИсходныеДанныеИзФайла Цикл
		
		Тел = Стр.Телефон;
		
		//Удали кавычки
		//--------------
		Тел = СтрЗаменить(Тел, Символ(34), "");
		
		Если СтрДлина(Тел)<>11 Тогда
			//Сообщить("Отбросили номер телефона "+Тел+", из-за неверной длины" );
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Отбросили номер телефона "+Тел+", из-за неверной длины";  
			Сооб.Сообщить();
			Продолжить;
		КонецЕсли;
		
		//Отбрось лидирующую цифру "7"
		//----------------------------
		Тел = Прав(Тел,10);

		Отпр = Стр.Отправлено;
		Отпр = СтрЗаменить(Отпр, Символ(34), "");
		
		Попытка
			Отправлено = Дата(Отпр)
		Исключение
			//Сообщить("Ошибка преобразования к дате:" + Отпр+ " удаляем из анализа телефон "+Тел);			
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Удаляем из анализа строку с телефоном   "+Тел+"    - ошибка преобразования даты";  
			Сооб.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Отбор.Вставить("Телефон", Тел);
		Найдено = ЭтаФорма.Отчет.ПодготовленныеДанные.НайтиСтроки(Отбор);
		Если Найдено.Количество()>0 Тогда
			//Сообщить("Дубль телефона: "+Тел+ ", удаляем");
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст = "Дубль телефона: "+Тел+ ", удаляем";  
			Сооб.Сообщить();
			Продолжить
		КонецЕсли;
		
		Новая = ЭтаФорма.Отчет.ПодготовленныеДанные.Добавить();
		Новая.Телефон 		= Тел;
		Новая.Отправлено 	= Отправлено;
	КонецЦикла;
	
	Если ЭтаФорма.Отчет.ПодготовленныеДанные.Количество()=0 Тогда
		Сообщить("Нет подготовленных данных для анализа");
		Возврат
	КонецЕсли;

	 СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ЭтаФорма.Результат.Очистить();
	
	Об = РеквизитФормыВЗначение("Отчет");
	Об.СкомпоноватьРезультат(ЭтаФорма.Результат);
	ЗначениеВРеквизитФормы(Об, "Отчет");

КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭтаФорма.Отчет.ПолноеИмяФайла = ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	ПолноеИмя = "";
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла=Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Задайте имя файла выгрузки'");
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.csv)|*.csv|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПолноеИмя = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	Возврат ПолноеИмя
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Результат.Скрыть();
	УстановиЦелевыеТочки();
	//Если ЭтаФорма.Отчет.ТочкиЦелевые.Количество()>0 Тогда
	//	ЭтаФорма.Элементы.ТочкиЦелевые.Доступность=Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановиЦелевыеТочки()
	Об = РеквизитФормыВЗначение("Отчет");
	Об.ДоступныеЦелевыеОчередиУстанови();
	ЗначениеВРеквизитФормы(Об, "Отчет");
КонецПроцедуры


