Функция Загрузить (Сигнатура, Содержание) Экспорт
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	Доступно = ТипЗнч(Сигнатура) = Тип("строка");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно И ТипЗнч(Содержание) = Тип("Строка");
	Доступно  = Доступно И ЗначениеЗаполнено(Содержание);
	
	НЗ = РегистрыСведений.ПисьмаСодержание.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();
	
	Если НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	
	НЗ.Сигнатура = Сигнатура;
	НЗ.Содержание = Содержание;
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Загрузить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПисьмаСодержание,, ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция Очистить() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ Т.Сигнатура КАК Сигнатура ИЗ РегистрСведений.Письма КАК Т ГДЕ НАЧАЛОПЕРИОДА(Т.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -5), ДЕНЬ)";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ПисьмаСодержание.СоздатьМенеджерЗаписи();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ.Сигнатура = Выборка.Сигнатура;
		НЗ.Прочитать();
		Если Не НЗ.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			НЗ.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации("Очистить()", УровеньЖурналаРегистрации.Ошибка, , Выборка.Сигнатура, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Ложь;
		КонецПопытки
	КонецЦикла;
	
	Возврат Истина;
КонецФункции