&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Получение из параметров формы значения для реквизита "ВыборСвободного"
// Если реквизит ВыборСвободного = Истина, то в форме отображаются все телефоны, но выбрать можно
// только тот, у которого нет Владельца
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.ВыборСвободного = ЭтаФорма.Параметры.ВыборСвободного;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СписокВыборЗначения(Элемент,Значение,СтандартнаяОбработка)

// Если реквизит "ВыборСвободного" равен Истине, то проверим является ли выбранный элемент
// свободным. Если нет, то запретим выбор и оставим форму открытой
//-------------------------------------------------------------------------------------------------
	Если (Элемент.ТекущиеДанные <> Неопределено) Тогда
		Запретить = (ЭтаФорма.ВыборСвободного = Истина);
		Запретить = Запретить И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Владелец);

		Если (Запретить = Истина) Тогда
			Предупреждение("Выбранный телефонный номер в настоящее время уже имеет владельца");
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
