&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если отчет открывается в режиме расшифровки основного, то ПриСозданииНаСервере доступны параметры основного отчета, а ПриОткрытии() - уже нет, т.к. не являются ключевыми

	Элементы.Вариант.СписокВыбора.Добавить("ЛояльностьСкоростьОбработкиЖалобДетальный",				"Ремонт. Детальный");   
	Элементы.Вариант.СписокВыбора.Добавить("ЛояльностьСкоростьОбработкиЖалобТочки",					"Ремонт. Группировка точки");  
	Элементы.Вариант.СписокВыбора.Добавить("ЛояльностьСкоростьОбработкиЖалобСводный",				"Сводный");
	
	//Если открываемый отчет - расшифровка основного отчета, установи период из основного отчета
	//-------------------------------------------------------------------------------------------
	Прд = "";
	Доступно = 		Параметры.Свойство("Период", Прд)= Истина
				И 	ЗначениеЗаполнено(Параметры.Период.ДатаОкончания);
	Если Доступно Тогда
		Отчет.Период.ДатаОкончания  = ЭтаФорма.Параметры.Период.ДатаОкончания;
		Отчет.Период.ДатаНачала 	= ЭтаФорма.Параметры.Период.ДатаНачала;	
	КонецЕсли;
	
	//Если открываемый отчет - расшифровка основного отчета, установи вариант как в основном отчете
	//---------------------------------------------------------------------------------------------
	Вар = "";
	Доступно = 		Параметры.Свойство("ТекВариант", Вар) = Истина
				И 	ЗначениеЗаполнено(Параметры.ТекВариант);
	Если Доступно Тогда
		Отчет.ТекВариант = Параметры.ТекВариант;
	Иначе
		//Вариант по умолчанию, при вызове отчета из меню
		//-----------------------------------------------
		Отчет.ТекВариант = "ЛояльностьСкоростьОбработкиЖалобДетальный";
	КонецЕсли;
	
	ВариантОбработкаВыбораНаСервере(Отчет.ТекВариант);	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек(Команда)
	Элементы.ГруппаСтраницы.Видимость = НЕ Элементы.ГруппаСтраницы.Видимость;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Отчет.Период.ДатаОкончания) Тогда
		Отчет.Период.ДатаОкончания 	= Отчет.Период.ДатаОкончания;
		Отчет.Период.ДатаНачала 	= Отчет.Период.ДатаНачала;	
	Иначе
		Отчет.Период.ДатаОкончания 	= КонецДня(НачалоДня(ТекущаяДата())-1);
		Отчет.Период.ДатаНачала		= НачалоМесяца(Отчет.Период.ДатаОкончания);
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.Видимость = Ложь;	
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период; 
	
	Рез = Ждать Диалог.РедактироватьАсинх();
	Отчет.Период = Рез;  
	
	//Обновить отображение периода
	//----------------------------
	Элементы.ВыборПериода.Заголовок = " "+Формат(Отчет.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Отчет.Период.ДатаОкончания, "ДЛФ=Д");
	Элементы.ВидимостьНастроек.Пометка = Элементы.ГруппаСтраницы.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Элементы.ВыборПериода.Заголовок = " "+Формат(Отчет.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Отчет.Период.ДатаОкончания, "ДЛФ=Д");
	Элементы.ВидимостьНастроек.Пометка = Элементы.ГруппаСтраницы.Видимость;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	//КонтрольДоступа.УстановитьОтборПоДоступнымТочкамОформленияВОтчете(Настройки, Отчет.КомпоновщикНастроек);       
	//КонтрольДоступа.УстановитьМакетОформленияОтчета(Настройки, Отчет.КомпоновщикНастроек);
КонецПроцедуры

#Область Расшифровка
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	//Возврат;
	Расш = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	Если Не ЗначениеЗаполнено(Расш.Поле) Тогда
		Возврат
	КонецЕсли;
	
	//Если пользователь пытается открыть список звонков
	//--------------------------------------------------
	Доступно = Истина;
	Доступно = Доступно И Расш.Поле = "Автомобиль";
	Доступно = Доступно И ЗначениеЗаполнено(Расш.Значение);
	Если Доступно Тогда
		СтандартнаяОбработка = Ложь;
		Парам = Новый Структура("Ключ", Расш.Значение);
		ОткрытьФорму("Справочник.НомерныеЭлементы.Форма.ФормаЭлемента", Парам, ЭтаФорма);
		Возврат;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	Перем Рез;
	Рез = Новый Структура("Поле, Значение", " "", """);
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	
	ЗаполнитьЗначенияСвойств(Рез, ЗначениеПоляРасш);
	Возврат Рез;
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#Область Выбор_варианта
&НаСервере
Процедура ВариантОбработкаВыбораНаСервере(ИмяВарианта)
	Результат.Очистить();
	
	Об 							= РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных 		= РеквизитФормыВЗначение("Отчет").ПолучитьСКД(ИмяВарианта, "C:\Users\Public\Documents\"+ИмяВарианта+".xml");
	АдресВремХран				= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ИсточникДоступныхНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВремХран);
	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВариантОбработкаВыбораНаСервере(ВыбранноеЗначение)
КонецПроцедуры
#КонецОбласти




 
