Функция УстановиИдентификаторСтроки(ИсходнаяСтрока, ОписываемыйОбъект="", ПолнаяСтрока = "") Экспорт
	
	ЗначениеПоУмолчанию = Справочники.ИдентификаторыСтрокИнтернетЗаявок.ПустаяСсылка();
	
	Если ТипЗнч(ИсходнаяСтрока)<> Тип("Строка") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
		 
	 МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ИсходнаяСтрока);
	 
	 Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
		 Возврат ЗначениеПоУмолчанию;
	 КонецЕсли;
		
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрокИнтернетЗаявок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.МодифицированнаяСтрока ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0][0];
	Иначе
		НоваяЗапись = Справочники.ИдентификаторыСтрокИнтернетЗаявок.СоздатьЭлемент();
	 	НоваяЗапись.Наименование			=	ИсходнаяСтрока;
		НоваяЗапись.МодифицированнаяСтрока	=	МодифицированнаяСтрока;
		НоваяЗапись.ОписываемыйОбъект		=	ОписываемыйОбъект;
		
		Если СтрДлина(ИсходнаяСтрока)>150 И ПолнаяСтрока <>"" Тогда
			НоваяЗапись.ИспользоватьПолнуюСтроку = Истина;
		КонецЕсли;
		
		Если ПолнаяСтрока="" Тогда
			НоваяЗапись.ПолнаяСтрока		=	ИсходнаяСтрока;
		Иначе
			НоваяЗапись.ПолнаяСтрока		=	ПолнаяСтрока;
		КонецЕсли;
		
	 	НоваяЗапись.Записать();
		Возврат НоваяЗапись.Ссылка;
	КонецЕсли;
	
КонецФункции
