Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 						Период.ДатаНачала);
	ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 					Период.ДатаОкончания);
	ПараметрыДанных.УстановитьЗначениеПараметра("_1йБазовыйВопросЛояльности",	Анкета._1йБазовыйВопросЛояльности());	
	ПараметрыДанных.УстановитьЗначениеПараметра("_2йБазовыйВопросЛояльности",	Анкета._2йБазовыйВопросЛояльности());
	ПараметрыДанных.УстановитьЗначениеПараметра("_3йБазовыйВопросЛояльности",	Анкета._3йБазовыйВопросЛояльности());
	ПараметрыДанных.УстановитьЗначениеПараметра("_4йБазовыйВопросЛояльности",	Анкета._4йБазовыйВопросЛояльности());
	ПараметрыДанных.УстановитьЗначениеПараметра("_1",							Анкета._1());
	ПараметрыДанных.УстановитьЗначениеПараметра("_2",							Анкета._2());
	ПараметрыДанных.УстановитьЗначениеПараметра("_3",							Анкета._3());

	Для Каждого Парам Из ПараметрыДанных.Элементы Цикл
		Если Не ЗначениеЗаполнено(Парам.Значение) Тогда
			Сообщить("Не заполнен параметр: "+Парам.Параметр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

