
Процедура ПриЗаписи(Отказ, Замещение)
	//Если число открытых задач в минуту больше нормы, то возможно это спам, поэтому блокируем запись новых задач
	// Поставим норму 60
	
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос();
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.ЗадачиИнтернетЗаявки КАК ЗадачиИнтернетЗаявки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЗадачиИнтернетЗаявки.ДатаПостановки, МИНУТА) = НАЧАЛОПЕРИОДА(&ТекДата, МИНУТА)
	|	И ЗадачиИнтернетЗаявки.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ЗадачиИнтернетЗаявки.Заблокирована = ЛОЖЬ";
			
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	КоличествоЗаписей  = РезультатЗапроса.Выгрузить()[0][0];
	Если КоличествоЗаписей > 60 Тогда
		ЗаписьЖурналаРегистрации("ПриЗаписи()", УровеньЖурналаРегистрации.Ошибка, , "Количество записей="+КоличествоЗаписей, "Превышено число открытых задач");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
КонецПроцедуры
