Функция Загрузить(Сигнатура,  Дата, Регион, Инициатор, АбонентВнешний, ДатаОтправки='00010101000000', АдресОтправителя = "", АдресПолучателя="", ИмяПользователяПочтовогоЯщика="", Свойство1="") Экспорт
	
	Доступно = 		ТипЗнч(Сигнатура) = Тип("Строка")
				И 	ЗначениеЗаполнено(Сигнатура)
				И 	ТипЗнч(Дата)							= Тип("Дата")
				И 	ТипЗнч(Регион) 							= Тип("СправочникСсылка.Страны")
				И 	ТипЗнч(Инициатор) 						= Тип("Строка")
				И 	ТипЗнч(АбонентВнешний) 					= Тип("Строка")
				И 	ТипЗнч(ДатаОтправки) 					= Тип("Дата")
				И 	ТипЗнч(АдресОтправителя) 				= Тип("Строка")
				И 	ТипЗнч(АдресПолучателя) 				= Тип("Строка")
	 			И 	ТипЗнч(ИмяПользователяПочтовогоЯщика)	= Тип("Строка")	
				И 	ТипЗнч(Свойство1) 						= Тип("Строка");

	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ = РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();
	
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ.Сигнатура 						= Сигнатура;
	НЗ.Дата 							= Дата;
	НЗ.Регион 							= Регион;
	НЗ.Инициатор 						= Инициатор;
	НЗ.АбонентВнешний 					= Конвертация.ТелефонВнешнийНормализовать(АбонентВнешний);
	НЗ.ДатаОтправки  					= ДатаОтправки;
	НЗ.АдресОтправителя 				= АдресОтправителя;
	НЗ.АдресПолучателя					= АдресПолучателя;
	НЗ.ИмяПользователяПочтовогоЯщика 	= ИмяПользователяПочтовогоЯщика;
	НЗ.Свойство1						= Свойство1;
	
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи",УровеньЖурналаРегистрации.Ошибка, ,СтрШаблон("Сигнатура = %1, Дата = %2, Регион = %3, Инициатор = %4, АбонентВнешний = %5", Сигнатура, Дата, Регион, Инициатор, АбонентВнешний), ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
 	
КонецФункции

Функция ПолучиДатуОтправления(MessageID) Экспорт
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = "";
	
	Достуно =  ТипЗнч(MessageID) = Тип("Строка");
	Доступно = Доступно И СтрДлина(MessageID)>0;
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ = РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = MessageID;
	НЗ.Прочитать();
	
	Если НЕ НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	Возврат НЗ.ДатаОтправки
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.Письма.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.Письма, , ОписаниеОшибки());
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
		
КонецФункции
