Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СКД = ПолучитьМакет("ОсновнаяСКД");	
	
	СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);
КонецПроцедуры

Процедура СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Перем Группа;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Клики КАК Clicks,
	|	Т.Стоимость КАК Cost,
	|	Т.AdGroupName КАК AdGroupName,
	|	Т.Impressions КАК Impressions,
	|	Т.AvgImpressionPosition КАК AvgImpressionPosition,
	|	Т.AvgTrafficVolume КАК AvgTrafficVolume,
	|	Т.AvgClickPosition КАК AvgClickPosition,
	|	Т.Conversions КАК Conversions
	|ИЗ
	|	РегистрСведений.ИнтернетЗаявкиСтоимость КАК Т
	|ГДЕ
	|	Т.ПериодЗаявки МЕЖДУ &Начало И &Окончание";
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТЗ.Колонки.Добавить("Группа", 				Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("AvgCpc", 				Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ConversionRate", 		Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("CostPerConversion", 	Новый ОписаниеТипов("Число"));
	
	Для Каждого i Из ТЗ Цикл
		
		Группа = i.AdGroupName;
		Позиция_ = СтрНайти(Группа, "_");
		Если Позиция_ > 0 Тогда
			Группа = Лев(Группа,Позиция_ - 1);	 
		КонецЕсли;
		 i.Группа = Группа;
		 
		 i.AvgCpc = ?(i.Clicks>0,  i.Cost/i.Clicks, 0);
	 КонецЦикла;
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры

