
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
		Пер = Новый СтандартныйПериод();
		Пер.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод;
		Пер.ДатаНачала = НачалоДня(ТекущаяДата())-1;
		Пер.ДатаОкончания=КонецДня(Пер.ДатаНачала);
		ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Пер);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
