&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Получим все роли существующие в конфигурации
// Сразу пометим роли, которые уже присутствуют в переданном СпискеРолей пользователя
//-------------------------------------------------------------------------------------------------
	Для Каждого ТекСтрока Из Метаданные.Роли Цикл
		Пометка = (Найти(ЭтаФорма.Параметры.СписокРолей,ВРег(СокрЛП(ТекСтрока.Имя))) > 0);
		ЭтаФорма.Список.Добавить(СокрЛП(ТекСтрока.Имя),СокрЛП(ТекСтрока.Синоним),Пометка);
	КонецЦикла;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура Применить(Команда)

// Сформируем строку из помеченных ролей и вернем ее в вызывающую форму
//-------------------------------------------------------------------------------------------------
	Ответ = "";

	Для Каждого ТекСтрока Из ЭтаФорма.Список Цикл
		Если (ТекСтрока.Пометка = Истина) Тогда
			Ответ = Ответ + ?(ЗначениеЗаполнено(Ответ),", ","");
			Ответ = Ответ + СокрЛП(ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;

	ЭтаФорма.Закрыть(Ответ);
КонецПроцедуры
