Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Будние дни: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.БудРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БудНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БудКон"));
	ИначеЕсли (ЭтотОбъект.БудКон <= ЭтотОбъект.БудНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика будних дней");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Суббота: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.СубРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СубНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СубКон"));
	ИначеЕсли (ЭтотОбъект.СубКон <= ЭтотОбъект.СубНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика субботы");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Воскресенье: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ВскРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВскНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВскКон"));
	ИначеЕсли (ЭтотОбъект.ВскКон <= ЭтотОбъект.ВскНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика воскресенья");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Нормализуем некоторые реквизиты
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);

// Проверим на дублирование по наименованию (сквозная проверка)
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	COUNT(*) AS Всего
	|FROM	Справочник.ГрафикиРаботы
	|WHERE	(Ссылка <> &ЭтотОбъект) И (Наименование = &Наименование)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЭтотОбъект",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
	Результат = Запрос.Выполнить().Выбрать();

	Если (Результат.Следующий()) И (Результат.Всего > 0) Тогда
		ТекстСообщения = "Элемент с наименованием """ + СокрЛП(ЭтотОбъект.Наименование) + """ уже присутствует в справочнике";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
