

Функция ШаблонURL1Метод1(Запрос)
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ЗаписьЖурналаРегистрации("ШаблонURL1Метод1", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("ТелоЗапроса = %1, БазовыйURL = %2, ОтносительныйURL = %3", ТелоЗапроса, Запрос.БазовыйURL, Запрос.ОтносительныйURL), "Вызов http-сервиса http://mainappl.main.luidorauto.ru/sys_agr/hs/webhooks/callback/v1");
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	ТелоОтвета = "Webserver answer";
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Если СтрДлина(ТелоЗапроса)<=4 Тогда
		ТелоОтвета = "query is not correct";
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецЕсли;
	
	//Отдельная обработка для сайтов Форд
	//------------------------------------
	Доступно = Истина;
	Доступно = Доступно И (СтрНайти(ТелоЗапроса, "5f5b56ffbc46f80001d5a8d4") Или СтрНайти(ТелоЗапроса, "5f5b574519635b0001b5df97"));
	Если Доступно Тогда
		Возврат ЗаявкаФорд(ТелоЗапроса);
	КонецЕсли;
	
	Телефон = "";
	Сайт	= "";
	ДопИнфо = "";
	
	_ТелоЗапроса = СтрЗаменить(ТелоЗапроса, Символ(182), "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, Символы.ПС, "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, Символы.ВК, "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, "<p>", "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, "</p>", "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, "<P>", "");
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, "</P>", "");    
	
	//Исправление ошибки с сайта (вход в 1С из файла chery-tradedealer.php
	//---------------------------------------------------------------------
	_ТелоЗапроса = СтрЗаменить(_ТелоЗапроса, "[mailDataTemplate] => Текущий автомобиль: %client_current_car%<br>Год выпуска: %vehicle_production_year%", "");    
	
	ДопИнфо = _ТелоЗапроса;

	Чт = Новый ЧтениеXML();
	
	Чт.УстановитьСтроку(_ТелоЗапроса);
	Попытка
		п = ФабрикаXDTO.ПрочитатьXML(Чт);
	Исключение
		ТелоОтвета = "errror: XDTOFactory.ReadJSON";
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецПопытки;

	Попытка
		Телефон 	= п.phone; 
		Сайт  		= п.site;
	Исключение
		ТелоОтвета = "errror: bad json for phone and site";
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецПопытки;
	
	//Для webjack (facebook, vk, tiktok, myTarget)
	//---------------------------------------------
	Поз_ = СтрНайти(Сайт, "_");		// позиция символа "_"
	Если Поз_ > 0 Тогда
		Сайт = Лев(Сайт, Поз_ - 1);
	КонецЕсли;

	ЗаписьЖурналаРегистрации("ШаблонURL1Метод1", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Телефон=%1", Телефон), "Вызов http-сервиса 2");

	Рез = "empty";
	Доступно = 		ТипЗнч(Телефон) = Тип("Строка")
				И   ЗначениеЗаполнено(Телефон);
		Если Доступно Тогда
					
		//Создать интернет-заявку
		//=======================================================
		Рез = ВэбСервисы.ИнтернетЗаявка(Телефон, Сайт, ДопИнфо);
		ТелоОтвета = Рез;
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецЕсли;
	
	//Если оказались здесь, значит телефон не в поле phone не указан. 
	//Возможно это форма с сайте cherry-luidor.ru, сделанная Ковалевым, в ней вэбхук coshelev_cherry.php 
	//высылает следующее:
	//<?xml version="1.0" encoding="UTF-8" standalone="yes"?> <request> <phone></phone>  <site>chery-luidor.ru</site> <extra>Array¶(¶    [phone] => +1 (111) 111-11-11¶    [tranid] => 3529889:1887287081¶    [formid] => form307659092¶    [utm_source] => yandex_atdrv¶    [utm_medium] => cpc¶    [utm_campaign] => chery|search|all|58672899¶    [utm_term] => 25533774756_продажа chery¶    [utm_content] => yd_atdrv:58672899_gb:4437698890_ad:10179132822_ph:25533774756_st:search_pt:premium_p:1_s:none_dt:desktop_reg:Казань_apt:none¶)¶</extra> </request>
	//т.е. тело post-запроса имеет вид:
	//Array¶(¶    [phone] => +1 (111) 111-11-11¶    [tranid] => 3529889:1887287081¶    [formid] => form307659092¶    [utm_source] => yandex_atdrv¶    [utm_medium] => cpc¶    [utm_campaign] => chery|search|all|58672899¶    [utm_term] => 25533774756_продажа chery¶    [utm_content] => yd_atdrv:58672899_gb:4437698890_ad:10179132822_ph:25533774756_st:search_pt:premium_p:1_s:none_dt:desktop_reg:Казань_apt:none¶)¶
	НачалоТел		= СтрНайти(_ТелоЗапроса, 	"[phone]");
	ОкончаниеТел 	= СтрНайти(_ТелоЗапроса,	"[tranid]");
	
	Доступно = 		Сайт = "chery-luidor.ru"
				И 	СтрНайти(_ТелоЗапроса, "Array")>0
	            И	НачалоТел > 0;
	Если Доступно Тогда
		//Получи подстроку " +1 (111) 111-11-11    " из строки "[phone] => +1 (111) 111-11-11¶    [tranid] => 3529889:1887287081"			
		Телефон = Сред(_ТелоЗапроса, НачалоТел+10, 20);
		НеЦифры = СтрРазделить(Телефон,"0123456789",Ложь);
		Цифры	= СтрРазделить(Телефон, СтрСоединить(НеЦифры, ""), Ложь);
		Телефон = СтрСоединить(Цифры, "");
		
		Рез 	= ВэбСервисы.ИнтернетЗаявка(Телефон, Сайт, ДопИнфо);
		ТелоОтвета = Рез;
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецЕсли;			
	
КонецФункции

Функция ЗаявкаФорд(ТелоЗапроса)
		
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	ТелоОтвета = "Webserver answer";
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Чт = Новый ЧтениеJSON();
	Чт.УстановитьСтроку(ТелоЗапроса);
	Попытка
		Об = ФабрикаXDTO.ПрочитатьJSON(Чт);
	Исключение
		ТелоОтвета = "errror: XDTOFactory.ReadJSON";
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецПопытки;
	
	Попытка
		phone 	= Об.data.attributes.fields.phone;
		site_id = Об.data.attributes.site_id;
		//subject = Об.data.attributes.fields.subject;  //временно закоментарил, т.к. в запросе на тест-драйв в json нет этого поля
	Исключение
	    ТелоОтвета = "errror: bad json for phone, site, subject";
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		Возврат Ответ;
	КонецПопытки;
	
	Телефон = "";
	Сайт	= "";
	ДопИнфо = "";

	Телефон = phone;	
	Если site_id ="5f5b56ffbc46f80001d5a8d4" Тогда
		Сайт = "kazan.ford-luidor.ru";
	ИначеЕсли site_id="5f5b574519635b0001b5df97" Тогда
		Сайт = "ufa.ford-luidor.ru";
	Иначе
		Сайт	= site_id;	
	КонецЕсли;
	//ДопИнфо = subject;								//временно закоментарил, т.к. в запросе на тест-драйв в json нет этого поля
		
	Рез = "empty";
	Если ЗначениеЗаполнено(Телефон) Тогда
		Рез = ВэбСервисы.ИнтернетЗаявка(Телефон, Сайт, ДопИнфо);
	КонецЕсли;
	
	ТелоОтвета = Рез;
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;

КонецФункции

Функция ШаблонURL2Метод1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("tested ok");
	Возврат Ответ;
КонецФункции

Функция ШаблонДляПроизвольныхДанныхPOSTМетод1(Запрос)       
		
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЗаписьЖурналаРегистрации("ШаблонДляПроизвольныхДанныхPOST", УровеньЖурналаРегистрации.Ошибка, , ТелоЗапроса, "Вызов http-сервиса http://mainappl.main.luidorauto.ru/sys_agr/hs/webhooks/anypost/v1");

	Если Не ЗначениеЗаполнено(ТелоЗапроса) Тогда  	//	"error: request without body"
		Ответ = Новый HTTPСервисОтвет(200);  
	    Возврат Ответ;
	КонецЕсли; 
	
	Возврат ВэбСервисы.ПроизвольныеДанныеPost(ТелоЗапроса);
	
КонецФункции


Функция ЛояльностьАвтосалоновDoPost(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
