&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Вариант.СписокВыбора.Добавить("Сводный",		"Сводный общий");
	Элементы.Вариант.СписокВыбора.Добавить("СводныйГАЗ",	"Сводный ГАЗ");
	Элементы.Вариант.СписокВыбора.Добавить("СводныйКАМАЗ",	"Сводный КАМАЗ");
	Элементы.Вариант.СписокВыбора.Добавить("СводныйУАЗ",	"Сводный УАЗ");
	Элементы.Вариант.СписокВыбора.Добавить("СводныйChery",	"Сводный Chery");
	Элементы.Вариант.СписокВыбора.Добавить("СводныйFord",	"Сводный Ford");
	Элементы.Вариант.СписокВыбора.Добавить("Детальный",		"Детальный");
	
	//Если открываемый отчет - расшифровка основного отчета, установи вариант как в основном отчете
	//---------------------------------------------------------------------------------------------
	Вар = "";
	Доступно = Истина;
	Доступно = Доступно И Параметры.Свойство("ТекВариант", Вар) = Истина;
	Доступно = Доступно И ЗначениеЗаполнено(Параметры.ТекВариант);
	Если Доступно Тогда
		Отчет.ТекВариант = Параметры.ТекВариант;
	Иначе
		//Вариант по умолчанию, при вызове отчета из меню
		//-----------------------------------------------
		Отчет.ТекВариант = "Сводный";
	КонецЕсли;
	
	ВариантОбработкаВыбораНаСервере(Отчет.ТекВариант);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек(Команда)
	Элементы.ГруппаСтраницы.Видимость = НЕ Элементы.ГруппаСтраницы.Видимость;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецМесяца(Отчет.Период.ДатаНачала);
	
	Элементы.ГруппаСтраницы.Видимость = Ложь;
	
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;
	
	Оп = Новый ОписаниеОповещения("НаЗакрытиеДиалогаПериода", ЭтаФорма);
	Диалог.Показать(Оп);
КонецПроцедуры

&НаКлиенте
Процедура НаЗакрытиеДиалогаПериода(Парам1, Парам2) Экспорт
	Если Парам1 = Неопределено Тогда
		Возврат
	КонецЕсли;
	Отчет.Период = Парам1;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Элементы.ВыборПериода.Заголовок = " "+Формат(Отчет.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Отчет.Период.ДатаОкончания, "ДЛФ=Д");
	Элементы.ВидимостьНастроек.Пометка = Элементы.ГруппаСтраницы.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	рез = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	Если Не ЗначениеЗаполнено(Рез) Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Рез)<>Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Рез, "#", , 2) =0 Тогда
		Возврат
	КонецЕсли;
	
	Парам = Новый Структура();
	Парам.Вставить("Сигнатура", рез);
	Если Лев(Рез,1) = "0" Тогда
		ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение";
	Иначе
		ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение";
	КонецЕсли;
	ОткрытьФорму(ИмяОткрываемойФормы, Парам, ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;
КонецФункции

#Область Выбор_Варианта
&НаСервере
Процедура ВариантОбработкаВыбораНаСервере(ИмяВарианта)
	Результат.Очистить();
	
	_ИмяВарианта = ИмяВарианта;
	Если ИмяВарианта = "СводныйГАЗ" Или ИмяВарианта = "СводныйКАМАЗ" Или ИмяВарианта = "СводныйУАЗ" Или ИмяВарианта = "СводныйChery" Или ИмяВарианта = "СводныйFord"   Тогда
		_ИмяВарианта = "Сводный";
	КонецЕсли;
	
	Об = 	РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьСКД(_ИмяВарианта , "C:\Users\Public\Documents\"+_ИмяВарианта +".xml");
	АдресВремХран	=  ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);

	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВремХран);
	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура ТекВариантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВариантОбработкаВыбораНаСервере(ВыбранноеЗначение)
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры





 
