&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если элемент не является предопределенной группой "Россия", то скроем группу "ГруппаПравила"
//-------------------------------------------------------------------------------------------------
	Доступно = (Объект.Ссылка = Справочники.Страны.Россия);
	Элементы.ГруппаПравила.Видимость = Доступно;
	НомернойПланСформировать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Заголовок формы
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Объект.Наименование)) Тогда
		ЭтаФорма.Заголовок = "Страна: " + СокрЛП(Объект.Наименование);
	Иначе
		ЭтаФорма.Заголовок = "Новая страна";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
	НомернойПланСформировать();
	ОбновлениеОтображения();
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаСервере
Процедура НомернойПланСформировать()

// Настроим фильтрацию для списка "НомернойПлан"
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.НомернойПлан.Параметры.УстановитьЗначениеПараметра("ЭтотОбъект",Объект.Ссылка);
	Элементы.НомернойПлан.Обновить();
КонецПроцедуры
