&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыбраннаяДата  	= ТекущаяДата();
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("CurrentDate", 	ВыбраннаяДата);
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДеньНедели", 		Строка(ДеньНедели(ВыбраннаяДата)));
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПОДСТРОКА(Код, 2,ДлинаСтроки(Код)-1) ИЗ Справочник.ТелВнешние ГДЕ Архивный = ИСТИНА");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("АрхивныеКаналы",РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));	
	КонецЕсли;
 КонецПроцедуры

#Область Редактировать_расписание
&НаКлиенте
Процедура СпВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = ЭтаФорма.Элементы.Сп.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.schedules_names_restricted <> 0 Тогда
		Сообщить("Это расписание настраивать нельзя!");
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("РедактированиеРасписания_Окончание", ЭтаФорма, "");
	Парам = Новый Структура();
	Парам.Вставить("Ключ", ТекДанные.incoming_routes_Ссылка);
	ОткрытьФорму( "Обработка.НастройкаРасписанияРаботыКаналов.Форма.ФормаНастройкиРасписания", Парам, ЭтаФорма,,,,Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписания_Окончание(Парам1, Парам2) Экспорт
	Элементы.Сп.Обновить();
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ВыбраннаяДатаПриИзменении(Элемент)
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("CurrentDate", ЭтаФорма.ВыбраннаяДата);
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДеньНедели", 	Строка(ДеньНедели(ВыбраннаяДата)));
КонецПроцедуры
