Функция Закрыть(Сигнатура, Окончание) Экспорт
	// Окончание равно дате закрытия последней задачи проверки
	
	Данные = "Сигнатура = "+Сигнатура+"; Окончание = "+Окончание;	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Окончание) = Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно и ЗначениеЗаполнено(Окончание);
	
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ: ошибка в аргументах", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные);
		Возврат Ложь;
	КонецЕсли;
	
	Зап = РегистрыСведений.ГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Сигнатура = Сигнатура;
	Зап.Прочитать();
	Если Зап.Выбран()=Ложь Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ: не выбрана запись", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные);
		Возврат Ложь;
	КонецЕсли;
	Зап.Окончание = Окончание;
	Попытка
		Зап.Записать();
		Результат = Истина;
	Исключение
		Данные = "Сигнатура = "+Сигнатура+"; Окончание = "+Окончание;
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные, ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;
	Возврат Результат;	
КонецФункции