Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ЭтотОбъект[0].Сигнатура 		= "gz_"+Строка(Новый УникальныйИдентификатор());		
	ЭтотОбъект[0].Начало	    	= ТекущаяДата();
	ЭтотОбъект[0].ТочкаРазмещения	= ПараметрыСеанса.ТекущийПользователь.ТочкаРазмещения.Родитель;	
	ЭтотОбъект[0].Автор				= ПараметрыСеанса.ТекущийПользователь;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Доступно = Истина;
	Доступно = Доступно И ЭтотОбъект.Количество()>0;
	Если Доступно = Ложь Тогда
		Возврат;
	КонецЕсли;
		
	Доступно = Истина;
	Доступно = Доступно И (ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний) Или ЗначениеЗаполнено(ЭтотОбъект[0].Почта));	
	Если Доступно = Ложь Тогда
		Сообщить("Почта или телефон должны быть обязательно заполнены");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Задана почта, но адрес не верен
	//--------------------------------
	Доступно = Истина;
	Доступно = Доступно И Не ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтотОбъект[0].Почта);
	Если Доступно = Истина Тогда
		Доступно = Истина;
		Доступно = Доступно И СтрНайти(ЭтотОбъект[0].Почта, "@")>0;
		Доступно = Доступно И СтрДлина(ЭтотОбъект[0].Почта)>6;
		Если Доступно = Ложь Тогда
			Сообщить("Ошибка в адресе почты");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	ЭтотОбъект.ПроверитьЗаполнение();
	
	Если ЭтотОбъект.Количество()>0 Тогда
		ЭтоНовый = Не ЗначениеЗаполнено(ЭтотОбъект[0].Окончание);
		
		Если ЭтоНовый = Истина Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].Начало) Тогда
				ЭтотОбъект[0].Начало 		 	= ТекущаяДата();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний) Тогда 
				ЭтотОбъект[0].АбонентВнешний 	= Конвертация.ТелефонВнешнийНормализовать(ЭтотОбъект[0].АбонентВнешний); 
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].ТочкаРазмещения) Тогда
				ЭтотОбъект[0].ТочкаРазмещения 	= ПараметрыСеанса.ТекущийПользователь.ТочкаРазмещения.Родитель; 
			КонецЕсли;
						
			Рез = СоздатьЗадачуЗвонить(ЭтотОбъект[0].АбонентВнешний, ЭтотОбъект[0].Сигнатура, Справочники.Роли.ОператорКонтактЦентра, ЭтотОбъект[0].Начало, ЭтотОбъект[0].Почта); 
			Если Рез <> "ок" Тогда
				Сообщить("Рез");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьЗадачуЗвонить(Телефон, Сигнатура, Роль, Начало, Почта)
	Данные = "Телефон = "+Телефон+"; Сигнатура = "+Сигнатура+"; Роль = "+Роль+"; Начало = "+Начало+"; Почта = "+Почта;
	Результат = "Ошибка";

	//Если в поле телефон записаны не цифры (например слово "НЕТ") и указана почта, тогда используй почту как ключ
	//-------------------------------------------------------------------------------------------------------------
	Доступно = 	  ЗначениеЗаполнено(Телефон)
				И КонвертацияСервер.ЭтоТолькоЦифры(Телефон) = Ложь
				И ЗначениеЗаполнено(Почта);                     	
	Если Доступно Тогда
		Телефон = Почта;		
	КонецЕсли;

	//Если телефон не заполнен Заполнен входящий параметр "Почта" фиксируем его в реквизите Телефон задачи
	//-----------------------------------------------------------------------------------------------------
	Доступно = 		Не ЗначениеЗаполнено(Телефон)
				И 	ЗначениеЗаполнено(Почта);
	Если Доступно Тогда
		Телефон = Почта;
	КонецЕсли;
		
	Зап = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Телефон 		= Телефон;
	Зап.АдресацияРоль 	= Справочники.Роли.ОператорКонтактЦентра;
	Зап.ДатаПостановки 	= Начало;
	Зап.Сигнатура		= Сигнатура;
	Попытка 
		Зап.Записать();
		Результат = "ок";
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка записи задачи", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Возврат "Ошибка: задача не создана";
	КонецПопытки;
	Возврат "ок";
КонецФункции





