Функция Добавить(КонтрагентТел, СотрудникТел, КонтактноеЛицо="", Контрагент="", Сотрудник, Сотрудник1="", Сотрудник1Тел="", Сотрудник2="", Сотрудник2Тел="") Экспорт
	
	Данные =  "КонтрагентТел = "+КонтрагентТел+"; СотрудникТел = "+СотрудникТел+"; КонтактноеЛицо ="+КонтактноеЛицо+"; Контрагент = "+Контрагент+"; Сотрудник = "+Сотрудник + "; Сотрудник1 = "+Сотрудник1;
	
	ЗначениеПоУмолчанию = Ложь;
	Доступно = ТипЗнч(КонтрагентТел) 					= Тип("Строка");
	Доступно = Доступно И ТипЗнч(СотрудникТел) 			= Тип("Строка");
	
	Доступно = Доступно И ТипЗнч(КонтактноеЛицо) 		= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Контрагент) 			= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Сотрудник) 			= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Сотрудник1) 			= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Сотрудник1Тел)			= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Сотрудник2) 			= Тип("Строка");
	Доступно = Доступно И ТИпЗнч(Сотрудник2Тел)		 	= Тип("Строка");
	
	Доступно = Доступно И ЗначениеЗаполнено(КонтрагентТел);
	Доступно = Доступно И ЗначениеЗаполнено(СотрудникТел);

	Если Не Доступно Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ТелефонныйНомер = Конвертация.ТелефонВнешнийНормализовать(КонтрагентТел);
	
	МЗ = РегистрыСведений.КонтрагентыВСотрудники.СоздатьМенеджерЗаписи();
	МЗ.КонтрагентТел = ТелефонныйНомер;
	МЗ.СотрудникТел  = СотрудникТел;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		
		Доступно = МЗ.КонтактноеЛицо 			= КонтактноеЛицо;
		Доступно = Доступно И МЗ.Контрагент 	= Контрагент;
		Доступно = Доступно И МЗ.Сотрудник 		= Сотрудник;
		Доступно = Доступно И МЗ.Сотрудник1 	= Сотрудник1;
		Доступно = Доступно И МЗ.Сотрудник1Тел 	= Сотрудник1Тел;
		Доступно = Доступно И МЗ.Сотрудник2 	= Сотрудник2;
		Доступно = Доступно И МЗ.Сотрудник2Тел 	= Сотрудник2Тел;

		
		Если Не Доступно Тогда
			МЗ.КонтрагентТел			= КонтрагентТел;
			МЗ.СотрудникТел				= СотрудникТел;

			МЗ.КонтактноеЛицо 			= КонтактноеЛицо;
			МЗ.Контрагент 				= Контрагент;
			МЗ.Сотрудник 				= Сотрудник;
			МЗ.Сотрудник1 				= Сотрудник1;
			МЗ.Сотрудник1Тел			= Сотрудник1Тел;
			МЗ.Сотрудник2				= Сотрудник2;
			МЗ.Сотрудник2Тел			= Сотрудник2Тел;
		КонецЕсли;
		
	Иначе
		МЗ.КонтрагентТел			= КонтрагентТел;
		МЗ.СотрудникТел				= СотрудникТел;

		МЗ.КонтактноеЛицо 			= КонтактноеЛицо;
		МЗ.Контрагент 				= Контрагент;
		МЗ.Сотрудник 				= Сотрудник;
		МЗ.Сотрудник1 				= Сотрудник1;
		МЗ.Сотрудник1Тел			= Сотрудник1Тел;
		МЗ.Сотрудник2				= Сотрудник2;
		МЗ.Сотрудник2Тел			= Сотрудник2Тел;
	КонецЕсли;
	
	Попытка
		МЗ.Записать();	
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.КонтрагентыВСотрудники,Данные, Комментарий);
	КонецПопытки
	
КонецФункции