Функция СрезПоследних(Период, ЗначенияКлючей) Экспорт
	
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ТочкиЦелевые"));
	ТЗ.Колонки.Добавить("КлючИсточник", Новый ОписаниеТипов("Строка"));
	
	ЗначениеПоУмолчанию = ТЗ;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ключи.Ссылка КАК Ссылка,
	|	Ключи.Период КАК Период,
	|	Ключи.ЗначениеКлюча КАК ЗначениеКлюча
	|ПОМЕСТИТЬ ВТ01_Детальные
	|ИЗ
	|	Справочник.ТочкиЦелевые.КлючиВИсточникахДанных КАК Ключи
	|ГДЕ
	|	Ключи.Период <= &Период
	|	И Ключи.ЗначениеКлюча В(&ЗначенияКлючей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ01_Детальные.Ссылка КАК Ссылка,
	|	ВТ01_Детальные.ЗначениеКлюча КАК ЗначениеКлюча,
	|	МАКСИМУМ(ВТ01_Детальные.Период) КАК Период
	|ИЗ
	|	ВТ01_Детальные КАК ВТ01_Детальные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ01_Детальные.Ссылка,
	|	ВТ01_Детальные.ЗначениеКлюча";
	
	Если Не ЗначениеЗаполнено(ЗначенияКлючей) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ключи.ЗначениеКлюча В(&ЗначенияКлючей)", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("ЗначенияКлючей", ЗначенияКлючей);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Ссылка = Выборка.Ссылка;
		НоваяСтрока.КлючИсточник = Выборка.ЗначениеКлюча;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции