Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Линейный элемент обязательно должен принадлежать группе
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Ложь) Тогда
		ЭтотОбъект.КодПроекта = ВРег(СокрЛП(Родитель.КодПроекта));
		ПроверяемыеРеквизиты.Добавить("Родитель");
	КонецЕсли;

// Нормализуем некоторые реквизиты
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);
	ЭтотОбъект.КодПроекта = ВРег(СокрЛП(ЭтотОбъект.КодПроекта));

// Проверим на дублирование по наименованию
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	COUNT(*) AS Всего
	|FROM	Справочник.ТочкиЦелевые
	|WHERE	(Ссылка <> &ЭтотОбъект) И (Наименование = &Наименование)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЭтотОбъект",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
	Результат = Запрос.Выполнить().Выбрать();

	Если (Результат.Следующий()) И (Результат.Всего > 0) Тогда
		ТекстСообщения = "Элемент с наименованием """ + СокрЛП(ЭтотОбъект.Наименование) + """ уже присутствует в справочнике";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

// Если текущий объект является группой, то перепроведем все подчиненные элементы
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ЭтоГруппа = Истина) Тогда
		Выборка = Справочники.ТочкиЦелевые.Выбрать(ЭтотОбъект.Ссылка);

		Пока (Выборка.Следующий()) Цикл
			Выборка.ПолучитьОбъект().Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
