&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Сформируем сведения о телефоне и конвергентной паре
//-------------------------------------------------------------------------------------------------
	ПараФМС = "";
	Элементы.НадписьТелефон.Заголовок = "Агент: " + СокрЛП(Запись.Телефон) + ПараФМС;

// Сформируем сведения о владельце номера
//-------------------------------------------------------------------------------------------------
	ВладСсылка = Телефония.ВладелецПолучить(Запись.Телефон);

	Если (ЗначениеЗаполнено(ВладСсылка)) Тогда
		Темп = СокрЛП(ВладСсылка) + ", " + СокрЛП(ВладСсылка.ТочкаРазмещения);
		Элементы.НадписьВладелец.ЦветТекста = Новый Цвет(0,51,102);
		Элементы.НадписьВладелец.Заголовок = СокрЛП(Темп);
		Элементы.НадписьВладелец.Гиперссылка = Истина;
	КонецЕсли;

// Получим список системных очередей, в которых зарегистрирован данный телефон в качестве агента
//-------------------------------------------------------------------------------------------------
	МассивОчередей = ОчередиАгенты.ОчередиПолучитьПоАгенту(Запись.Телефон);

	Если (ТипЗнч(МассивОчередей) = Тип("Массив")) Тогда
		Темп = "Является агентом очередей (" + СокрЛП(МассивОчередей.Количество()) + ")";
		Элементы.НадписьОчереди.ЦветТекста = Новый Цвет(0,51,102);
		Элементы.НадписьОчереди.Заголовок = СокрЛП(Темп);
		Элементы.НадписьОчереди.Гиперссылка = Истина;
	КонецЕсли;

// Отображение элементов группы с параметрами блокировки
//-------------------------------------------------------------------------------------------------
	Доступно = (Запись.КонБлокировки > ТекущаяДата());
	ЦветФона = ?(Доступно,Новый Цвет(255,255,153),ЦветаСтиля.ЦветФонаФормы);
	Элементы.ГруппаБлокировка.ЦветФона = ЦветФона;

	Если (Доступно = Ложь) Тогда
		Запись.ТекстБлокировки = Неопределено;
		Запись.НачБлокировки = Неопределено;
		Запись.КонБлокировки = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Запись.Телефон,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Истина);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура НадписьОчередиНажатие(Элемент)

// Откроем форму спика системных очередей и покажем в ней только те очереди агентом которых
// является текущий номер телефона
//-------------------------------------------------------------------------------------------------
	МассивОчередей = ОчередиАгенты.ОчередиПолучитьПоАгенту(Запись.Телефон);

	Если (ТипЗнч(МассивОчередей) = Тип("Массив")) Тогда
		Форма = ПолучитьФорму("Справочник.ТелОчереди.ФормаСписка",,,,ВариантОткрытияОкна.ОтдельноеОкно);

		ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= МассивОчередей;
		ЭлементОтбора.Использование		= Истина;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьТелефонНажатие(Элемент)

// Откроем форму элемента "Внутренний телефон"
//-------------------------------------------------------------------------------------------------
	Попытка
		ОткрытьЗначение(Запись.Телефон);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура НадписьВладелецНажатие(Элемент)

// Откроем форму элемента "Предприятие"
//-------------------------------------------------------------------------------------------------
	Попытка
		ВладСсылка = Телефония.ВладелецПолучить(Запись.Телефон);
		ОткрытьЗначение(ВладСсылка);
	Исключение
	КонецПопытки;
КонецПроцедуры
