&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Доступность реквизитов зависящих от управляемости сервера
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.ИсточникДанных);
	Элементы.ГруппаКаталогХранилища.Видимость = Доступно;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ИсточникДанныхНачалоВыбораНаСервере(ДанныеВыбора);
	ДанныеВыбора.СортироватьПоЗначению();
	ОбновлениеОтображения();
КонецПроцедуры

&НаСервере
Процедура ИсточникДанныхНачалоВыбораНаСервере(ДанныеВыбора)

// Получим список всех использованных источников данных
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	DISTINCT ИсточникДанных
	|FROM	Справочник.ТелСерверы
	|WHERE	(ИсточникДанных <> """") И (Ссылка <> &ЭтотОбъект)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЭтотОбъект",Объект.Ссылка);
	МассивИсточники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИсточникДанных");

// Получим список всех внешних источников данных присутствующих в системе
// Добавим в ДанныеВыбора только те, которые отсутствуют в массиве использованных источников
//-------------------------------------------------------------------------------------------------
	Для Каждого ТекСтрока Из Метаданные.ВнешниеИсточникиДанных Цикл
		Если (МассивИсточники.Найти(СокрЛП(ТекСтрока.Имя)) = Неопределено) Тогда
			ДанныеВыбора.Добавить(СокрЛП(ТекСтрока.Имя),СокрЛП(ТекСтрока.Синоним));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НадписьГрафикРаботыНажатие(Элемент)
	Если (ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		СтрПараметры = Новый Структура("ОбъектСсылка",Объект.Ссылка);
		ОткрытьФорму("Справочник.ГрафикиРаботы.Форма.ОбъектГрафикРаботы",СтрПараметры);
	КонецЕсли;
КонецПроцедуры
