
&НаКлиенте
Процедура ДобавитьЗаписьВТаблицуВопросОтвет(ВопросАнкеты, Ответ)
	
	ПарамОтбора = Новый Структура("Вопрос", ВопросАнкеты);
	НайденныеСтроки = ТаблицаВопросОтвет.НайтиСтроки(ПарамОтбора);
	
	Если НайденныеСтроки.Количество()>0 Тогда
		СтрокаТЧ = НайденныеСтроки[0];
	Иначе
		СтрокаТЧ = ТаблицаВопросОтвет.Добавить();
	КонецЕсли;	
	
	СтрокаТЧ.Вопрос = ВопросАнкеты;
	СтрокаТЧ.Ответ= Ответ;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЗаполниТЧ_ВыбираемыеОтветы();
		
	//Заполни таблицу вопросов, требующих ввода ответа, в нее же подтяни ответы из последнего разговора
	ЗаполниТаблицуВопросовТребующихВводОтветов();
		
	//Сохранить дату и время начала опроса для заполнения РС
	ДатаНачалаОпроса = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполниТаблицуВопросовТребующихВводОтветов();
	// Вызывается только в ПриСозданииНаСервере()	
	
	Запрос = Новый Запрос();
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	Анкеты.Ссылка КАК Вопрос,
	|	Анкеты.Наименование КАК ВопросСтрокой,
	|	Анкеты.Порядок КАК Порядок,
	|	ЕСТЬNULL(ИдентификаторыВопросов.Ссылка, ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрок.ПустаяСсылка)) КАК ИдВопроса,
	|	Анкеты.ДопускаемоеЧислоОтветов КАК ДопускаемоеЧислоОтветов
	|ПОМЕСТИТЬ ВТ00_ТекущиеВопросыАнкеты
	|ИЗ
	|	Справочник.Анкеты КАК Анкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыВопросов
	|		ПО (ИдентификаторыВопросов.МодифицированнаяСтрока = Анкеты.МодифицированнаяСтрока)
	|ГДЕ
	|	Анкеты.ПометкаУдаления = ЛОЖЬ
	|	И Анкеты.ЭтоГруппа = ЛОЖЬ
	|	И Анкеты.Родитель.Наименование = &НаименованиеГруппы
	|	И Анкеты.НеПоказыватьПредыдущийОтвет = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВариантыОтветов.Ссылка КАК Вопрос
	|ПОМЕСТИТЬ ВТ01_ВопросыСВыборомОтвета
	|ИЗ
	|	Справочник.Анкеты.ВариантыОтветов КАК ВариантыОтветов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ00_ТекущиеВопросыАнкеты КАК Анкеты
	|		ПО ВариантыОтветов.Ссылка = Анкеты.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасширенные.Период КАК Период,
	|	АнкетыРасширенные.Вопрос КАК Вопрос,
	|	АнкетыРасширенные.Ответ КАК Ответ
	|ПОМЕСТИТЬ ВТ02_ВсеАнкеты
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(
	|			,
	|			Телефон = &Телефон
	|				И Сигнатура = &Сигнатура) КАК АнкетыРасширенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Вопрос КАК Вопрос,
	|	МАКСИМУМ(ВТ02.Период) КАК Период
	|ПОМЕСТИТЬ ВТ03_КлючиПоследнихОтветов
	|ИЗ
	|	ВТ02_ВсеАнкеты КАК ВТ02
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ02.Вопрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Вопрос КАК Вопрос,
	|	ВТ02.Ответ КАК Ответ
	|ПОМЕСТИТЬ ВТ04_ПоследняяАнкета
	|ИЗ
	|	ВТ02_ВсеАнкеты КАК ВТ02
	|ГДЕ
	|	(ВТ02.Период, ВТ02.Вопрос) В
	|			(ВЫБРАТЬ
	|				ВТ03.Период,
	|				ВТ03.Вопрос
	|			ИЗ
	|				ВТ03_КлючиПоследнихОтветов КАК ВТ03)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ00.Вопрос КАК Вопрос,
	|	ВТ00.ВопросСтрокой КАК ВопросСтрокой,
	|	ВТ00.ИдВопроса КАК ИдВопроса,
	|	ВТ00.Порядок КАК Порядок,
	|	ВЫБОР
	|		КОГДА ВТ00.Вопрос = ЕСТЬNULL(ВТ01.Вопрос, ЗНАЧЕНИЕ(Справочник.Анкеты.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВопросТребуетВыбораОтвета,
	|	ВТ00.ДопускаемоеЧислоОтветов КАК ДопускаемоеЧислоОтветов,
	|	ВТ04.Ответ КАК ОтветСтрокой
	|ИЗ
	|	ВТ00_ТекущиеВопросыАнкеты КАК ВТ00
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ01_ВопросыСВыборомОтвета КАК ВТ01
	|		ПО (ВТ01.Вопрос = ВТ00.Вопрос)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ04_ПоследняяАнкета КАК ВТ04
	|		ПО (ВТ04.Вопрос = ВТ00.ИдВопроса)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ00.Порядок";
		
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата());	
	Запрос.УстановитьПараметр("Телефон", 			Параметры.Телефон);
	Запрос.УстановитьПараметр("Сигнатура",			Параметры.Сигнатура);
	Запрос.УстановитьПараметр("НаименованиеГруппы", "АНКЕТА");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаВведенныхОтветов.Добавить();
		НоваяСтрока.ВопросАнкеты 				=	Выборка.Вопрос;
		НоваяСтрока.ВопросСтрокой 				=	Выборка.ВопросСтрокой;
		НоваяСтрока.ВопросТребуетВыбораОтвета	=	Выборка.ВопросТребуетВыбораОтвета;
		НоваяСтрока.ДопускаемоеЧислоОтветов		=	Выборка.ДопускаемоеЧислоОтветов;	
		НоваяСтрока.ОтветСтрокой  				= Выборка.ОтветСтрокой;	
			
		//Форматирование текста ответа: ответ серым цветом, если есть ранее полученный ответ, иначе черным
		//-------------------------------------------------------------------------------------------------
		Доступно = ЗначениеЗаполнено(Выборка.ОтветСтрокой);
		НоваяСтрока.ФорматТекстаОтвета = ?(Доступно, 1, 2);				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыбранныйОтвет_НаСервере()
	// Вызывается только ПриЗакрытии()

	Анкета.Записать(ДатаНачалаОпроса, Параметры.Телефон, ТаблицаВопросОтвет,  Параметры.Сигнатура);
	
	//Если СтрДлина(Параметры.Телефон)=0 Тогда
	//	Возврат
	//КонецЕсли;
	//
	//Если ТаблицаВопросОтвет.Количество()=0 Тогда
	//	Возврат
	//КонецЕсли;
	//
	//ПустойИд = Справочники.ИдентификаторыСтрок.ПустаяСсылка();
	//
	//НЗ = РегистрыСведений.АнкетыРасширенные.СоздатьНаборЗаписей();
	//НЗ.Отбор.Период.Установить(ДатаНачалаОпроса);
	//НЗ.Отбор.Телефон.Установить(Параметры.Телефон);
	//НЗ.Прочитать();
	//
	////Запись ответов на вопросы  и самих вопросов анкеты. Вопросы маршрутизации записываются в момент выбора строки списка
	////----------------------------------------------------------------------------------------------------------------------
	//Для Каждого СтрТЗ Из ТаблицаВопросОтвет Цикл
	//	
	//	//Не записывать не заполненные ответы
	//	//-----------------------------------
	//	Если Не ЗначениеЗаполнено(СтрТЗ.Ответ) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	ИдСтрокиВопроса = Справочники.ИдентификаторыСтрок.УстановиИдентификаторСтроки(Строка(СтрТЗ.Вопрос), "вопрос", Строка(СтрТЗ.Вопрос));
	//	Если ИдСтрокиВопроса = ПустойИд Тогда
	//		Продолжить
	//	КонецЕсли;
	//	
	//	//Если на вопрос получен только один ответ
	//	//------------------------------------------
	//	Если СтрЧислоВхождений(СтрТЗ.Ответ, "|") = 0 Тогда
	//		
	//		ИдСтрокиОтвета  = Справочники.ИдентификаторыСтрок.УстановиИдентификаторСтроки(СтрТЗ.Ответ, "ответ", СтрТЗ.Ответ);
	//		Если ИдСтрокиОтвета = ПустойИд Тогда
	//			Продолжить
	//		КонецЕсли;
	//	
	//		НоваяЗапись				= НЗ.Добавить();
	//		НоваяЗапись.Период		= ДатаНачалаОпроса;
	//		НоваяЗапись.Телефон		= Параметры.Телефон;
	//		НоваяЗапись.Вопрос		= ИдСтрокиВопроса;
	//		НоваяЗапись.Ответ		= ИдСтрокиОтвета;
	//		НоваяЗапись.Сигнатура	= Параметры.Сигнатура;
	//		
	//	//Если на вопрос получено несколько ответов
	//	//---------------------------------------------------------------------------------------------------------------	
	//	Иначе
	//		МасСтрок = СтрРазделить(СтрТЗ.Ответ, "|",Ложь);
	//		Счетчик = 0;
	//		Для Каждого Стр Из МасСтрок Цикл
	//			Счетчик 		= Счетчик+1;
	//			Отв 			= СокрЛП(Стр);
	//			ИдСтрокиОтвета  = Справочники.ИдентификаторыСтрок.УстановиИдентификаторСтроки(Стр, "ответ", Стр);
	//		Если ИдСтрокиОтвета = ПустойИд Тогда
	//			Продолжить
	//		КонецЕсли;
	//	
	//		НоваяЗапись				= НЗ.Добавить();
	//		НоваяЗапись.Период		= ДатаНачалаОпроса;
	//		НоваяЗапись.Телефон		= Параметры.Телефон;
	//		НоваяЗапись.Вопрос		= ИдСтрокиВопроса;
	//		НоваяЗапись.Номер		= Счетчик;
	//		НоваяЗапись.Ответ		= ИдСтрокиОтвета;
	//		НоваяЗапись.Сигнатура	= Параметры.Сигнатура;

	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Если НЗ.Количество()= 0 Тогда
	//	Возврат
	//КонецЕсли;
	//
	//Попытка
	//	НЗ.Записать(Истина);
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВведенныхОтветовОтветОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	// Индекс строки	
	Инд = Элементы.ТаблицаВведенныхОтветов.ТекущаяСтрока;
	
	Если ТаблицаВведенныхОтветов[Инд].ВопросТребуетВыбораОтвета Тогда
		СтандартнаяОбработка=Ложь;
		Возврат
	КонецЕсли;
	
	//<Измени шрифтответа на вопрос, уже полученный при предыдущем разговоре,  на темный>
	ТаблицаВведенныхОтветов[Инд].ФорматТекстаОтвета = 2;

	//<Добавь запись в кэш вопрос-ответ>	
	ДобавитьЗаписьВТаблицуВопросОтвет(ТаблицаВведенныхОтветов[Инд].ВопросАнкеты, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВведенныхОтветовОтветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВопросАнкеты = Элемент.Родитель.Родитель.ТекущиеДанные.ВопросАнкеты;
	СписокОтветов = ТаблицаВведенныхОтветов_ПолучиСписокОтветов_НаСервере(ВопросАнкеты);
	//ВопросТребуетОбновитьОтвет = Элемент.Родитель.Родитель.ТекущиеДанные.ВопросТребуетОбновитьОтвет;
	
	Если СписокОтветов.Количество()>0 Тогда
		ДопПарамОбработчикаОповещения = Новый Структура("ВопросАнкеты", ВопросАнкеты); 
		Оп = Новый ОписаниеОповещения("ОбработкаОповещения1", ЭтотОбъект, ДопПарамОбработчикаОповещения);
		ПоказатьВыборИзСписка(Оп, СписокОтветов, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения1(ВыбЗначОтвет, ДопПараметры) Экспорт
	
	Если ВыбЗначОтвет = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	НайденныеСтроки = ТаблицаВведенныхОтветов.НайтиСтроки(ДопПараметры); // должны найти одну строку
	Если НайденныеСтроки.Количество()<>1 Тогда
		Возврат
	КонецЕсли;
	
	НайденнаяСтрока = НайденныеСтроки[0];

	//Если не было других ответов на этот же вопрос, или вопрос допускает только один ответ
	//--------------------------------------------------------------------------------------
	Если НайденнаяСтрока.ОтветСтрокой = "" Тогда
		НайденнаяСтрока.ОтветСтрокой = ВыбЗначОтвет.Значение;
	Иначе
		
		//Если вопрос допускает только один ответ (значения 0 и 1 равнозначны, означают только один ответ)
		//------------------------------------------------------------------------------------------------------	
		Если НайденнаяСтрока.ДопускаемоеЧислоОтветов = 0 ИЛИ   НайденнаяСтрока.ДопускаемоеЧислоОтветов = 1 Тогда
			НайденнаяСтрока.ОтветСтрокой = ВыбЗначОтвет.Значение;	
		Иначе
			НайденнаяСтрока.ОтветСтрокой = НайденнаяСтрока.ОтветСтрокой+" | "+ВыбЗначОтвет.Значение;	
		КонецЕсли;		
	КонецЕсли;
	ДобавитьЗаписьВТаблицуВопросОтвет(ДопПараметры.ВопросАнкеты, НайденнаяСтрока.ОтветСтрокой);
	НайденнаяСтрока.ФорматТекстаОтвета = 2;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаВведенныхОтветов_ПолучиСписокОтветов_НаСервере(ВопросАнкеты)	
	сзОтветы = Новый СписокЗначений();
	Отб = Новый Структура();
	Отб.Вставить("Вопрос", ВопросАнкеты);
	Найденные = Объект.ВыбираемыеОтветы.НайтиСтроки(Отб);
	
	ПустаяСсылка = ПредопределенноеЗначение("Справочник.Файлы.ПустаяСсылка");
	Для Каждого Стр Из Найденные Цикл
		Если Стр.Картинка <> ПустаяСсылка Тогда
			Об = Стр.Картинка.ПолучитьОбъект();
			Двоичные = Об.Содержимое.Получить();
			Картинка = Новый Картинка(Двоичные);
			Предс = Новый ФорматированнаяСтрока(Стр.Ответ, Новый Шрифт(,+2), , Новый Цвет(1,1,1));
			сзОтветы.Добавить(Стр.Ответ, Предс,, Картинка);	
		Иначе
			//сзОтветы.Добавить(Стр.Ответ, Стр.Ответ,, БиблиотекаКартинок.ШарикСиний);
			сзОтветы.Добавить(Стр.Ответ, Стр.Ответ);
		КонецЕсли;
	КонецЦикла;
	Возврат сзОтветы;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВыбранныйОтвет_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполниТЧ_АнкетыРекурсивно() Экспорт
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Вопрос,
		|	Т.ВариантыОтветов.(
		|		Ответ КАК Ответ,
		|		СледующийВопросИлиТелНомер КАК СледующееДействие,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.Анкеты)
		|				ТОГДА 1
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ТелВнутренние)
		|				ТОГДА 2
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ТелОчереди)
		|				ТОГДА 3
		|			КОГДА ТИПЗНАЧЕНИЯ(Т.ВариантыОтветов.СледующийВопросИлиТелНомер) = ТИП(Справочник.ВиртуальныеОчереди)
		|				ТОГДА 4
		|		КОНЕЦ КАК СледующееДействиеТип,
		|		СледующийВопросИлиТелНомер.Код КАК СледующееДействиеКод,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК ВариантыОтветов
		|ИЗ
		|	Справочник.Анкеты КАК Т
		|ГДЕ
		|	Т.ЭтоГруппа = ЛОЖЬ
		|	И Т.Родитель.Код = ""000000013""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос,
		|	НомерСтроки";
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ТЗ = Рез.Выгрузить();
		
		Для Каждого Стр1 Из ТЗ Цикл
			НовыйВопрос = Объект.АнкетаВопросы.Добавить();
			НовыйВопрос.Вопрос = Стр1.Вопрос;
			Для Каждого Стр2 из Стр1.ВариантыОтветов Цикл	
				НовыйОтвет 						= Объект.АнкетаОтветы.Добавить();
				НовыйОтвет.Вопрос 				= НовыйВопрос.Вопрос;
				ЗаполнитьЗначенияСвойств(НовыйОтвет, Стр2);
			КонецЦикла;
		КонецЦикла;
		
	КонецПроцедуры
	
&НаСервере	
Процедура ЗаполниТЧ_ВыбираемыеОтветы() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ Т.Ссылка КАК Вопрос, Т.Ответ КАК Ответ, Т.Картинка КАК Картинка ИЗ Справочник.Анкеты.ВариантыОтветов КАК Т ГДЕ Т.Ссылка.Родитель.Код = ""000000014""");
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = Объект.ВыбираемыеОтветы.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Выб);
	КонецЦикла;

КонецПроцедуры

