
&НаСервере
Функция ПереченьТелНомеровОчереди();
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = "";
	
	Спис = Новый СписокЗначений();

	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Спис;

	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Агенты.membername КАК ТелНомер
	|ИЗ
	|	ВнешнийИсточникДанных.AsteriskNnov.Таблица.Агенты КАК Агенты
	|ГДЕ
	|	Агенты.queue_name ПОДОБНО &queue_name";
	
	Запрос.УстановитьПараметр("queue_name", "RECEPTION");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПереченьТелефоновСтрокой = "";
	
	Пока Выборка.Следующий() Цикл
		ПереченьТелефоновСтрокой = ПереченьТелефоновСтрокой  +?(ЗначениеЗаполнено(ПереченьТелефоновСтрокой), ",","")+Выборка.ТелНомер;	
		Спис.Добавить(Выборка.ТелНомер);
	КонецЦикла;
		
	//Возврат ПереченьТелефоновСтрокой;
	Возврат Спис;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПереченьТелефонов = "";
	ПереченьТелефонов = ПереченьТелНомеровОчереди();
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЧленыОчереди",ПереченьТелефонов);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	linkedid = "";
	linkedid = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	Если Не ЗначениеЗаполнено(linkedid) Тогда
		ПоказатьПредупреждение(,"Ошибка открытия формы звонка. Установите курсор на столбец ""Сигнатура звонка"" ", 3);
		Возврат
	КонецЕсли;
	Сигнатура =	linkedid;
	Парам = Новый Структура();
	Парам.Вставить("Сигнатура", Сигнатура);
	Если СтрНайти(Сигнатура, "1#")=1 Тогда
		Фрм = ОткрытьФорму("Отчет.НепринятыеВызовы.Форма.ФормаВходящего", Парам);
	ИначеЕсли СтрНайти(Сигнатура, "0#")=1 Тогда
		Фрм = ОткрытьФорму("Отчет.НепринятыеВызовы.Форма.ФормаИсходящего", Парам);
	Иначе
		ПоказатьПредупреждение(,"Ошибка открытия формы звонка", 3);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = "";	
	
	ДанныеРасш = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	РасшЯчейки = ДанныеРасш.Элементы[Расшифровка];	
	ЗначенияПолейРасшКД = РасшЯчейки.ПолучитьПоля();
	ЗначениеПоляРасшКД = ЗначенияПолейРасшКД.Найти("linkedid");
	Если ЗначениеПоляРасшКД = Неопределено Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	linkedid = ЗначениеПоляРасшКД.Значение;
	Возврат linkedid;
КонецФункции

