&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)
	
	Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();

	// Если текущий пользователь не является Администратором, то отобразим в Списке только те звонки,
	// которые поступили на подразделения и абонентов доступных текущему пользователю
	//-------------------------------------------------------------------------------------------------
	Если (НЕ ПараметрыСеанса.РольДоступнаАдминистратор) Тогда
		ТекстЗапроса = "ГДЕ (Стат.ИнициаторИсходящего  В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.ИнициаторИсходящего = ЗНАЧЕНИЕ(Справочник.Предприятие.ПустаяСсылка) ИЛИ Стат.Исполнитель В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.Исполнитель = ЗНАЧЕНИЕ(Справочник.Предприятие.ПустаяСсылка) ИЛИ Стат.ОПСсылка В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.ОПСсылка =  ЗНАЧЕНИЕ(Справочник.Предприятие.ПустаяСсылка))";
		Список.ТекстЗапроса = СокрЛП(Список.ТекстЗапроса) + Символы.ПС + ТекстЗапроса;

		ДоступныеПодразделения = ЗначенияСервера.ДоступныеПодразделения();

		Список.Параметры.УстановитьЗначениеПараметра("Подразделения",ДоступныеПодразделения);
	КонецЕсли;
	
	//Установи отбора по периоду
	//--------------------------
	НачалоПериода = '00010101';
	Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		НачалоПериода = Параметры.НачалоПериода
	Иначе
		НачалоПериода = ДобавитьМесяц(ТекущаяДата(),-1);
	КонецЕсли;
	Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = 	Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлОтбора.ПравоеЗначение	=	НачалоПериода;
	ЭлОтбора.Использование	=	Истина;
	
	Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		КонецПериода = Параметры.КонецПериода; 
		ЭлОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Дата");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлОтбора.ПравоеЗначение	=	КонецПериода;
		ЭлОтбора.Использование	=	Истина;
	КонецЕсли;	

КонецПроцедуры
