Процедура ПостройГрафик(ДокументРезультат) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВиртуальныеОчередиСостав.Агент КАК Агент,
	|	1 КАК Количество
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	&ТЧ КАК ВиртуальныеОчередиСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Агент КАК Агент,
	|	Т.Количество КАК Количество
	|ИЗ
	|	Т КАК Т";
	Запрос.УстановитьПараметр("ТЧ", ЭтотОбъект.Состав);
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ = Рез.Выгрузить();
	
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	СКД = ПолучитьМакет("скдГрафикРаспределения");
	Настройки = СКД.НастройкиПоУмолчанию;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ПодготовьГуглГрафик(ДокументРезультат) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВиртуальныеОчередиСостав.Агент КАК Агент,
	|	1 КАК Количество
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	&ТЧ КАК ВиртуальныеОчередиСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Агент КАК Агент,
	|	СУММА(Т.Количество) КАК Количество
	|ИЗ
	|	Т КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Агент";
	Запрос.УстановитьПараметр("ТЧ", ЭтотОбъект.Состав);
	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Рез="['Ta', 'Hours per Day'],";
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез = Рез+"['"+Выборка.Агент+"',"+Выборка.Количество+"],";
	КонецЦикла;
	Рез = Лев(Рез, СтрДлина(Рез)-1); // удали последнюю запятую
	
	Рез="var arr= ["+Рез+"];";
	
	МакетНТML = ПолучитьМакет("МакетHTML");
	ТекстHTML = МакетНТML.ПолучитьТекст();

	ТекстHTML = СтрЗаменить(ТекстHTML, "var arr= [['Task', 'Hours per Day'], ['Work', 11], ['Eat', 2], ['Commute', 2], ['Watch TV', 2], ['Sleep', 7]];", Рез);
	
	Возврат ТекстHTML
КонецФункции