&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		Элементы.Наименование.Доступность	= Ложь;
		Элементы.ПолнаяСтрока.Доступность	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ПолнаяСтрока) Тогда
		ТекущийОбъект.ПолнаяСтрока = ТекущийОбъект.Наименование;
	КонецЕсли;
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		МодифицированнаяСтрока = Конвертация.МодифицироватьСтроку(ТекущийОбъект.Наименование);
		
		Если СтрДлина(МодифицированнаяСтрока) = 0 Тогда
			Сообщить("Нулевая длина модифицироанной строки");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИдентификаторыСтрок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
		|ГДЕ
		|	ИдентификаторыСтрок.МодифицированнаяСтрока ПОДОБНО &Наименование";	
		Запрос.УстановитьПараметр("Наименование", МодифицированнаяСтрока);	
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Сообщить("Такой элемент уже существует!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ТекущийОбъект.МодифицированнаяСтрока = МодифицированнаяСтрока;
	КонецЕсли;
КонецПроцедуры




