&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РегистрСведений 	= ?(ЗначениеЗаполнено(Параметры.РегистрСведений), Параметры.РегистрСведений, Объект.РегистрСведений);
	Объект.Измерение 		= ?(ЗначениеЗаполнено(Параметры.Измерение), Параметры.Измерение, Объект.Измерение);
	Объект.Ресурс			= ?(ЗначениеЗаполнено(Параметры.Ресурс), Параметры.Ресурс, Объект.Ресурс);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеИзмерения) Тогда
		Объект.ЗначениеИзмерения = Параметры.ЗначениеИзмерения;
		
		//Если при вызове формы параметры заполнены, значит она вызвана не напрямую,
		// т.е. не предполагает изменение этих настроек, поэтому скроем все закладки, кроме "СтрДанные"	
		Элементы.СтрПараметрыТаблицы.Видимость	 = Ложь;
		Элементы.СтрОтладкаСкрыть.Видимость		=Ложь;
	КонецЕсли;
	
	//Установи настройки по умолчанию
	//------------------------------------
	Об = РеквизитФормыВЗначение("Объект");                        
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформируйСписокВыбора(ИмяОбъектаМетаданных)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка КАК Ссылка, ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Представление ИЗ Справочник.ТочкиЦелевые ГДЕ НЕ ПометкаУдаления");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ТочкиЦелевые", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ТЗКолонка2.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Десериализовать(); 
КонецПроцедуры  

&НаСервере
Процедура Десериализовать()  
	Об = РеквизитФормыВЗначение("Объект");
	Об.Десериализовать();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура Сериализовать(Команда)
	СериализоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СериализоватьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Сериализовать();
КонецПроцедуры

