
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("ДатаЗакрытия");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение	=	'00010101';
	ЭлОтбора.Использование	=	Истина;
КонецПроцедуры
