Функция Создать(ИнициаторЗадачи, ДатаПостановки) Экспорт
	Перем Инициатор;
	Инициатор = СокрЛП(ИнициаторЗадачи);
	
	Рез = "ошибка";
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Инициатор) 		= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаПостановки)	= Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Инициатор);
	Доступно = Доступно И ЗначениеЗаполнено(ДатаПостановки);
	Если Не Доступно Тогда
		Возврат Рез+": неверные типы/значения параметров";
	КонецЕсли;
	
	Зап  = РегистрыСведений.ЗадачиОбратныйЗвонокДляАвтозакрытия.СоздатьМенеджерЗаписи();
	Зап.Инициатор = Инициатор;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Возврат Рез+": запись с указанным ключом "+Инициатор+" уже существует";
	КонецЕсли;
	
	Зап.Инициатор 		= Инициатор;
	Зап.ДатаПостановки 	= ДатаПостановки;
	Попытка
		Зап.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ЗадачиОбратныйЗвонокДляАвтозакрытия.Создать", УровеньЖурналаРегистрации.Ошибка,, "Инициатор = " +Инициатор+"; ДатаПостановки = "+ДатаПостановки, ОписаниеОшибки);
		Возврат Рез+":"+ОписаниеОшибки;
	КонецПопытки;
	Возврат "";
КонецФункции                                                                   
