&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НазваниеГруппыЦелевыхТочек = "Автомобили с пробегом"; 
	Отчет.ГруппаЦелевыхТочек = Справочники.ТочкиЦелевые.НайтиПоНаименованию(НазваниеГруппыЦелевыхТочек);
	Если Отчет.ГруппаЦелевыхТочек = ПредопределенноеЗначение("Справочник.ТочкиЦелевые.ПустаяСсылка") Тогда
		Сообщить("Не найдена группа целевых точек "+НазваниеГруппыЦелевыхТочек);
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	Пер = Новый СтандартныйПериод();
	Пер.ДатаНачала 		= НачалоМесяца(ТекДата);
	Пер.ДатаОкончания 	= ТекДата;
	
	Отчет.Период = Пер;
	
	Элементы.ВыборПериода.Заголовок = " "+Формат(Пер.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Пер.ДатаОкончания, "ДЛФ=Д");
		
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("1359"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("5334"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("5240"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("5241"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("5242"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("5319"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("1391"));
	Отчет.ТелефоныКонтактЦентра.Добавить(Справочники.ТелВнутренние.НайтиПоКоду("1392"));
	
	Элементы.ВыборПериода.Заголовок = " "+Формат(Пер.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Пер.ДатаОкончания, "ДЛФ=Д");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Убери вопрос "Вариант отчета был изменен, сохранить?"
	//----------------------------------------------------
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	рез = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	Если Не ЗначениеЗаполнено(Рез) Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Рез) = Тип("СправочникСсылка.ОУ_Сотрудники") Тогда
		Парам = Новый Структура();
		Парам.Вставить("Ключ", Рез);
		ОткрытьФорму("Справочник.ОУ_Сотрудники.Форма.ФормаЭлемента", Парам, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Рез)<>Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Рез, "e1c://server/MainAppL/asc_oper#" ) Тогда
		ПерейтиПоНавигационнойСсылке(Рез);
		Возврат
	КонецЕсли;
	
	Если СтрНайти(Рез, "#", , 2) >1 Тогда
		Парам = Новый Структура();
		Парам.Вставить("Сигнатура", рез);
		Если Лев(Рез,1) = "0" Тогда
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение";
		Иначе
			ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение";
		КонецЕсли;
		ОткрытьФорму(ИмяОткрываемойФормы, Парам, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		//Отбор = Новый Структура();
		//Отбор.Вставить("Сигнатура", Рез);
		//Найденные = ЭтаФорма.Отчет.РеестрЦелевыхТек.НайтиСтроки(Отбор);
		//Если Найденные.Количество()=1 Тогда
		//		АбсСсылка = "https://mainiis/asc_oper/#"+Найденные[0].НавСсылка;
		//		ПерейтиПоНавигационнойСсылке(АбсСсылка);	
		//КонецЕсли;
        Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;

КонецФункции

#Область Выбор_периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;    
	
	ПриЗакрытииДиалогаВыбораПериода = Новый ОписаниеОповещения("ПриЗакрытииДиалогаВыбораПериода", ЭтаФорма);
	Диалог.Показать(ПриЗакрытииДиалогаВыбораПериода);
	//Если Диалог.Редактировать() Тогда 
	//	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Диалог.Период);
	//КонецЕсли;
	//Элементы.ВыборПериода.Заголовок = " "+Формат(Диалог.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Диалог.Период.ДатаОкончания, "ДЛФ=Д");
	//Отчет.Период = Диалог.Период;
КонецПроцедуры

Процедура ПриЗакрытииДиалогаВыбораПериода(Парам1, Парам2) Экспорт
	// Парам1 - период
	// Парам2 - доп. парам
	
	Если ТипЗнч(Парам1) <> Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;
	Элементы.ВыборПериода.Заголовок = " "+Формат(Парам1.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Парам1.ДатаОкончания, "ДЛФ=Д");
	Отчет.Период = Парам1;
КонецПроцедуры
#КонецОбласти


