
Функция GetNotification(DataSourse, Kind, Event, ObjectType, Object, Property, Value, Extra)
	
	Данные = "DataSourse = "+DataSourse+"; Event = "+Event+"; ObjectType = " + ObjectType+"; Object="+Object+"; Property = "+Property+"; Value = "+Value+"; Extra="+Extra;
	ЗаписьЖурналаРегистрации("GetNotification", УровеньЖурналаРегистрации.Ошибка, Метаданные.WebСервисы.Notification, Данные);
	
	#Область Создание_элемента_справочника_ТелВнутренние_при_записи_в_abonents_из_СервисДеск
	Доступно = DataSourse = "SD";
	Доступно = Доступно И ObjectType = "ВнешниеИсточникиДанных.Абоненты";	
	Если Доступно Тогда
		ТелВнутр = Справочники.ТелВнутренние.НайтиПоКоду(Value);
		Если ТелВнутр = ПредопределенноеЗначение("Справочник.ТелВнутренние.ПустаяСсылка") Тогда
			Об = Справочники.ТелВнутренние.СоздатьЭлемент();
			Об.ДополнительныеСвойства.Вставить("ВнешняяЗапись", Истина);
			Об.Записать();
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
КонецФункции


