Функция ВнутреннийТелефонСотрудника(Сотрудник) Экспорт	
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 Т.Объект.Код КАК НомерВнутреннегоТелефона ИЗ РегистрСведений.ОбъектыПривязка КАК Т ГДЕ Т.Владелец = &Владелец И Т.Объект ССЫЛКА Справочник.ТелВнутренние";	
	Запрос.УстановитьПараметр("Владелец", Сотрудник	);		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	Возврат РезультатЗапроса.Выгрузить()[0][0];
КонецФункции
