
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ЭтаФорма.Вопрос = Справочники.ИдентификаторыСтрок.НайтиПоРеквизиту("МодифицированнаяСтрока", "подскажитеимеютсялиуваспожеланиязамечаниярекомендацииккачествупроизведеннойнадстройкинавашемавтомобиле?");
	//ЭтаФорма.Вопрос = Справочники.ИдентификаторыСтрок.НайтиПоРеквизиту("МодифицированнаяСтрока", "довольныливыкачествомработынашегоавтосалона?");

	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос1", ЭтаФорма.Вопрос);	
	
	Вчера = НачалоДня(ТекущаяДата()-1);
	
	ЭтаФорма.ДатаНачала 	= Вчера;
	ЭтаФорма.ДатаОкончания 	= Вчера;
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачалаПериодаЗакрытияЗадач", Вчера);	
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонцаПериодаЗакрытияЗадач", 	Вчера);	

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачалаПериодаЗакрытияЗадач", ЭтаФорма.ДатаНачала);	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонцаПериодаЗакрытияЗадач", 	ЭтаФорма.ДатаОкончания);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	СигнатураЗвонка = СигнатураЗвонка_НаСервере(Расшифровка);
	
	Если СигнатураЗвонка = "" Тогда
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура();
	Парам.Вставить("Сигнатура", СигнатураЗвонка);
	ОткрытьФорму("РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение", Парам);
	
КонецПроцедуры

&НаСервере
Функция СигнатураЗвонка_НаСервере(Расшифровка)
	
	ЗначениеПоУмолчанию = "";
	
	ДанныеРасш = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	
	ПоляРасш = ДанныеРасш.Элементы.Получить(Расшифровка).ПолучитьПоля();	
	ПолеРасш = ПоляРасш[0];

	Если ПолеРасш.Поле <> "СигнатураЗвонка" Тогда		
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	СигнатураЗвонка = ПолеРасш.Значение;
	Если СигнатураЗвонка = "" Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат СигнатураЗвонка;
	
КонецФункции

