&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Проверим правильность заполнения параметров
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(ЭтаФорма.Параметры.Канал);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтаФорма.Параметры.Телефон);

	Если (Доступно = Ложь) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтказАбонента(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНажатие(Элемент)
 	ЭтаФорма.Закрыть();
КонецПроцедуры
