Функция Добавить(АдресОтправителя) Экспорт
	
	ЗначениеПоУмолчанию = Ложь;
	Данные = "АдресОтправителя = "+АдресОтправителя;
	
	Доступно = ТипЗнч(АдресОтправителя) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(АдресОтправителя);
	
	Если Не Доступно Тогда
		Комментарий = "Ошибка в типе или заполнении арументов";
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПисьмаСпаммеры, Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ=РегистрыСведений.ПисьмаСпаммеры.СоздатьМенеджерЗаписи();
	МЗ.АдресОтправителя=АдресОтправителя;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ.АдресОтправителя=АдресОтправителя;
	МЗ.ДатаДобавления = ТекущаяДата();
	
	Попытка
		МЗ.Записать();
	Исключение
		Комментарий="Ошибка записи: "+ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПисьмаСпаммеры, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции