
Функция УстановитьНастройки(ОтборПоТочкам = Истина) Экспорт
	//Получи перечень точек оформления, фигуировавших в течении последних месяцев
	//---------------------------------------------------------------------------	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Точка КАК ТочкаОформления
	|ИЗ
	|	РегистрСведений.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Вид = &Вид
	|	И Продажи.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок
	|УПОРЯДОЧИТЬ ПО
	|	Продажи.Точка";
	
	Запрос.УстановитьПараметр("Вид", 		"Продажа авто") ;
	Запрос.УстановитьПараметр("ДатаДок", 	ТекущаяДата());
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование); 
	Если Рез.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.ТочкиОформления.Добавить();
		Новая.ТочкаОформления	= Выб.ТочкаОформления;
		Новая.Отбор				= Истина;
	КонецЦикла;

	//Получи виды ремонтов
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.ХарактеристикаОбъекта КАК ВидРемонта
	|ИЗ
	|	РегистрСведений.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Вид = &Вид
	|	И Продажи.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок
	|УПОРЯДОЧИТЬ ПО
	|	Продажи.ХарактеристикаОбъекта";
	
	Запрос.УстановитьПараметр("Вид", 		"Продажа авто") ;
	Запрос.УстановитьПараметр("ДатаДок", 	ТекущаяДата());
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование); 
	Если Рез.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.ВидыРемонта.Добавить();
		Новая.ВидРемонта	= Выб.ВидРемонта;
		Новая.Отбор			= Истина;
	КонецЦикла;
КонецФункции

Функция СформироватьОтчет(ТаблДок, СигнатураПродажи = "") Экспорт
	//Параметр СигнатураПродажи заполнен когда отчет строится из консоли негативных отзывов
	
	
	ВопросСферы 			= Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Сферы негатива");
	ВопросСфера				= Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Сфера негатива");
	ВопросКатегория 		= Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Категории негатива"); 
	ВопросОбщийКомментарий 	= Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Общий комментарий");
	ВопросДействия			= Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Действия по итогам разбора жалобы");
	
	ТаблДок.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиЗвонокЛояльности.СигнатураПродажи КАК СигнатураЗадачи,
	|	ЗадачиЗвонокЛояльности.Телефон КАК Телефон,
	|	Продажи.Точка КАК Точка,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.Объект КАК Автомобиль
	|ПОМЕСТИТЬ ВТ01_Задачи
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачиЗвонокЛояльности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ЗадачиЗвонокЛояльности.СигнатураПродажи = Продажи.Сигнатура
	|ГДЕ
	|	ЗадачиЗвонокЛояльности.ДатаЗакрытия МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаЗакрытияЗадач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|	И ЗадачиЗвонокЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьПродажАвто)
	|	И ЗадачиЗвонокЛояльности.ПричинаЗакрытия = """"
	|	И Продажи.Точка В(&ТочкиОформления)
	|	И Продажи.ХарактеристикаОбъекта В(&ВидыРемонтов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Анкеты.Период) КАК Период,
	|	Анкеты.Телефон КАК Телефон,
	|	Анкеты.Вопрос КАК Вопрос,
	|	Анкеты.Номер КАК Номер,
	|	ВТ01.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ001_СрезПоследнихПоСигнатуре
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО Анкеты.СигнатураЗадачQ = ВТ01.СигнатураЗадачи
	|ГДЕ
	|	Анкеты.Период <= КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкеты.Телефон,
	|	Анкеты.Вопрос,
	|	Анкеты.Номер,
	|	ВТ01.СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасширенные.СигнатураЗадачQ КАК СигнатураЗадачи,
	|	АнкетыРасширенные.Вопрос КАК Вопрос,
	|	АнкетыРасширенные.Ответ КАК Ответ,
	|	АнкетыРасширенные.ОтветКомментарий.ПолнаяСтрока КАК ОтветКомментарий,
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Точка КАК Точка,
	|	ВТ01.Номер КАК Номер,
	|	ВТ01.Дата КАК Дата,
	|	ВТ01.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ01.Сотрудник КАК Сотрудник,
	|	ВТ01.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК АнкетыРасширенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ001_СрезПоследнихПоСигнатуре КАК ВТ001
	|		ПО АнкетыРасширенные.Период = ВТ001.Период
	|			И АнкетыРасширенные.Телефон = ВТ001.Телефон
	|			И АнкетыРасширенные.Вопрос = ВТ001.Вопрос
	|			И АнкетыРасширенные.Номер = ВТ001.Номер
	|			И АнкетыРасширенные.СигнатураЗадачQ = ВТ001.СигнатураЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО (ВТ01.СигнатураЗадачи = АнкетыРасширенные.СигнатураЗадачQ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02.Точка КАК Точка,
	|	ВТ02.Номер КАК Номер,
	|	ВТ02.Дата КАК Дата,
	|	ВТ02.Сотрудник КАК Сотрудник,
	|	ВТ02.Автомобиль КАК Автомобиль,
	|	ВТ02.Телефон КАК Телефон,
	|	ВТ02.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ02.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ02.Вопрос КАК Вопрос,
	|	ВТ02.Ответ КАК Ответ,
	|	ВТ02.ОтветКомментарий КАК ОтветКомментарий
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбратнаяСвязьЛояльностиПродаж КАК ОбратнаяСвязьЛояльности
	|		ПО (ОбратнаяСвязьЛояльности.СигнатураПродажи = ВТ02.СигнатураЗадачи)
	|			И (ОбратнаяСвязьЛояльности.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1))
	|ИТОГИ ПО
	|	Точка,
	|	Номер,
	|	Дата,
	|	Сотрудник,
	|	Автомобиль,
	|	Телефон,
	|	КонтактноеЛицо,
	|	СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пакеты.Сигнатура КАК СигнатураМастерПродажи,
	|	Пакеты.Продажа КАК СигнатураПодчиненнойПродажи,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбратнаяСвязьЛояльности КАК ОбратнаяСвязьЛояльности
	|		ПО (ОбратнаяСвязьЛояльности.СигнатураПродажи = Пакеты.Сигнатура)
	|			И (ОбратнаяСвязьЛояльности.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО Пакеты.Продажа = Продажи.Сигнатура";
	
	СписокВыбранныхТочекОформления = Новый Массив(); 
	Для Каждого Стр из ЭтотОбъект.ТочкиОформления Цикл
		Если Стр.Отбор = Истина Тогда
			СписокВыбранныхТочекОформления.Добавить(Стр.ТочкаОформления);
		КонецЕсли;
	КонецЦикла;
	
	СписокВыбранныхВидовРемонта = Новый Массив(); 
	Для Каждого Стр из ЭтотОбъект.ВидыРемонта Цикл
		Если Стр.Отбор = Истина Тогда
			СписокВыбранныхВидовРемонта.Добавить(Стр.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТочкиОформления", 	СписокВыбранныхТочекОформления);
	Запрос.УстановитьПараметр("ВидыРемонтов",		СписокВыбранныхВидовРемонта);
	Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ЭтотОбъект.ДатаНачалаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ЭтотОбъект.ДатаКонцаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("Вопрос1", 							Анкета._1йБазовыйВопросЛояльности());
	Запрос.УстановитьПараметр("Вопрос2",							Анкета._2йБазовыйВопросЛояльности());
	Запрос.УстановитьПараметр("Ответ1", 							Анкета._1());
	Запрос.УстановитьПараметр("Ответ2", 							Анкета._2());
	Запрос.УстановитьПараметр("Ответ3", 							Анкета._3());
	Запрос.УстановитьПараметр("ОтветНет",							Анкета.Нет());
	
	
	//Если отчет вызван из консоли негативных отзывов
	//------------------------------------------------
	Если ЗначениеЗаполнено(СигнатураПродажи) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Продажи.Сигнатура = &СигнатураПродажи");
		
		ТекДата = ТекущаяДата();
		Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ДобавитьМесяц(ТекДата, -3));
		Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ТекДата);
		Запрос.УстановитьПараметр("СигнатураПродажи",					СигнатураПродажи);
	КонецЕсли;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Если  ПакетРезультатов[3].Пустой() Тогда
		Возврат ""; 
	КонецЕсли;
	
	ЗаказНарядыВПакетах = ПакетРезультатов[4].Выгрузить();
	Макет = ЭтотОбъект.ПолучитьМакет("МакетОтчета");
	
	ВыбТочка = ПакетРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбТочка.Следующий() Цикл
		ВыбНомер = ВыбТочка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыбНомер.Следующий() Цикл
			ВыбДата = ВыбНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыбДата.Следующий() Цикл
				ВыбСотрудник = ВыбДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыбСотрудник.Следующий() Цикл
					ВыбАвтомобиль = ВыбСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыбАвтомобиль.Следующий() Цикл
						ВыбТелефон = ВыбАвтомобиль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыбТелефон.Следующий() Цикл
							ВыбКонтакт = ВыбТелефон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыбКонтакт.Следующий() Цикл
								
								ВыбСигнатура = ВыбКонтакт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыбСигнатура.Следующий() Цикл

									ОблШапка = Макет.ПолучитьОбласть("Шапка");
									ОблШапка.Параметры.ПечТочкаОформления = ВыбКонтакт.Точка;
									
									ЗаказНаряды = ВыбКонтакт.Номер+" от "+Формат(ВыбКонтакт.Дата, "ДФ=dd.MM.yyyy");
									Сотрудники  = ВыбКонтакт.Сотрудник;
									
									// Вывод списка заказ-нарядов и сотрудников
									//------------------------------------------
									Отб = Новый Структура();
									Отб.Вставить("СигнатураМастерПродажи", ВыбСигнатура.СигнатураЗадачи);
									Найденные = ЗаказНарядыВПакетах.НайтиСтроки(Отб);
									Для Каждого Стр Из Найденные Цикл
										ЗаказНаряды = ЗаказНаряды+";"+Стр.Номер+" от "+	Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
										
										Если СтрНайти(Сотрудники, Стр.Сотрудник)= 0 Тогда
											Сотрудники = Сотрудники + "; "+Стр.Сотрудник;
										КонецЕсли;
									КонецЦикла;
									ОблШапка.Параметры.ПечНомераДатыЗаказНарядов 	= ЗаказНаряды;
									ОблШапка.Параметры.ПечФИОСотрудников 			= Сотрудники;	
									ОблШапка.Параметры.ПечАвтомобиль				= ВыбКонтакт.Автомобиль;
									ОблШапка.Параметры.ПечТелНомерКонтактногоЛица	= ВыбКонтакт.Телефон;
									ОблШапка.Параметры.ПечФИОКонтактногоЛица		= ВыбКонтакт.КонтактноеЛицо;	
									ТаблДок.Вывести(ОблШапка);
									
									ВыбДетальные = ВыбСигнатура.Выбрать();
									Пока ВыбДетальные.Следующий() Цикл
										ОблСтр = Макет.ПолучитьОбласть("Строка"); 
										ОблСтр.Параметры.ПечВопрос 				= ВыбДетальные.Вопрос;
										ОблСтр.Параметры.ПечОтвет				= ВыбДетальные.Ответ;
										ОблСтр.Параметры.ПечОтветКомментарий 	= ВыбДетальные.ОтветКомментарий;  	
										ОблЯчеек = ТаблДок.Вывести(ОблСтр, 2);
										
										Если ВыбДетальные.Вопрос = ВопросСфера Тогда
											КатегорииСферы = "";
											З = Новый Запрос();
											З.Текст = "ВЫБРАТЬ А.Ответ КАК Ответ ИЗ РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(, СигнтраЗадачи = &Сигнатура) КАК А ГДЕ А.Вопрос = &Вопрос";
											З.Текст = 
											"ВЫБРАТЬ
											|	Б.Ответ КАК Ответ
											|ИЗ
											|	РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(
											|			,
											|			СигнтраЗадачи = &Сигнатура
											|				И Вопрос = &Вопрос) КАК Б
											|ГДЕ
											|	Б.Период В
											|			(ВЫБРАТЬ
											|				МАКСИМУМ(А.Период) КАК ПериодКлюч
											|			ИЗ
											|				РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(, СигнтраЗадачи = &Сигнатура
											|					И Вопрос = &Вопрос) КАК А)";
											З.УстановитьПараметр("Сигнатура",	ВыбСигнатура.СигнатураЗадачи);
											З.УстановитьПараметр("Вопрос", 		ВыбДетальные.Ответ);
											Р = З.Выполнить();
											Если Не Р.Пустой() Тогда
												КатегорииСферы =  СтрСоединить(Р.Выгрузить().ВыгрузитьКолонку(0), ";");
												Обл = Макет.ПолучитьОбласть("КатегорииСферы"); 
												Обл.Параметры.ПечКатегория = КатегорииСферы;
												ОблЯчеек = ТаблДок.Вывести(Обл, 2);
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
									
									
									
									ОтветСфера 					= "";
									ОтветКатегория				= "";
									ОтветОбщийКомментарий		= ""; 
									
									Запр = Новый Запрос();
									Запр.Текст =
									
									"ВЫБРАТЬ
									|	АнкетыОбратнойСвязи.Ответ КАК ОтветСфера
									|ИЗ
									|	РегистрСведений.АнкетыОбратнойСвязи КАК АнкетыОбратнойСвязи
									|ГДЕ
									|	АнкетыОбратнойСвязи.СигнтраЗадачи = &СигнатураЗадачи
									|	И АнкетыОбратнойСвязи.Вопрос = &ВопросСферы
									|	И АнкетыОбратнойСвязи.Период В
									|			(ВЫБРАТЬ
									|				МАКСИМУМ(АнкетыОбратнойСвязи.Период) КАК Период
									|			ИЗ
									|				РегистрСведений.АнкетыОбратнойСвязи КАК АнкетыОбратнойСвязи
									|			ГДЕ
									|				АнкетыОбратнойСвязи.СигнтраЗадачи = &СигнатураЗадачи
									|				И АнкетыОбратнойСвязи.Вопрос = &ВопросСферы)";
									
									Запр.УстановитьПараметр("СигнатураЗадачи", 	ВыбСигнатура.СигнатураЗадачи);
									Запр.УстановитьПараметр("ВопросСферы", 		ВопросСферы);
									тз 	= Запр.Выполнить().Выгрузить();
									Если тз.Количество()>0 Тогда
										ОтветСфера 					= СтрСоединить(тз.ВыгрузитьКолонку(0), ";");
									КонецЕсли;
									
									Запр = Новый Запрос();
									Запр.Текст = 
									"ВЫБРАТЬ
									|	АнкетыОбратнойСвязи.Ответ КАК ОтветКатегория
									|ИЗ
									|	РегистрСведений.АнкетыОбратнойСвязи КАК АнкетыОбратнойСвязи
									|ГДЕ
									|	АнкетыОбратнойСвязи.СигнтраЗадачи = &СигнатураЗадачи
									|	И АнкетыОбратнойСвязи.Вопрос = &ВопросКатегория
									|	И АнкетыОбратнойСвязи.Период В
									|			(ВЫБРАТЬ
									|				МАКСИМУМ(АнкетыОбратнойСвязи.Период) КАК Период
									|			ИЗ
									|				РегистрСведений.АнкетыОбратнойСвязи КАК АнкетыОбратнойСвязи
									|			ГДЕ
									|				АнкетыОбратнойСвязи.СигнтраЗадачи = &СигнатураЗадачи
									|				И АнкетыОбратнойСвязи.Вопрос = &ВопросКатегория)";
									
									Запр.УстановитьПараметр("СигнатураЗадачи", 	ВыбСигнатура.СигнатураЗадачи);
									Запр.УстановитьПараметр("ВопросКатегория", 	ВопросКатегория);
									тз 			= Запр.Выполнить().Выгрузить();
									Если тз.Количество()>0 Тогда
										ОтветКатегория	= СтрСоединить(тз.ВыгрузитьКолонку(0), ";");
									КонецЕсли;
									
									Запр = Новый Запрос();
									Запр.Текст = 
									"ВЫБРАТЬ
									|	АнкетыОбратнойСвязиСрезПоследних.Ответ.ПолнаяСтрока КАК ОтветОбщийКомментарий
									|ИЗ
									|	РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(
									|			,
									|			СигнтраЗадачи = &СигнатураЗадачи
									|				И Вопрос = &ВопросОбщийКомментарий) КАК АнкетыОбратнойСвязиСрезПоследних";
									Запр.УстановитьПараметр("СигнатураЗадачи", 			ВыбСигнатура.СигнатураЗадачи);
									Запр.УстановитьПараметр("ВопросОбщийКомментарий", 	ВопросОбщийКомментарий);
									тз 			= Запр.Выполнить().Выгрузить();
									Если тз.Количество()>0 Тогда
										ОтветОбщийКомментарий	= СтрСоединить(тз.ВыгрузитьКолонку(0), ";")
									КонецЕсли;
									
									Запр = Новый Запрос();
									Запр.Текст = 
									"ВЫБРАТЬ
									|	АнкетыОбратнойСвязиСрезПоследних.Ответ.ПолнаяСтрока КАК ОтветОбщийКомментарий
									|ИЗ
									|	РегистрСведений.АнкетыОбратнойСвязи.СрезПоследних(
									|			,
									|			СигнтраЗадачи = &СигнатураЗадачи
									|				И Вопрос = &ВопросДействия) КАК АнкетыОбратнойСвязиСрезПоследних";
									Запр.УстановитьПараметр("СигнатураЗадачи", 			ВыбСигнатура.СигнатураЗадачи);
									Запр.УстановитьПараметр("ВопросДействия", 			ВопросДействия);
									тз 			= Запр.Выполнить().Выгрузить();
									Если тз.Количество()>0 Тогда
										ОтветДействия	= СтрСоединить(тз.ВыгрузитьКолонку(0), ";")
									КонецЕсли;
									ОблШапка = Макет.ПолучитьОбласть("ОбработкаНегатива");
									ОблШапка.Параметры.ПечОбщийКомментарий		= ОтветОбщийКомментарий;
									ОблШапка.Параметры.ПечДействия				= ОтветДействия;
									ТаблДок.Вывести(ОблШапка);
								КонецЦикла;		
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецФункции