
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Парам = Новый Структура;
	Парам.Вставить("Телефон",		ПараметрыВыполненияКоманды.Источник.Запись.АбонентВнешний);
	Парам.Вставить("Сигнатура", 	ПараметрыВыполненияКоманды.Источник.Запись.Сигнатура);
	ОткрытьФорму("Обработка.РедактированиеАнкетыИзКарточкиЗвонка.Форма.ФормаРедактированияАнкетыИзКарточкиЗвонка", Парам, ПараметрыВыполненияКоманды.Источник,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры
