Процедура ОбработкаПолученияПолейПредставления(Поля,СтандартнаяОбработка)

// Набор полей для получения представления
//-------------------------------------------------------------------------------------------------
	Поля.Добавить("Телефон");
	Поля.Добавить("Наименование");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные,Представление,СтандартнаяОбработка)

// Сформируем представление
//-------------------------------------------------------------------------------------------------
	Представление = СокрЛП(Данные.Наименование) + " (" + СокрЛП(Данные.Телефон) + ")";
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
