&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если текущий пользователь не является Администратором, то отобразим в Списке только те звонки,
// которые поступили на подразделения и абонентов доступных текущему пользователю
//-------------------------------------------------------------------------------------------------
	Если (НЕ ПараметрыСеанса.РольДоступнаАдминистратор) Тогда
		ТекстЗапроса = " И (Стат.ИнициаторИсходящего В ИЕРАРХИИ (&Подразделения) ИЛИ Стат.Исполнитель В ИЕРАРХИИ (&Подразделения))";
		ЭтаФорма.Список.ТекстЗапроса = СокрЛП(ЭтаФорма.Список.ТекстЗапроса) + Символы.ПС + ТекстЗапроса;

		ДоступныеПодразделения = ЗначенияСервера.ДоступныеПодразделения();
		ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Подразделения",ДоступныеПодразделения);
	КонецЕсли;
	
	// Установи вопрос в качестве заголовка колонки Ответ
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|	ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос_Анкеты_Для_Полного_Реестра_Звонков""";
	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ.Заголовок = Вопрос;	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос", Выборка.Вопрос);
	
	// Установи вопрос1 в качестве заголовка колонки Ответ1
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|	ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос1_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос1 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ1.Заголовок = Вопрос1;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос1", Выборка.Вопрос);

	// Установи вопрос2 в качестве заголовка колонки Ответ2
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос2_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос2 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ2.Заголовок = Вопрос2;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос2", Выборка.Вопрос);

	// Установи вопрос3 в качестве заголовка колонки Ответ3
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос3_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос3 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ3.Заголовок = Вопрос3;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос3", Выборка.Вопрос);
	
	// Установи вопрос4 в качестве заголовка колонки Ответ4
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос6_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос6 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ6.Заголовок = Вопрос6;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос6", Выборка.Вопрос);

// Установи вопрос5 в качестве заголовка колонки Ответ4
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Учет.Значение КАК ВопросСтрока,
	|   ИдентификаторыСтрок.Ссылка КАК Вопрос
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК Учет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|		ПО (ВЫРАЗИТЬ(Учет.Значение КАК СТРОКА(100)) ПОДОБНО ИдентификаторыСтрок.Наименование)
	|ГДЕ
	|	Учет.Параметр = ""Вопрос7_Анкеты_Для_Полного_Реестра_Звонков""";	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	Вопрос7 = Выборка.ВопросСтрока;
	ЭтаФорма.Элементы.Ответ7.Заголовок = Вопрос7;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вопрос7", Выборка.Вопрос);

	//Период
	//--------
	ТекДата 	= ТекущаяДата();
	Окончание 	= КонецДня(ТекДата);
	Начало 		= НачалоДня( НачалоДня(ТекДата)-1);
	
	Период.ДатаНачала 		= Начало;
	Период.ДатаОкончания 	= Окончание;
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение();
	Элементы.ВыборПериода.Заголовок = " "+Формат(Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Период.ДатаОкончания, "ДЛФ=Д");
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
	Элементы.Список.Обновить();
КонецПроцедуры

#Область Выбор_Периода
&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Период;
	
	Оп = Новый ОписаниеОповещения("НаЗакрытиеДиалогаПериода", ЭтаФорма);
	Диалог.Показать(Оп);
КонецПроцедуры

&НаКлиенте
Процедура НаЗакрытиеДиалогаПериода(Парам1, Парам2) Экспорт
	Если Парам1 = Неопределено Тогда
		Возврат
	КонецЕсли;
	Период = Парам1;
	ОбновитьОтображение();
КонецПроцедуры
#КонецОбласти

