Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ВыбранныйВариантОтчета = "СтруктураЗвонковЕКЦ" Тогда
		СКД = ПолучитьМакет("СтруктураЗвонковЕКЦ");	
		СтруктураЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	ИначеЕсли ВыбранныйВариантОтчета = "СтруктураНепринятыхЗвонковЕКЦ" Тогда
		СКД = ПолучитьМакет("СтруктураНепринятыхЗвонковЕКЦ");	
		СтруктураНепринятыхЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);	 
	ИначеЕсли  ВыбранныйВариантОтчета = "СтруктураПереведенныхЗвонковЕКЦ" Тогда
		СКД = ПолучитьМакет("СтруктураПереведенныхЗвонковЕКЦ");	
		СтруктураПереведенныхЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);
	ИначеЕсли  ВыбранныйВариантОтчета = "ЗвонкиОставшиесяНаОператорахЕКЦ" Тогда
		СКД = ПолучитьМакет("ЗвонкиОставшиесяНаОператорахЕКЦ");	
		ЗвонкиОставшиесяНаОператорахЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД);
	КонецЕсли;
КонецПроцедуры

Процедура СтруктураЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Звонки.Сигнатура КАК Сигнатура,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦРазговор, 0) КАК КЦРазговор,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПОжидание, 0) КАК ОПОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПРазговор, 0) КАК ОПРазговор
	|ПОМЕСТИТЬ ВТ01_База
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтатОбщая
	|		ПО Звонки.Сигнатура = ЗвонкиСтатОбщая.Сигнатура
	|ГДЕ
	|	Звонки.Дата МЕЖДУ &Начало И &Окончание
	|	И ЗвонкиСтатОбщая.КЦСсылка = &КЦСсылка
	|	И Звонки.ЭтоВходящий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВЫБОР
	|		КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ01.КЦРазговор <= 5
	|						ТОГДА ""Непринят ЕКЦ""
	|					ИНАЧЕ ""Остался на операторе""
	|				КОНЕЦ
	|		ИНАЧЕ ""Звонок переведен""
	|	КОНЕЦ КАК Статус,
	|	1 КАК Количество
	|ИЗ
	|	ВТ01_База КАК ВТ01";
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	Запрос.УстановитьПараметр("КЦСсылка",	Справочники.Предприятие.НайтиПоКоду("000000265"));
	
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ = РезультатЗапроса.Выгрузить();
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Процедура СтруктураНепринятыхЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Звонки.Сигнатура КАК Сигнатура,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦОжидание, 0) КАК КЦОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦРазговор, 0) КАК КЦРазговор,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПОжидание, 0) КАК ОПОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПРазговор, 0) КАК ОПРазговор
	|ПОМЕСТИТЬ ВТ01_База
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтатОбщая
	|		ПО Звонки.Сигнатура = ЗвонкиСтатОбщая.Сигнатура
	|ГДЕ
	|	Звонки.Дата МЕЖДУ &Начало И &Окончание
	|	И ЗвонкиСтатОбщая.КЦСсылка = &КЦСсылка
	|	И Звонки.ЭтоВходящий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ01.КЦОжидание КАК КЦОжидание,
	|	ВТ01.КЦРазговор КАК КЦРазговор,
	|	ВЫБОР
	|		КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ01.КЦРазговор <= 5
	|						ТОГДА ""Непринят ЕКЦ""
	|					ИНАЧЕ ""Остался на операторе""
	|				КОНЕЦ
	|		ИНАЧЕ ""Звонок переведен""
	|	КОНЕЦ КАК СтатусЗвонка
	|ПОМЕСТИТЬ ВТ03
	|ИЗ
	|	ВТ01_База КАК ВТ01
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ01.КЦРазговор <= 5
	|							ТОГДА ""Непринят ЕКЦ""
	|						ИНАЧЕ ""Остался на операторе""
	|					КОНЕЦ
	|			ИНАЧЕ ""Звонок переведен""
	|		КОНЕЦ = ""Непринят ЕКЦ""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Сигнатура КАК Сигнатура,
	|	ВЫБОР
	|		КОГДА ВТ03.КЦРазговор > 0
	|			ТОГДА ""Срыв""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ03.КЦОжидание > 0
	|					ТОГДА ""Непринят сотрудником""
	|				ИНАЧЕ ""Непринят очередью""
	|			КОНЕЦ
	|	КОНЕЦ КАК Статус,
	|	1 КАК Количество
	|ИЗ
	|	ВТ03 КАК ВТ03";

	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	Запрос.УстановитьПараметр("КЦСсылка",	Справочники.Предприятие.НайтиПоКоду("000000265"));
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	

КонецПроцедуры

Процедура СтруктураПереведенныхЗвонковЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Звонки.АбонентВнешний КАК Телефон,
	|	Звонки.Сигнатура КАК Сигнатура,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦОжидание, 0) КАК КЦОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦРазговор, 0) КАК КЦРазговор,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПОжидание, 0) КАК ОПОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПРазговор, 0) КАК ОПРазговор,
	|	ЕСТЬNULL(ЗвонкиДоп.ЦелеваяТочка, ЗНАЧЕНИЕ(Справочник.ТочкиЦелевые.ПустаяСсылка)) КАК ЦелеваяТочка
	|ПОМЕСТИТЬ ВТ01_База
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтатОбщая
	|		ПО Звонки.Сигнатура = ЗвонкиСтатОбщая.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиДоп КАК ЗвонкиДоп
	|		ПО Звонки.Сигнатура = ЗвонкиДоп.Сигнатура
	|ГДЕ
	|	Звонки.Дата МЕЖДУ &Начало И &Окончание
	|	И ЗвонкиСтатОбщая.КЦСсылка = &КЦСсылка
	|	И Звонки.ЭтоВходящий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ01.КЦОжидание КАК КЦОжидание,
	|	ВТ01.КЦРазговор КАК КЦРазговор,
	|	ВТ01.ОПОжидание КАК ОПОжидание,
	|	ВТ01.ОПРазговор КАК ОПРазговор,
	|	ВТ01.ЦелеваяТочка КАК ЦелеваяТочка,
	|	ВЫБОР
	|		КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ01.КЦРазговор <= 5
	|						ТОГДА ""Непринят ЕКЦ""
	|					ИНАЧЕ ""Остался на операторе""
	|				КОНЕЦ
	|		ИНАЧЕ ""Звонок переведен""
	|	КОНЕЦ КАК СтатусЗвонка
	|ПОМЕСТИТЬ ВТ03
	|ИЗ
	|	ВТ01_База КАК ВТ01
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ01.КЦРазговор <= 5
	|							ТОГДА ""Непринят ЕКЦ""
	|						ИНАЧЕ ""Остался на операторе""
	|					КОНЕЦ
	|			ИНАЧЕ ""Звонок переведен""
	|		КОНЕЦ = ""Звонок переведен""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Телефон КАК Телефон,
	|	ВТ03.Сигнатура КАК Сигнатура,
	|	ВТ03.ЦелеваяТочка КАК ЦелеваяТочка,
	|	ВЫБОР
	|		КОГДА ВТ03.ОПРазговор = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ03.ЦелеваяТочка = ЗНАЧЕНИЕ(Справочник.ТочкиЦелевые.ПустаяСсылка)
	|						ТОГДА ""Непринят ОП нецелевой звонок""
	|					ИНАЧЕ ""Непринят ОП целевой звонок""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ03.ЦелеваяТочка = ЗНАЧЕНИЕ(Справочник.ТочкиЦелевые.ПустаяСсылка)
	|					ТОГДА ""Доведен нецелевой звонок""
	|				ИНАЧЕ ""Доведен целевой звонок""
	|			КОНЕЦ
	|	КОНЕЦ КАК Статус,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ04
	|ИЗ
	|	ВТ03 КАК ВТ03
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Анкета.Ответ КАК Ответ_ТипОбращенияПоНаправлениюДеятельности,
	|	Анкета.Телефон КАК Телефон,
	|	Анкета.Сигнатура КАК Сигнатура,
	|	МАКСИМУМ(Анкета.Период) КАК Период
	|ПОМЕСТИТЬ ВТ05_Ответ_ТипОбращенияПоНаправлениюДеятельности
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные.СрезПоследних(, ) КАК Анкета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03 КАК ВТ03
	|		ПО Анкета.Телефон = ВТ03.Телефон
	|			И Анкета.Сигнатура = ВТ03.Сигнатура
	|			И (Анкета.Вопрос = &Вопрос_ТипОбращенияПоНаправлениюДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкета.Ответ,
	|	Анкета.Телефон,
	|	Анкета.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ04.Телефон КАК Телефон,
	|	ВТ04.Сигнатура КАК Сигнатура,
	|	ВТ04.ЦелеваяТочка КАК ЦелеваяТочка,
	|	ВТ04.Статус КАК Статус,
	|	ВТ04.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ05.Ответ_ТипОбращенияПоНаправлениюДеятельности.Наименование, ""<пусто>"") КАК Ответ
	|ИЗ
	|	ВТ04 КАК ВТ04
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ05_Ответ_ТипОбращенияПоНаправлениюДеятельности КАК ВТ05
	|		ПО ВТ04.Телефон = ВТ05.Телефон
	|			И ВТ04.Сигнатура = ВТ05.Сигнатура";

	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	Запрос.УстановитьПараметр("КЦСсылка",	Справочники.Предприятие.НайтиПоКоду("000000265"));	
	Запрос.УстановитьПараметр("Вопрос_ТипОбращенияПоНаправлениюДеятельности", Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Тип обращения по направлению деятельности"));
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры

Процедура ЗвонкиОставшиесяНаОператорахЕКЦ(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, СКД)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Звонки.АбонентВнешний КАК Телефон,
	|	Звонки.Сигнатура КАК Сигнатура,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.КЦРазговор, 0) КАК КЦРазговор,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПОжидание, 0) КАК ОПОжидание,
	|	ЕСТЬNULL(ЗвонкиСтатОбщая.ОПРазговор, 0) КАК ОПРазговор
	|ПОМЕСТИТЬ ВТ01_База
	|ИЗ
	|	РегистрСведений.Звонки КАК Звонки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК ЗвонкиСтатОбщая
	|		ПО Звонки.Сигнатура = ЗвонкиСтатОбщая.Сигнатура
	|ГДЕ
	|	Звонки.Дата МЕЖДУ &Начало И &Окончание
	|	И ЗвонкиСтатОбщая.КЦСсылка = &КЦСсылка
	|	И Звонки.ЭтоВходящий = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ01.КЦРазговор КАК КЦРазговор,
	|	ВТ01.ОПОжидание КАК ОПОжидание,
	|	ВТ01.ОПРазговор КАК ОПРазговор,
	|	ВЫБОР
	|		КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ01.КЦРазговор <= 5
	|						ТОГДА ""Непринят ЕКЦ""
	|					ИНАЧЕ ""Остался на операторе""
	|				КОНЕЦ
	|		ИНАЧЕ ""Звонок переведен""
	|	КОНЕЦ КАК СтатусЗвонка
	|ПОМЕСТИТЬ ВТ03
	|ИЗ
	|	ВТ01_База КАК ВТ01
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ01.ОПОжидание + ВТ01.ОПРазговор = 0
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ01.КЦРазговор <= 5
	|							ТОГДА ""Непринят ЕКЦ""
	|						ИНАЧЕ ""Остался на операторе""
	|					КОНЕЦ
	|			ИНАЧЕ ""Звонок переведен""
	|		КОНЕЦ = ""Остался на операторе""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Анкета.Ответ КАК Ответ,
	|	Анкета.Телефон КАК Телефон,
	|	Анкета.Сигнатура КАК Сигнатура,
	|	МАКСИМУМ(Анкета.Период) КАК Период
	|ПОМЕСТИТЬ ВТ05_Ответ
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03 КАК ВТ03
	|		ПО Анкета.Телефон = ВТ03.Телефон
	|			И Анкета.Сигнатура = ВТ03.Сигнатура
	|			И (Анкета.Вопрос = &Вопрос)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкета.Ответ,
	|	Анкета.Телефон,
	|	Анкета.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Анкета.Ответ КАК Ответ,
	|	Анкета.Телефон КАК Телефон,
	|	Анкета.Сигнатура КАК Сигнатура,
	|	МАКСИМУМ(Анкета.Период) КАК Период
	|ПОМЕСТИТЬ ВТ06_Ответ1
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03 КАК ВТ03
	|		ПО Анкета.Телефон = ВТ03.Телефон
	|			И Анкета.Сигнатура = ВТ03.Сигнатура
	|			И (Анкета.Вопрос = &Вопрос1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкета.Ответ,
	|	Анкета.Телефон,
	|	Анкета.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ03.Телефон КАК Телефон,
	|	ВТ03.Сигнатура КАК Сигнатура,
	|	1 КАК Количество,
	|	ЕСТЬNULL(ВТ05.Ответ.Наименование, ""<пусто>"") КАК Ответ,
	|	ЕСТЬNULL(ВТ06.Ответ.Наименование, ""<пусто>"") КАК Ответ1
	|ИЗ
	|	ВТ03 КАК ВТ03
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ05_Ответ КАК ВТ05
	|		ПО ВТ03.Телефон = ВТ05.Телефон
	|			И ВТ03.Сигнатура = ВТ05.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ06_Ответ1 КАК ВТ06
	|		ПО ВТ03.Телефон = ВТ06.Телефон
	|			И ВТ03.Сигнатура = ВТ06.Сигнатура";

	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	Запрос.УстановитьПараметр("КЦСсылка",	Справочники.Предприятие.НайтиПоКоду("000000265"));	
	Запрос.УстановитьПараметр("Вопрос",		Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Тип обращения по направлению деятельности"));
	Запрос.УстановитьПараметр("Вопрос1",	Справочники.ИдентификаторыСтрок.НайтиПоНаименованию("Причина отсутствия перевода"));
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();
		
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры

