Функция Добавить(Период, Процесс, Свойство, Значение, ТипЗначения = "Строка") Экспорт
	//Параметр ТипЗначения - устарел, не используется, оставлен для совместимости (тип значения перенесен в реквизит свойства)
	
	ЗначениеПоУмолчанию = Ложь;
	
	Данные = "Период = "+Период+"; Процесс = "+Процесс+"; Свойство = "+Свойство+" ;Значение = "+Значение+" ;ТипЗначения = " + ТипЗначения;
	
	Доступно = ЗначениеЗаполнено(Период);
	Доступно = Доступно И ЗначениеЗаполнено(Процесс);
	Доступно = Доступно И Процесс <> Неопределено;
	Доступно = Доступно И ЗначениеЗаполнено(Свойство);   
	Доступно = Доступно И ЗначениеЗаполнено(Значение);
	
	Если Не Доступно Тогда
		Комментарий = "Ошибка в заполнении аргументов";
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.БизнесПроцессыЗначенияСвойств, Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ = РегистрыСведений.БизнесПроцессыЗначенияСвойств.СоздатьМенеджерЗаписи();
	МЗ.Период 		= Период;
	МЗ.Процесс 		= Процесс;
	МЗ.Свойство 	= Свойство;
	МЗ.Значение 	= Значение;
	
	Попытка	
		МЗ.Записать(Ложь);
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, , Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
КонецФункции

