
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Элементы.СтрДополнительные.ТолькоПросмотр = НЕ ?(ПараметрыСеанса.РольДоступнаАдминистратор = Истина, Истина, Ложь); 
КонецПроцедуры

&НаКлиенте
Процедура АбонентВнешнийПриИзменении(Элемент)
	
	Запись.АбонентВнешний = Конвертация.ТелефонВнешнийНормализовать(Запись.АбонентВнешний); 
	
	Если ЗначениеЗаполнено(Запись.Регион) Тогда
		Возврат;
	КонецЕсли;
	Запись.Регион = РегионПоНомеруТелефона(Запись.АбонентВнешний);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РегионПоНомеруТелефона(Телефон)
	Возврат КонвертацияСервер.РегионПолучитьПоНомеруТелефона(Телефон)	
КонецФункции