&НаКлиенте
Процедура Деактивировать(Команда)

// Выполним деактивацию выбранного пользователя
//-------------------------------------------------------------------------------------------------
	Доступно = (Элементы.Список.ТекущиеДанные <> Неопределено);
	Доступно = Доступно И (Элементы.Список.ТекущиеДанные.Активность = Истина);

	Если (Доступно = Истина) Тогда
		ТекстСообщения = "Вы действительно желаете выполнить деактивацию пользователя """;
		ТекстСообщения = ТекстСообщения + СокрЛП(Элементы.Список.ТекущиеДанные.Ссылка) + """ ?";

		Если (Вопрос(ТекстСообщения,РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
			ДеактивироватьНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДеактивироватьНаСервере(СпрСсылка)

// Выполним деактивацию выбранного пользователя
//-------------------------------------------------------------------------------------------------
	Попытка
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
		СпрОбъект.Активность = Ложь;
		СпрОбъект.Записать();
	Исключение
		Сообщить("Ошибка деактивации пользователя: " + СокрЛП(ОписаниеОшибки()));
	КонецПопытки;
КонецПроцедуры
