Функция Добавить (Сигнатура,  Дата, Инициатор, АбонентВнешний, Комментарий ="", СигнатураПочтовогоСообщения = "") Экспорт
	Доступно = 	ТипЗнч(Сигнатура) = Тип("Строка")
			И 	ЗначениеЗаполнено(Сигнатура)
			И 	ТипЗнч(Дата)						= Тип("Дата")
			И	ТипЗнч(Инициатор) 					= Тип("Строка")
			И	ТипЗнч(АбонентВнешний) 				= Тип("Строка")
			И	ТипЗнч(Комментарий) 				= Тип("Строка")
			И	ТипЗнч(СигнатураПочтовогоСообщения) = Тип("Строка");
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	З = РегистрыСведений.ИнтернетЗаявки.СоздатьМенеджерЗаписи();	
	З.Сигнатура 						= Сигнатура;
	З.Дата 							= Дата;
	З.Инициатор 						= Инициатор;
	З.АбонентВнешний 					= Конвертация.ТелефонВнешнийНормализовать(АбонентВнешний);
	З.Комментарий  					= Комментарий;  
	З.СигнатураПочтовогоСообщения		= СигнатураПочтовогоСообщения;
	
	Попытка
		З.Записать();
	Исключение
		Данные = СтрШаблон("Сигнатура = %1,  Дата = %2, Инициатор = %3, АбонентВнешний = %4, Комментарий = %5, СигнатураПочтовогоСообщения = %6", Сигнатура, Дата, Инициатор, АбонентВнешний, Комментарий, СигнатураПочтовогоСообщения);
		ЗаписьЖурналаРегистрации("ИнтернетЗаявки.Добавить()", УровеньЖурналаРегистрации.Ошибка, , Данные, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;  
	Возврат Истина
	
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Данные = "Сигнатура="+Сигнатура+"; ИмяРеквизита="+ИмяРеквизита+"; ЗначениеРеквизита="+ЗначениеРеквизита;
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ИнтернетЗаявки.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ИнтернетЗаявки, Данные, ОписаниеОшибки());
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
		
КонецФункции
