Функция Добавить(Сигнатура, Дата, Номер, Ссылка, Наименование) Экспорт
	Рез = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Дата) = Тип("Дата");
	Доступно = Доступно И ТипЗнч(Номер) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Наименование) = Тип("Строка");
	Если Не Доступно Тогда
		Возврат Рез;
	КонецЕсли;
	
	Зап = РегистрыСведений.ЗвонкиСделки.СоздатьМенеджерЗаписи();
	Зап.Сигнатура = Сигнатура;
	Зап.Прочитать();
	
	Если Зап.Выбран() Тогда
		Возврат Рез;
	КонецЕсли;
	
	Зап.Сигнатура 	 = Сигнатура;
	Зап.Дата 	 	 = Дата;
	Зап.Номер 		 = Номер;
	Зап.Ссылка		 = Ссылка;
	Зап.Наименование = Наименование;
	
	Попытка 
		Зап.Записать();
	Исключение
		Данные = "Сигнатура = "+Сигнатура+"; Дата = "+Дата+"; Номер = "+Номер+"; Наименование = "+Наименование;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗвонкиСделки, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки;
	
	Рез = Истина;
КонецФункции