
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Видимость закладок
	//---------------------
	Доступно = ПараметрыСеанса.РольДоступнаАдминистратор;
	ЭтаФорма.Элементы.ГрЯАдминистратор.Видимость 	= Доступно;
	ЭтаФорма.Элементы.ГрЯпостановщик.Видимость 		= Доступно;
	ЭтаФорма.Элементы.ГрЯНаблюдатель.Видимость		= Доступно;
		
	// Список Я - Исполнитель: параметр текущий пользователь и отбор по невыполненным задачам
	//----------------------------------------------------------------------------------------
	ЭтаФорма.Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ЭлОтбора = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = Ложь ;
	ЭлОтбора.Использование 	= Истина;	

	// Список Я - Постановщик: параметр текущий пользователь и отбор по невыполненным задачам
	//--------------------------------------------------------------------------------------------
	ЭтаФорма.СписокПостановщик.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ЭтаФорма.Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ЭлОтбора = ЭтаФорма.СписокПостановщик.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = Ложь ;
	ЭлОтбора.Использование 	= Истина;	
	
	//Список Я - наблюдатель: параметр текущий пользователь и отбор по невыполненным задачам
	//---------------------------------------------------------------------------------------
	ЭтаФорма.СписокНаблюдатель.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);	
	
	ЭлОтбора = ЭтаФорма.СписокНаблюдатель.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = Ложь ;
	ЭлОтбора.Использование 	= Истина;
	
	//Закладка Я - Администратор: видимость и отбор по невыполненным задачам
	//------------------------------------------------------------------------
	
	ЭлОтбора = ЭтаФорма.СписокАдминистратор.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = Ложь ;
	ЭлОтбора.Использование 	= Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь();
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = Элемент.ТекущиеДанные.Ссылка;
	БизнесПроцесс = Элемент.ТекущиеДанные.БизнесПроцесс;
	
	Доступно = ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь");
	Доступно = Доступно И ЗначениеЗаполнено(Задача);
	Доступно = Доступно И ЗначениеЗаполнено(БизнесПроцесс);

	Если Не Доступно Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФормуЗадачи(Задача, БизнесПроцесс)	
КонецПроцедуры

&НаКлиенте
Процедура СписокЯПостановщикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = Элемент.ТекущиеДанные.Ссылка;
	БизнесПроцесс = Элемент.ТекущиеДанные.БизнесПроцесс;
	
	Доступно = ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь");
	Доступно = Доступно И ЗначениеЗаполнено(Задача);
	Доступно = Доступно И ЗначениеЗаполнено(БизнесПроцесс);
	
	Если Не Доступно Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФормуЗадачи(Задача, БизнесПроцесс)	
КонецПроцедуры

&НаКлиенте
Процедура СписокНаблюдательВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = Элемент.ТекущиеДанные.Ссылка;
	БизнесПроцесс = Элемент.ТекущиеДанные.БизнесПроцесс;
	
	Доступно = ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь");
	Доступно = Доступно И ЗначениеЗаполнено(Задача);
	Доступно = Доступно И ЗначениеЗаполнено(БизнесПроцесс);
	
	Если Не Доступно Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФормуЗадачи(Задача, БизнесПроцесс);	

КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуЗадачи(Задача, БизнесПроцесс)
	
	Парам = Новый Структура("Ключ", Задача);
	ОткрытьФорму("Задача.ЗадачаОбратнаяСвязь.Форма.ФормаЗадачи", Парам, ЭтаФорма);	
КонецФункции

&НаКлиенте
Процедура СписокАдминистраторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Задача = Элемент.ТекущиеДанные.Ссылка;
	БизнесПроцесс = Элемент.ТекущиеДанные.БизнесПроцесс;
	
	Доступно = ТипЗнч(Задача) = Тип("ЗадачаСсылка.ЗадачаОбратнаяСвязь");
	Доступно = Доступно И ЗначениеЗаполнено(Задача);
	Доступно = Доступно И ЗначениеЗаполнено(БизнесПроцесс);
	
	Если Не Доступно Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФормуЗадачи(Задача, БизнесПроцесс);	

КонецПроцедуры



