Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
	ПараметрыДанных.УстановитьЗначениеПараметра("Свойство",		Справочники.ИдентификаторыСтрокИнтернетЗаявок.НайтиПоНаименованию("type_car"));
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры

