
Процедура ПередЗаписью(Отказ)
		
	//Перед записью не выполненной задачи
	//===================================	
	Если Не Выполнена Тогда
		Если ТипЗнч(ЭтотОбъект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ОбратнаяСвязьЛояльности") Тогда
			//Плановый исполнитель
			//---------------------
			Если Не ЗначениеЗаполнено(Исполнитель) Тогда
				Исполнитель = ПроцессыСервер.НазначьИсполнителя(Роль, Подразделение, ДопРеквизитАдресации);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	//При записи выполненной задачи
	//=============================	
	Если Выполнена Тогда
		//Фактический исполнитель
		//------------------------
		Если Не ЗначениеЗаполнено(ИсполнительФакт) Тогда  
			ИсполнительФакт = ПараметрыСеанса.ТекущийПользователь; 
		КонецЕсли;
	
		//Дата выполнения
		//----------------
		Если Не ЗначениеЗаполнено(ДатаВыполнения) Тогда
			ДатаВыполнения = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СтрНайти(Наименование, "Проверить") Тогда
		
		Если Не ЗначениеЗаполнено(ОценкаВыполненияПредшествующейЗадачи)Тогда
    
   	 	// Если он не заполнен, сообщим об этом пользователю
		//--------------------------------------------------
 	   	Сообщение = Новый СообщениеПользователю();
    	Сообщение.Текст = "Не указана оценка";
    	Сообщение.Поле = "ОценкаВыполненияПредшествующейЗадачи";
    	Сообщение.УстановитьДанные(ЭтотОбъект);
    	Сообщение.Сообщить();
		
		Сообщить( "Не указана оценка");

    	// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Покупатель"
		//--------------------------------------------------------------------------------------
   		// ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОценкаВыполненияПредшествующейЗадачи"));
   		 Отказ = Истина;

	КонецЕсли;
        
КонецЕсли;


КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры
