Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//ПараметрыДанных.УстановитьЗначениеПараметра("Начало", 		Период.ДатаНачала);
	//ПараметрыДанных.УстановитьЗначениеПараметра("Окончание", 	Период.ДатаОкончания);
	
	Ткст = ЭтотОбъект.ПолучитьМакет("КодыНаименованияРегионов");
	Строк = Ткст.КоличествоСтрок();
	Если Строк= 0 Тогда
		Возврат;
	КонецЕсли;
	
	//<Бизнесс-данные>
	Если ЭтотОбъект.ВыбранныйВариантОтчета = "а" Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Звонки.Регион.Код КАК КодРегионаСтрокой,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ01
		|ИЗ
		|	РегистрСведений.Звонки КАК Звонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
		|		ПО (Стат.Сигнатура = Звонки.Сигнатура)
		|ГДЕ
		|	Звонки.Дата МЕЖДУ &Начало И &Окончание
		|	И Стат.КЦСсылка.Код = ""000000265""
		|
		|СГРУППИРОВАТЬ ПО
		|	Звонки.Регион.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ01.КодРегионаСтрокой КАК КодРегиона,
		|	ВТ01.Количество КАК Количество
		|ИЗ
		|	ВТ01 КАК ВТ01
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ01.Количество) КАК Макс,
		|	МИНИМУМ(ВТ01.Количество) КАК Мин,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВТ01.Количество) КАК ЧИСЛО(10, 0)) КАК Сред
		|ИЗ
		|	ВТ01 КАК ВТ01";
	ИначеЕсли ЭтотОбъект.ВыбранныйВариантОтчета = "б" Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Звонки.Регион.Код КАК КодРегионаСтрокой,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ВТ01
		|ИЗ
		|	РегистрСведений.Звонки КАК Звонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Стат
		|		ПО (Стат.Сигнатура = Звонки.Сигнатура)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСделки КАК Сделки
		|		ПО Звонки.Сигнатура = Сделки.Сигнатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиЦелевые КАК Целевые
		|		ПО Звонки.Сигнатура = Целевые.Сигнатура
		|ГДЕ
		|	Звонки.Дата МЕЖДУ &Начало И &Окончание
		|	И Стат.КЦСсылка.Код = ""000000265""
		|
		|СГРУППИРОВАТЬ ПО
		|	Звонки.Регион.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ01.КодРегионаСтрокой КАК КодРегиона,
		|	ВТ01.Количество КАК Количество
		|ИЗ
		|	ВТ01 КАК ВТ01
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ01.Количество) КАК Макс,
		|	МИНИМУМ(ВТ01.Количество) КАК Мин,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВТ01.Количество) КАК ЧИСЛО(10, 0)) КАК Сред
		|ИЗ
		|	ВТ01 КАК ВТ01";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",  Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Звонк 	= РезультатЗапроса[1].Выгрузить();
	МинМакс	= РезультатЗапроса[2].Выгрузить();
	Макс = МинМакс[0].Макс;
	Мин	 = МинМакс[0].Мин;
	Сред = МинМакс[0].Сред;
	
	Для Каждого Зв Из Звонк Цикл
		Зв.КодРегиона = СтрЗаменить(Зв.КодРегиона, "00", "0");
		Если СтрДлина(Зв.КодРегиона) = 3 Тогда
			Зв.КодРегиона = Прав(Зв.КодРегиона, 2);
		КонецЕсли;	
	КонецЦикла;
	//</Бизнесс-данные>
	
	Регионы = Новый Структура();
	
	Ргны = Новый ТаблицаЗначений();
	Ргны.Колонки.Добавить("ИмяРегионаКратко");
	Ргны.Колонки.Добавить("ИмяРегиона");
	Ргны.Колонки.Добавить("КодРегиона");
	Ргны.Колонки.Добавить("АдресЯчейки");
	
	//Регионы = Новый Массив();
	Для i=1 По Строк Цикл
		Стр 			 = Ткст.ПолучитьСтроку(i);
		Регион 			 = СтрРазделить(Стр, ",");
		КодРегиона 	 	 = Регион[0];
		ИмяРегиона		 = Регион[1];
		ИмяРегионаКратко = Регион[2];
		Регионы.Вставить(ИмяРегионаКратко, КодРегиона);
		
		Новая = Ргны.Добавить();
		Новая.КодРегиона 		= КодРегиона;
		Новая.ИмяРегионаКратко  = ИмяРегионаКратко;
		Новая.ИмяРегиона		= ИмяРегиона;
		Попытка
			Новая.АдресЯчейки =   Регион[3];
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ТаблДок = ЭтотОбъект.ПолучитьМакет("Карта");
	
	ТаблДок.Область("r39").ЦветФона = WebЦвета.СинеСерый;
	
	Обл = ТаблДок.ПолучитьОбласть("Карта");               	
	Обл.Параметры.Заполнить(Регионы);
	
	//Обл.Область("r1c1").ЦветФона=WebЦвета.СинеСерый;
	Для Каждого Рег Из Ргны Цикл
		
		//Поиск бизнес-данных
		ЗвонкиКоличество = 0;
		ИмяРегиона = "";
		Найденная = Звонк.Найти(Рег.КодРегиона, "КодРегиона");
		Если Найденная <> Неопределено Тогда
			ЗвонкиКоличество = Найденная.Количество;
		КонецЕсли;
		
		АдресЯчейки = Рег.АдресЯчейки; 
		Если Не ЗначениеЗаполнено(АдресЯчейки) Тогда
			Продолжить;
		КонецЕсли;
		
		Цвет = Новый Цвет(0, 0, 255);
		Если 		(Макс - 0.2*Макс) 	<= ЗвонкиКоличество И  ЗвонкиКоличество <=Макс 				Тогда Цвет = Новый Цвет(255, 0, 0);		//red	
		ИначеЕсли 	(Макс - 0.8*Макс)	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Макс - 0.2*Макс)	Тогда Цвет = Новый Цвет(255, 127, 0);	//orange
		ИначеЕсли 	(Сред-0.2*Сред) 	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Макс - 0.8*Макс)	Тогда Цвет = Новый Цвет(255, 255, 0);  	//yellow			
		ИначеЕсли 	(Сред-0.8*Сред) 	<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Сред-0.2*Сред) 	Тогда Цвет = Новый Цвет(0, 255, 0); 	//green
		ИначеЕсли 	(Мин+0.2*Мин)		<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Сред-0.8*Сред)	Тогда Цвет = Новый Цвет(0, 0, 255);		//blue
		ИначеЕсли 	0					<= ЗвонкиКоличество И  ЗвонкиКоличество	< (Мин+0.2*Мин) 	Тогда Цвет = Новый Цвет(255,9,255); 	//purple	
		КонецЕсли;				
		Обл.Область(АдресЯчейки).ЦветФона= Цвет;
		
		Обл.Область(АдресЯчейки).Расшифровка = Рег.ИмяРегиона ;
		Обл.Область(АдресЯчейки).Параметр = Строка(ЗвонкиКоличество)+" - "+Обл.Область(АдресЯчейки).Параметр;
	КонецЦикла;
	
	ДокументРезультат.Вывести(Обл);   
	ДокументРезультат.ТолькоПросмотр = Истина;
	
	
КонецПроцедуры

